content/downloads/emacs/emacs_setup.org
+TITLE: Feng's Emacs configuration
#+AUTHOR: Feng Xia
#+BABEL: :cache yes
#+PROPERTY: header-args :tangle yes
#+LATEX_COMPILER: xelatex
#+STARTUP: indent

I have seen others using org-mode to mangae emacs config, and they
came out very nicely. Finally, after 4 years of using emacs, I ran
into [[https://github.com/pascalfleury/emacs-config][Pascal Fleury]] portal emacs config, and it makes sense to me!!
After trying it out for a couple weeks now, I really like it! So now
after the configs are stable to my taste, and is also growing slowly
when I add new packages and custom stuff, I find the original sections
a bit, confusing. So I'm to take his copy and rearrange it so it fits
my way of thinking. I will not change the fundamental things such as
=tangle=, but will clarify what the packages and configs are about.

* The idea

This idea is actually a bit chicken-egg: in order to tangle, you must
first fire up emacs, then convert this org to =.el=, then load it back
into emacs to take effect.

The key here are relying on two things:

1. There are two version of the =emacs_setup.el= file, one is a dummy
   short version that gets loaded for the very first time. This is the
   same stuff you can recreate using the [[manual tangle]]: =C-c C-v t=.
2. In the default =.emacs, write one line: to load this =.el= file. Then,
   it short version will tangle this org file, and write over itself
   (on disk), thus literally replaced itself w/ more contents. At this
   point, it will tangle all the code blocks in this file, and at the
   end of it, it will call to [[#recompile-packages][recompile packages]], thus kicking off the
   entire download, compiling, installation and configuration.

