content/downloads/emacs/emacs_setup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-07 Tue 09:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Feng Xia" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1a1789a">1. The idea</a></li>
<li><a href="#orgbfacce7">2. Deps</a>
<ul>
<li><a href="#orge573359">2.1. what I want to use</a></li>
</ul>
</li>
<li><a href="#org68223af">3. Clean start</a>
<ul>
<li><a href="#org9c096d1">3.1. .emacs</a></li>
<li><a href="#orgbda1cad">3.2. bootstrap.el</a></li>
</ul>
</li>
<li><a href="#orgb8a2ad1">4. Reset</a>
<ul>
<li><a href="#orgeb150a5">4.1. reset config</a></li>
<li><a href="#recompile-packages">4.2. recompile all packages</a></li>
</ul>
</li>
<li><a href="#orgaa52f6a">5. Initialize emacs</a>
<ul>
<li><a href="#org4e85336">5.1. info header</a></li>
<li><a href="#org1af6e73">5.2. melpa</a></li>
<li><a href="#orgd83792a">5.3. use-package</a></li>
<li><a href="#orge0f1ed8">5.4. tangle this config</a>
<ul>
<li><a href="#orgbc2c4ec">5.4.1. manual tangle</a></li>
<li><a href="#org7098d6a">5.4.2. auto tangle</a></li>
</ul>
</li>
<li><a href="#org2d7d322">5.5. surpress "add-handle-definition&#x2026;" error</a></li>
</ul>
</li>
<li><a href="#org3522444">6. Base packages</a>
<ul>
<li><a href="#orge6e1d2f">6.1. all-the-icons</a></li>
<li><a href="#org7d066f3">6.2. rainbow-mode</a></li>
<li><a href="#hydra">6.3. Hydra</a></li>
<li><a href="#org3ecb77e">6.4. whichkey</a></li>
</ul>
</li>
<li><a href="#org13a5591">7. Global stuff</a>
<ul>
<li><a href="#orga38d852">7.1. by packages</a>
<ul>
<li><a href="#org8ad0f8b">7.1.1. UTF-8</a></li>
<li><a href="#orga74e237">7.1.2. shell env</a></li>
</ul>
</li>
<li><a href="#org4f7e004">7.2. UTF-8 env</a></li>
<li><a href="#org0bd1e32">7.3. browser (default: chrome)</a></li>
<li><a href="#org8c7e13d">7.4. emacs server (default: off)</a></li>
<li><a href="#org5d0d836">7.5. newline (only Unix wanted)</a></li>
<li><a href="#org31b198b">7.6. auto revert</a></li>
<li><a href="#org6395748">7.7. yes-or-no</a></li>
<li><a href="#org9242036">7.8. hide menu bar &amp; toolbar</a></li>
<li><a href="#org2963f91">7.9. alternate key mappings</a></li>
<li><a href="#org494e7f4">7.10. macros (default: off)</a></li>
<li><a href="#orgb89a0a7">7.11. linum</a></li>
<li><a href="#org3bd3a34">7.12. disable electric-indent</a></li>
<li><a href="#org5a1b9e6">7.13. set clipboard to utf-8</a></li>
</ul>
</li>
<li><a href="#org33a0787">8. Font, theme</a>
<ul>
<li><a href="#org86da230">8.1. by packages</a>
<ul>
<li><a href="#org4189640">8.1.1. sublime themes (default: spolsky)</a></li>
<li><a href="#org3eae96f">8.1.2. mode lines</a></li>
<li><a href="#org8ef3f3f">8.1.3. delight</a></li>
<li><a href="#org1083fc8">8.1.4. multiple-cursors</a></li>
<li><a href="#org90aec76">8.1.5. dimmer</a></li>
<li><a href="#orgf2edc60">8.1.6. highlight indent</a></li>
</ul>
</li>
<li><a href="#orgb39f714">8.2. fontlock</a></li>
<li><a href="#org36c892b">8.3. faces</a></li>
<li><a href="#org479c9d5">8.4. be quiet</a></li>
<li><a href="#orgf25623e">8.5. In terminal mode</a></li>
<li><a href="#org42be3fe">8.6. In X11 mode: mouse and window title</a></li>
<li><a href="#org4b053c9">8.7. dynamic cursor colors</a></li>
</ul>
</li>
<li><a href="#orgf025bb4">9. Coding</a>
<ul>
<li><a href="#org4d2a040">9.1. set authinfo as source</a></li>
<li><a href="#orgd61d9c9">9.2. taskjuggler-mode (tj3-mode)</a></li>
<li><a href="#org1d3ba9b">9.3. Version control</a>
<ul>
<li><a href="#org5d6fb83">9.3.1. magit</a></li>
<li><a href="#org1b2724f">9.3.2. monky</a></li>
<li><a href="#orgf0b2df6">9.3.3. git informations in gutter</a></li>
<li><a href="#org5c92c1c">9.3.4. speedup VCS</a></li>
<li><a href="#orgebcff37">9.3.5. global caller</a></li>
<li><a href="#orgb326beb">9.3.6. forge</a></li>
<li><a href="#org9fe0007">9.3.7. code review</a></li>
<li><a href="#org02e15f7">9.3.8. github review</a></li>
</ul>
</li>
<li><a href="#orge00fc98">9.4. Projectile</a></li>
<li><a href="#org62a71da">9.5. debug w/ GDB</a>
<ul>
<li><a href="#org0c21988">9.5.1. <span class="todo TODO">TODO</span> Make it so that the source frame placement is forced only when using gdb.</a></li>
</ul>
</li>
<li><a href="#org0f88ff7">9.6. editing</a>
<ul>
<li><a href="#orgba482b2">9.6.1. diffing</a></li>
<li><a href="#org067f400">9.6.2. yasnippet</a></li>
<li><a href="#org1a55145">9.6.3. commenting out</a></li>
<li><a href="#org059092e">9.6.4. deduplicate and sort</a></li>
<li><a href="#orgb449ec4">9.6.5. selective display (default: off)</a></li>
<li><a href="#orgb559e77">9.6.6. hightlight-indent-guide-mode</a></li>
<li><a href="#org330c14a">9.6.7. folding by indent level</a></li>
</ul>
</li>
<li><a href="#org6640e38">9.7. IRC</a></li>
<li><a href="#orgc2c84da">9.8. restclient</a></li>
<li><a href="#orgd644334">9.9. lsp</a></li>
<li><a href="#orgab48dc9">9.10. languages</a>
<ul>
<li><a href="#org7905d77">9.10.1. markdown</a></li>
<li><a href="#org7a085fe">9.10.2. C/C++</a></li>
<li><a href="#org7283245">9.10.3. python</a></li>
<li><a href="#org05c18d9">9.10.4. web-mode</a></li>
<li><a href="#orgc9148d5">9.10.5. emmet-mode</a></li>
<li><a href="#org21eb8a4">9.10.6. javascript family: .js .ts .jsx</a></li>
<li><a href="#orgffb48d1">9.10.7. csv</a></li>
<li><a href="#orgf94ed3d">9.10.8. json</a></li>
<li><a href="#orgac07113">9.10.9. yaml</a></li>
<li><a href="#org44a4e54">9.10.10. jenkins</a></li>
<li><a href="#org83ae7f3">9.10.11. SQL</a></li>
<li><a href="#org8921601">9.10.12. Microsoft DAX</a></li>
<li><a href="#org3712e97">9.10.13. Terraform</a></li>
<li><a href="#org97134b5">9.10.14. Java</a></li>
</ul>
</li>
<li><a href="#org89a338f">9.11. LAST: enforce my tab style</a></li>
</ul>
</li>
<li><a href="#org85083e4">10. Buffers</a>
<ul>
<li><a href="#org5d4f00a">10.1. by packages</a>
<ul>
<li><a href="#org511cffa">10.1.1. multi desktops: eyebrowse</a></li>
<li><a href="#org931516d">10.1.2. select buffer</a></li>
<li><a href="#orgbfc7ec0">10.1.3. buffer naming</a></li>
</ul>
</li>
<li><a href="#orgcd5071a">10.2. save &amp; restore buffers</a></li>
<li><a href="#org6472802">10.3. switch window config: winner-mode</a></li>
<li><a href="#orgaf585fb">10.4. toggle maximize buffer</a></li>
<li><a href="#orge24969e">10.5. buffer decorations</a></li>
</ul>
</li>
<li><a href="#org32403aa">11. Editing</a>
<ul>
<li><a href="#org964cb45">11.1. by packages</a>
<ul>
<li><a href="#orga3d53c0">11.1.1. auto company</a></li>
<li><a href="#org2bd6d66">11.1.2. undo tree</a></li>
<li><a href="#org79e098d">11.1.3. search &amp; jump</a></li>
<li><a href="#org781adf2">11.1.4. max 80 cols wide</a></li>
<li><a href="#org21f853a">11.1.5. highlight whitespace &amp; lines &gt; 80 long</a></li>
<li><a href="#orgbff639e">11.1.6. browse kill ring</a></li>
<li><a href="#org43ab51f">11.1.7. parenthesis</a></li>
<li><a href="#orgb4cd88a">11.1.8. string inflection (default: some modes)</a></li>
<li><a href="#orgd5ed151">11.1.9. annotate-mode (default: some modes)</a></li>
<li><a href="#orgf1674cb">11.1.10. writeroom-mode (default: off)</a></li>
<li><a href="#orgc53aa49">11.1.11. anzu</a></li>
<li><a href="#orgf85a357">11.1.12. move-text</a></li>
<li><a href="#orgbe6fe49">11.1.13. tabs to 2</a></li>
</ul>
</li>
<li><a href="#orgc47d845">11.2. no trailing spaces</a></li>
<li><a href="#org875fd07">11.3. iedit mode</a></li>
<li><a href="#org7738147">11.4. ediff</a></li>
</ul>
</li>
<li><a href="#org5b8939f">12. Navigate file &amp; dir</a>
<ul>
<li><a href="#org391a73b">12.1. dir hack</a></li>
<li><a href="#org97ea6d0">12.2. dired-rainbow</a></li>
<li><a href="#org695c306">12.3. dired-narrow</a></li>
<li><a href="#orgaa42d68">12.4. dired-collapse</a></li>
<li><a href="#org36b9330">12.5. dired-filter</a></li>
<li><a href="#treemacs">12.6. treemacs (default: off)</a></li>
</ul>
</li>
<li><a href="#orgd79cfd6">13. Helm</a></li>
<li><a href="#org065f193">14. Write chinese</a></li>
<li><a href="#orge07ad8d">15. Office stuff</a>
<ul>
<li><a href="#org7327279">15.1. mu4e email</a>
<ul>
<li><a href="#org6b288d5">15.1.1. install &amp; minimal setup</a></li>
<li><a href="#org8067ce0">15.1.2. mu4e-column-faces</a></li>
<li><a href="#orgdab0091">15.1.3. customize face</a></li>
<li><a href="#org15cde9b">15.1.4. context</a></li>
<li><a href="#org2853098">15.1.5. how to get mails</a></li>
<li><a href="#org90ac64f">15.1.6. list view</a></li>
<li><a href="#org242988b">15.1.7. read &amp; attachment</a></li>
<li><a href="#org282ec0f">15.1.8. write new</a></li>
<li><a href="#org2618fc3">15.1.9. send</a></li>
<li><a href="#org02168b0">15.1.10. reply</a></li>
<li><a href="#org7388a56">15.1.11. kill all buffer upon exit</a></li>
<li><a href="#org322d6a4">15.1.12. write html</a></li>
<li><a href="#org501f18c">15.1.13. capture to org</a></li>
</ul>
</li>
<li><a href="#org8081f53">15.2. slack</a></li>
</ul>
</li>
<li><a href="#org6b2c87f">16. Hobbies</a>
<ul>
<li><a href="#org9e8806c">16.1. elfeed</a></li>
<li><a href="#orgd95ce28">16.2. taskjuggler</a></li>
</ul>
</li>
<li><a href="#org804ba92">17. My doc writing</a>
<ul>
<li><a href="#org89ddb04">17.1. pandoc</a></li>
</ul>
</li>
<li><a href="#orge9eee46">18. The big Org</a>
<ul>
<li><a href="#org2402b51">18.1. init</a>
<ul>
<li><a href="#org7ca50e1">18.1.1. NEXT This does not seem to work, check out doc about defcustom</a></li>
</ul>
</li>
<li><a href="#orgfdd192f">18.2. others</a>
<ul>
<li><a href="#org4aa53fa">18.2.1. by packages</a></li>
<li><a href="#org27305a3">18.2.2. snippets found online</a></li>
</ul>
</li>
<li><a href="#orgff6c1af">18.3. key mappings</a></li>
<li><a href="#org9dd3d9c">18.4. display settings</a>
<ul>
<li><a href="#org3b42cf4">18.4.1. org-bullets</a></li>
<li><a href="#org414bdee">18.4.2. headline font</a></li>
<li><a href="#orgdc34b5d">18.4.3. custom font</a></li>
</ul>
</li>
<li><a href="#orga65c399">18.5. writing stuff</a>
<ul>
<li><a href="#orga994828">18.5.1. by packages</a></li>
<li><a href="#org2eeff9f">18.5.2. org-link-abbrev</a></li>
<li><a href="#org2f0dd9f">18.5.3. auto line wrap</a></li>
</ul>
</li>
<li><a href="#org659f048">18.6. export</a>
<ul>
<li><a href="#org72964ea">18.6.1. org-babel</a></li>
<li><a href="#org4da5f14">18.6.2. markdown</a></li>
<li><a href="#org3fcd8c5">18.6.3. beamer</a></li>
<li><a href="#org7a4ce17">18.6.4. org-reveal</a></li>
<li><a href="#org67e6b3f">18.6.5. odt</a></li>
<li><a href="#orgc75c8a5">18.6.6. taskjuggler</a></li>
<li><a href="#org947d522">18.6.7. confluence</a></li>
</ul>
</li>
<li><a href="#org9ad2aa0">18.7. managing life (aka. agenda/todo)</a>
<ul>
<li><a href="#org1f53801">18.7.1. where are my agenda files</a></li>
<li><a href="#org352bb6a">18.7.2. by packages</a></li>
<li><a href="#org5efcf54">18.7.3. keywords &amp; status state machine</a></li>
<li><a href="#orga909a1d">18.7.4. priorities</a></li>
<li><a href="#org09928f2">18.7.5. capture &amp; refile</a></li>
<li><a href="#org68bb15f">18.7.6. task tracking</a></li>
<li><a href="#org47f9887">18.7.7. effort &amp; columns mode</a></li>
<li><a href="#orga76b7b8">18.7.8. shortcut to open first agenda file</a></li>
<li><a href="#org62b11f1">18.7.9. org-agenda</a></li>
<li><a href="#org76bd4ca">18.7.10. org-clock properties</a></li>
</ul>
</li>
<li><a href="#org76581bc">18.8. LAST step: reload org</a></li>
</ul>
</li>
<li><a href="#org3db076a">19. THE END</a></li>
</ul>
</div>
</div>
<p>
+TITLE: Feng's Emacs configuration
</p>
<p>
I have seen others using org-mode to mangae emacs config, and they
came out very nicely. Finally, after 4 years of using emacs, I ran
into <a href="https://github.com/pascalfleury/emacs-config">Pascal Fleury</a> portal emacs config, and it makes sense to me!!
After trying it out for a couple weeks now, I really like it! So now
after the configs are stable to my taste, and is also growing slowly
when I add new packages and custom stuff, I find the original sections
a bit, confusing. So I'm to take his copy and rearrange it so it fits
my way of thinking. I will not change the fundamental things such as
<code>tangle</code>, but will clarify what the packages and configs are about.
</p>

<div id="outline-container-org1a1789a" class="outline-2">
<h2 id="org1a1789a"><span class="section-number-2">1</span> The idea</h2>
<div class="outline-text-2" id="text-1">
<p>
This idea is actually a bit chicken-egg: in order to tangle, you must
first fire up emacs, then convert this org to <code>.el</code>, then load it back
into emacs to take effect.
</p>

<p>
The key here are relying on two things:
</p>

<ol class="org-ol">
<li>There are two version of the <code>emacs_setup.el</code> file, one is a dummy
short version that gets loaded for the very first time. This is the
same stuff you can recreate using the <a href="#orgbc2c4ec">5.4.1</a>: <code>C-c C-v t</code>.</li>
<li>In the default <code>.emacs, write one line: to load this =.el</code> file. Then,
it short version will tangle this org file, and write over itself
(on disk), thus literally replaced itself w/ more contents. At this
point, it will tangle all the code blocks in this file, and at the
end of it, it will call to <a href="#recompile-packages">recompile packages</a>, thus kicking off the
entire download, compiling, installation and configuration.</li>
</ol>
</div>
</div>
