content/downloads/emacs/emacs_setup.org
* Deps

There are some host packages/tools you need to install. These are not
hard dependencies, but really, it works better that way if they are there.

I have been thinking how to handle them. The original author uses
tangle to create a bash file. So the idea is to run this =.sh=
first. But then, I think there are two problems:

1. host package manager is different, eg. =apt= for Ubuntu, and =yum= for Cent.
2. package name changes sometimes, and not mention, the packages are
   completely different among distributions.

   So all in all, I think it's much better to simply list what I want
   to have, and then let some offline research/google to handle how to
   install them. Another idea is to build a Docker image w/ all thest
   inside. Hmm... I may try that someday.

** what I want to use

I'll simply keep a list:

1. [[https://github.com/ggreer/the_silver_searcher][silver searcher, aka. ag]]
2. [[https://github.com/nvm-sh/nvm][nvm]]: needed for Node
3. [[https://prettier.io/docs/en/install.html][prettier]]: require Node first
4. sqlite3: needed by org-roam
5. [[https://github.com/hakimel/reveal.js/][reveal.js]]: needed to enable org-export to reveal slides
6. [[https://plantuml.com/download][plantuml.jar]]
7. [[https://packages.ubuntu.com/search?keywords=mu4e][mu4e]] & [[https://packages.ubuntu.com/search?keywords=isync][isync]] (this give you =mbsync=)
8. [[https://github.com/mguessan/davmail][davmail]]

* Clean start

*ASSUMPTION*:

1. you have installed emacs. Using v26.3 as of writing.
2. determine where to put this org file. Throughout this doc, we are
   assuming =~/Emacs/= as the folder.

Once you are here, starting from a clean sheet is pretty easy:

1. delete all your old =.emacs=, =.emacs.d=, or back them up somewhere.
2. tangle this org file into a ~.el~ file. To make things easier, I'm
   going to include the =.el= in the repo. So just copy it.
3. create a ~.emacs~ file, and write one line =(load-file
   "~/Emacs/emacs_setup.el")=, essentially tells emacs where to find
   the initial config file.
4. make sure Emacs re-interprets its init (you could restart it).

That's it. Just sit back and watch emacs download and compile things,
and after it's done, you will be given the power of this beautiful
editor, all configured and ready to go! Now to think of it, isn't this
what LOC is trying to achieve!?

** .emacs

I have my config in directory =~/Emacs= which is where I clone this
repository. The config setup is maintained purely in the
=~/Emacs/emacs_setup.org= file.

In your =~/.emacs= file, all you need to add is

#+NAME: emacs_bootstrap
#+BEGIN_SRC emacs-lisp :tangle ./dot_emacs.el
  ;; Loads Feng's emacs setup with bootstrap
  (load-file "~/Emacs/emacs_setup.el")
#+END_SRC

** bootstrap.el

Put this in the =~/Emacs/emacs_setup.el=, and viola, it will regnerate itself!

#+BEGIN_SRC emacs-lisp :tangle /tmp/emacs_setup.el

;; This is the initial state of the file to be loaded.
;; It will replace itself with the actual configuration at first run.

(require 'org) ; We can't tangle without org!

(setq config_base (expand-file-name "emacs_setup"
				    (file-name-directory
				     (or load-file-name buffer-file-name))))
(find-file (concat config_base ".org"))        ; Open the configuration
(org-babel-tangle)                             ; tangle it
(load-file (concat config_base ".el"))         ; load it
(byte-compile-file (concat config_base ".el")) ; finally byte-compile it
#+END_SRC

* Reset

Reset takes two steps, but you can do either or both, depending on
what you are trying to reset.

** reset config

If you have made a change to this org and what's to test drive it, you
need to either [[manual tangle]] or just save this file to trigger [[auto
tangle]]. Sometimes, I found I have to go the [[manual tangle]] route
because the hook is not fired. This is understandable that when I'm
changing this file, it may render a broken config, thus the hook and
all others can be in a comprised state when you start emacs.

** recompile all packages
:PROPERTIES:
:CUSTOM_ID: recompile-packages
:END:

This is the *RESET* button. This will force-recompile everything in
=~/.emacs.d/elpa/...= Just run =M-:= and then enter this:

#+BEGIN_SRC emacs-lisp :tangle no
  (byte-recompile-directory package-user-dir nil 'force)
#+END_SRC

or simply =C-x C-e= at the end of that line.

*Note* that by setting =:tangle no=, this piece of code will be included
into the =.el= file. So it stays inside this org. Nice.

* Initialize emacs

** info header

Just to add a little information in the tangled file so you don't
*manually* mess with the generated =.el= file.

#+BEGIN_SRC emacs-lisp
;; ===== this file was auto-tangled, only edit the emacs_setup.org =====
#+END_SRC

