content/downloads/emacs/emacs_setup.html

<div id="outline-container-orgbfacce7" class="outline-2">
<h2 id="orgbfacce7"><span class="section-number-2">2</span> Deps</h2>
<div class="outline-text-2" id="text-2">
<p>
There are some host packages/tools you need to install. These are not
hard dependencies, but really, it works better that way if they are there.
</p>

<p>
I have been thinking how to handle them. The original author uses
tangle to create a bash file. So the idea is to run this <code>.sh</code>
first. But then, I think there are two problems:
</p>

<ol class="org-ol">
<li>host package manager is different, eg. <code>apt</code> for Ubuntu, and <code>yum</code> for Cent.</li>
<li><p>
package name changes sometimes, and not mention, the packages are
completely different among distributions.
</p>

<p>
So all in all, I think it's much better to simply list what I want
to have, and then let some offline research/google to handle how to
install them. Another idea is to build a Docker image w/ all thest
inside. Hmm&#x2026; I may try that someday.
</p></li>
</ol>
</div>

<div id="outline-container-orge573359" class="outline-3">
<h3 id="orge573359"><span class="section-number-3">2.1</span> what I want to use</h3>
<div class="outline-text-3" id="text-2-1">
<p>
I'll simply keep a list:
</p>

<ol class="org-ol">
<li><a href="https://github.com/ggreer/the_silver_searcher">silver searcher, aka. ag</a></li>
<li><a href="https://github.com/nvm-sh/nvm">nvm</a>: needed for Node</li>
<li><a href="https://prettier.io/docs/en/install.html">prettier</a>: require Node first</li>
<li>sqlite3: needed by org-roam</li>
<li><a href="https://github.com/hakimel/reveal.js/">reveal.js</a>: needed to enable org-export to reveal slides</li>
<li><a href="https://plantuml.com/download">plantuml.jar</a></li>
<li><a href="https://packages.ubuntu.com/search?keywords=mu4e">mu4e</a> &amp; <a href="https://packages.ubuntu.com/search?keywords=isync">isync</a> (this give you <code>mbsync</code>)</li>
<li><a href="https://github.com/mguessan/davmail">davmail</a></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org68223af" class="outline-2">
<h2 id="org68223af"><span class="section-number-2">3</span> Clean start</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>ASSUMPTION</b>:
</p>

<ol class="org-ol">
<li>you have installed emacs. Using v26.3 as of writing.</li>
<li>determine where to put this org file. Throughout this doc, we are
assuming <code>~/Emacs/</code> as the folder.</li>
</ol>

<p>
Once you are here, starting from a clean sheet is pretty easy:
</p>

<ol class="org-ol">
<li>delete all your old <code>.emacs</code>, <code>.emacs.d</code>, or back them up somewhere.</li>
<li>tangle this org file into a <code>.el</code> file. To make things easier, I'm
going to include the <code>.el</code> in the repo. So just copy it.</li>
<li>create a <code>.emacs</code> file, and write one line <code>(load-file
   "~/Emacs/emacs_setup.el")</code>, essentially tells emacs where to find
the initial config file.</li>
<li>make sure Emacs re-interprets its init (you could restart it).</li>
</ol>

<p>
That's it. Just sit back and watch emacs download and compile things,
and after it's done, you will be given the power of this beautiful
editor, all configured and ready to go! Now to think of it, isn't this
what LOC is trying to achieve!?
</p>
</div>

<div id="outline-container-org9c096d1" class="outline-3">
<h3 id="org9c096d1"><span class="section-number-3">3.1</span> .emacs</h3>
<div class="outline-text-3" id="text-3-1">
<p>
I have my config in directory <code>~/Emacs</code> which is where I clone this
repository. The config setup is maintained purely in the
<code>~/Emacs/emacs_setup.org</code> file.
</p>

<p>
In your <code>~/.emacs</code> file, all you need to add is
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgda14489"><span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Loads Feng's emacs setup with bootstrap</span>
<span style="color: #8c8c8c;">(</span>load-file <span style="color: #EEDC82;">"~/Emacs/emacs_setup.el"</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbda1cad" class="outline-3">
<h3 id="orgbda1cad"><span class="section-number-3">3.2</span> bootstrap.el</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Put this in the <code>~/Emacs/emacs_setup.el</code>, and viola, it will regnerate itself!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">This is the initial state of the file to be loaded.</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">It will replace itself with the actual configuration at first run.</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">require</span> '<span style="color: #FF80F4;">org</span><span style="color: #8c8c8c;">)</span> <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">We can't tangle without org!</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> config_base <span style="color: #93a8c6;">(</span>expand-file-name <span style="color: #EEDC82;">"emacs_setup"</span>
            <span style="color: #b0b1a3;">(</span>file-name-directory
             <span style="color: #97b098;">(</span><span style="color: #F92672;">or</span> load-file-name buffer-file-name<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>find-file <span style="color: #93a8c6;">(</span>concat config_base <span style="color: #EEDC82;">".org"</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>        <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">Open the configuration</span>
<span style="color: #8c8c8c;">(</span>org-babel-tangle<span style="color: #8c8c8c;">)</span>                             <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">tangle it</span>
<span style="color: #8c8c8c;">(</span>load-file <span style="color: #93a8c6;">(</span>concat config_base <span style="color: #EEDC82;">".el"</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>         <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">load it</span>
<span style="color: #8c8c8c;">(</span>byte-compile-file <span style="color: #93a8c6;">(</span>concat config_base <span style="color: #EEDC82;">".el"</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span> <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">finally byte-compile it</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb8a2ad1" class="outline-2">
<h2 id="orgb8a2ad1"><span class="section-number-2">4</span> Reset</h2>
<div class="outline-text-2" id="text-4">
<p>
Reset takes two steps, but you can do either or both, depending on
what you are trying to reset.
</p>
</div>

<div id="outline-container-orgeb150a5" class="outline-3">
<h3 id="orgeb150a5"><span class="section-number-3">4.1</span> reset config</h3>
<div class="outline-text-3" id="text-4-1">
<p>
If you have made a change to this org and what's to test drive it, you
need to either <a href="#orgbc2c4ec">5.4.1</a> or just save this file to trigger <a href="#org7098d6a">5.4.2</a>. Sometimes, I found I have to go the <a href="#orgbc2c4ec">5.4.1</a> route
because the hook is not fired. This is understandable that when I'm
changing this file, it may render a broken config, thus the hook and
all others can be in a comprised state when you start emacs.
</p>
</div>
</div>

<div id="outline-container-org795cafc" class="outline-3">
<h3 id="recompile-packages"><span class="section-number-3">4.2</span> recompile all packages</h3>
<div class="outline-text-3" id="text-recompile-packages">
<p>
This is the <b>RESET</b> button. This will force-recompile everything in
<code>~/.emacs.d/elpa/...</code> Just run <code>M-:</code> and then enter this:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>byte-recompile-directory package-user-dir nil 'force<span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
or simply <code>C-x C-e</code> at the end of that line.
</p>

<p>
<b>Note</b> that by setting <code>:tangle no</code>, this piece of code will be included
into the <code>.el</code> file. So it stays inside this org. Nice.
</p>
</div>
</div>
</div>

<div id="outline-container-orgaa52f6a" class="outline-2">
<h2 id="orgaa52f6a"><span class="section-number-2">5</span> Initialize emacs</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org4e85336" class="outline-3">
<h3 id="org4e85336"><span class="section-number-3">5.1</span> info header</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Just to add a little information in the tangled file so you don't
<b>manually</b> mess with the generated <code>.el</code> file.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">===== this file was auto-tangled, only edit the emacs_setup.org =====</span>
</pre>
</div>
</div>
</div>
