content/downloads/emacs/emacs_setup.org
** melpa

Make sure we have the package system initialized before we load anything.

#+BEGIN_SRC emacs-lisp
(require 'package)
(when (< emacs-major-version 27)
  (package-initialize))
#+END_SRC

Adding my choice of packages repositories.

#+NAME melpa-setup
#+BEGIN_SRC emacs-lisp
(setq package-archives '(("org" . "https://orgmode.org/elpa/")
                         ("stable-melpa" . "https://stable.melpa.org/packages/")
                         ("melpa" . "https://melpa.org/packages/")
                         ("gnu" . "https://elpa.gnu.org/packages/")
                        ))
#+END_SRC

** use-package

I use =use-package= for most configuration, and that needs to be at the
top of the file.  =use-package= verifies the presence of the requested
package, otherwise installs it, and presents convenient sections for
configs of variables, key bindings etc. that happen only if the
package is actually loaded.

First, make sure it gets installed if it is not there yet.

#+BEGIN_SRC emacs-lisp
  ;; make sure use-package is installed
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
  (require 'use-package)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(eval-when-compile (require 'use-package))
#+END_SRC

** tangle this config
*** manual tangle

I have setup auto tangle in the header as =:tangle yes=. So upon save,
this org file will be tangled into an ~.el~ file, and that is the file
emacs should load.

Alternatively, use the =C-c C-v t= [org-babel-tangle] to do this
manually.

*** auto tangle

I set this up to tangle the init org-mode file into the actual Emacs
init file as soon as I save it.

#+BEGIN_SRC emacs-lisp
  (defun tangle-init ()
    "If the current buffer is 'init.org' the code-blocks are tangled,
  and the tangled file is compiled."
    (when (equal (buffer-file-name)
                 (expand-file-name "~/Emacs/emacs_setup.org"))
      ;; Avoid running hooks when tangling.
      (let ((prog-mode-hook nil))
        (org-babel-tangle)
        (byte-compile-file "~/Emacs/emacs_setup.el"))))

  ;; auto-tangle hook
  (add-hook 'after-save-hook 'tangle-init)
#+END_SRC

#+RESULTS:

** surpress "add-handle-definition..." error

#+BEGIN_SRC emacs-lisp
(custom-set-variables '(ad-redefinition-action (quote accept)))
#+END_SRC

* Base packages

There are some packages you'd better load prior to everything else, so
that when other packages are being configured, they are already
available. For example, the .

** all-the-icons

Want fancy [[https://github.com/domtronn/all-the-icons.el#installation][icons]]:

#+BEGIN_SRC emacs-lisp
  (use-package all-the-icons
    :if (display-graphic-p))
#+END_SRC

You would have to run =M-x all-the-icons-install-fonts= manually at
least once to install fonts to your system.

** rainbow-mode

Colorize color names and codes in the correct color.

#+BEGIN_SRC emacs-lisp
  (use-package rainbow-mode
    :ensure t
    :delight)
#+END_SRC

** Hydra
:PROPERTIES:
:CUSTOM_ID: hydra
:END:

#+BEGIN_SRC emacs-lisp
  (use-package hydra
    :ensure t)
#+END_SRC

** whichkey

Give me a hint when I'm entering a keybinding:
#+BEGIN_SRC emacs-lisp
  (use-package which-key
    :ensure
    :config
    (which-key-setup-side-window-right))
  (which-key-mode)
#+END_SRC

