content/downloads/emacs/emacs_setup.html

<div id="outline-container-org1af6e73" class="outline-3">
<h3 id="org1af6e73"><span class="section-number-3">5.2</span> melpa</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Make sure we have the package system initialized before we load anything.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">require</span> '<span style="color: #FF80F4;">package</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">when</span> <span style="color: #93a8c6;">(</span>&lt; emacs-major-version 27<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>package-initialize<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
Adding my choice of packages repositories.
</p>

<p>
#+NAME melpa-setup
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> package-archives '<span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"org"</span> . <span style="color: #EEDC82;">"https://orgmode.org/elpa/"</span><span style="color: #b0b1a3;">)</span>
                         <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"stable-melpa"</span> . <span style="color: #EEDC82;">"https://stable.melpa.org/packages/"</span><span style="color: #b0b1a3;">)</span>
                         <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"melpa"</span> . <span style="color: #EEDC82;">"https://melpa.org/packages/"</span><span style="color: #b0b1a3;">)</span>
                         <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"gnu"</span> . <span style="color: #EEDC82;">"https://elpa.gnu.org/packages/"</span><span style="color: #b0b1a3;">)</span>
                        <span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd83792a" class="outline-3">
<h3 id="orgd83792a"><span class="section-number-3">5.3</span> use-package</h3>
<div class="outline-text-3" id="text-5-3">
<p>
I use <code>use-package</code> for most configuration, and that needs to be at the
top of the file.  <code>use-package</code> verifies the presence of the requested
package, otherwise installs it, and presents convenient sections for
configs of variables, key bindings etc. that happen only if the
package is actually loaded.
</p>

<p>
First, make sure it gets installed if it is not there yet.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">make sure use-package is installed</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">unless</span> <span style="color: #93a8c6;">(</span>package-installed-p 'use-package<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>package-refresh-contents<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>package-install 'use-package<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">require</span> '<span style="color: #FF80F4;">use-package</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">eval-when-compile</span> <span style="color: #93a8c6;">(</span><span style="color: #F92672;">require</span> '<span style="color: #FF80F4;">use-package</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge0f1ed8" class="outline-3">
<h3 id="orge0f1ed8"><span class="section-number-3">5.4</span> tangle this config</h3>
<div class="outline-text-3" id="text-5-4">
</div>
<div id="outline-container-orgbc2c4ec" class="outline-4">
<h4 id="orgbc2c4ec"><span class="section-number-4">5.4.1</span> manual tangle</h4>
<div class="outline-text-4" id="text-5-4-1">
<p>
I have setup auto tangle in the header as <code>:tangle yes</code>. So upon save,
this org file will be tangled into an <code>.el</code> file, and that is the file
emacs should load.
</p>

<p>
Alternatively, use the <code>C-c C-v t</code> [org-babel-tangle] to do this
manually.
</p>
</div>
</div>

<div id="outline-container-org7098d6a" class="outline-4">
<h4 id="org7098d6a"><span class="section-number-4">5.4.2</span> auto tangle</h4>
<div class="outline-text-4" id="text-5-4-2">
<p>
I set this up to tangle the init org-mode file into the actual Emacs
init file as soon as I save it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">tangle-init</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #EEDC82;">"If the current buffer is 'init.org' the code-blocks are tangled,</span>
<span style="color: #EEDC82;">and the tangled file is compiled."</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">when</span> <span style="color: #b0b1a3;">(</span>equal <span style="color: #97b098;">(</span>buffer-file-name<span style="color: #97b098;">)</span>
               <span style="color: #97b098;">(</span>expand-file-name <span style="color: #EEDC82;">"~/Emacs/emacs_setup.org"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Avoid running hooks when tangling.</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">let</span> <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>prog-mode-hook nil<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
      <span style="color: #97b098;">(</span>org-babel-tangle<span style="color: #97b098;">)</span>
      <span style="color: #97b098;">(</span>byte-compile-file <span style="color: #EEDC82;">"~/Emacs/emacs_setup.el"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">auto-tangle hook</span>
<span style="color: #8c8c8c;">(</span>add-hook 'after-save-hook 'tangle-init<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2d7d322" class="outline-3">
<h3 id="org2d7d322"><span class="section-number-3">5.5</span> surpress "add-handle-definition&#x2026;" error</h3>
<div class="outline-text-3" id="text-5-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>custom-set-variables '<span style="color: #93a8c6;">(</span>ad-redefinition-action <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">quote</span> accept<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3522444" class="outline-2">
<h2 id="org3522444"><span class="section-number-2">6</span> Base packages</h2>
<div class="outline-text-2" id="text-6">
<p>
There are some packages you'd better load prior to everything else, so
that when other packages are being configured, they are already
available. For example, the .
</p>
</div>

<div id="outline-container-orge6e1d2f" class="outline-3">
<h3 id="orge6e1d2f"><span class="section-number-3">6.1</span> all-the-icons</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Want fancy <a href="https://github.com/domtronn/all-the-icons.el#installation">icons</a>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">all-the-icons</span>
  <span style="color: #FF80F4;">:if</span> <span style="color: #93a8c6;">(</span>display-graphic-p<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
You would have to run <code>M-x all-the-icons-install-fonts</code> manually at
least once to install fonts to your system.
</p>
</div>
</div>

<div id="outline-container-org7d066f3" class="outline-3">
<h3 id="org7d066f3"><span class="section-number-3">6.2</span> rainbow-mode</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Colorize color names and codes in the correct color.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">rainbow-mode</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:delight</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcdd854b" class="outline-3">
<h3 id="hydra"><span class="section-number-3">6.3</span> Hydra</h3>
<div class="outline-text-3" id="text-hydra">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">hydra</span>
  <span style="color: #FF80F4;">:ensure</span> t<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3ecb77e" class="outline-3">
<h3 id="org3ecb77e"><span class="section-number-3">6.4</span> whichkey</h3>
<div class="outline-text-3" id="text-6-4">
<p>
Give me a hint when I'm entering a keybinding:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">which-key</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span>which-key-setup-side-window-right<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>which-key-mode<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
</div>
