content/downloads/emacs/emacs_setup.el

(require 'package)
(when (< emacs-major-version 27)
  (package-initialize))

(setq package-archives '(("org" . "https://orgmode.org/elpa/")
                         ("stable-melpa" . "https://stable.melpa.org/packages/")
                         ("melpa" . "https://melpa.org/packages/")
                         ("gnu" . "https://elpa.gnu.org/packages/")
                        ))

;; make sure use-package is installed
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(require 'use-package)

(eval-when-compile (require 'use-package))

(defun tangle-init ()
  "If the current buffer is 'init.org' the code-blocks are tangled,
and the tangled file is compiled."
  (when (equal (buffer-file-name)
               (expand-file-name "~/Emacs/emacs_setup.org"))
    ;; Avoid running hooks when tangling.
    (let ((prog-mode-hook nil))
      (org-babel-tangle)
      (byte-compile-file "~/Emacs/emacs_setup.el"))))

;; auto-tangle hook
(add-hook 'after-save-hook 'tangle-init)

(custom-set-variables '(ad-redefinition-action (quote accept)))

(use-package all-the-icons
  :ensure)

(use-package rainbow-mode
  :ensure t
  :delight)

(use-package hydra
  :ensure t)

(use-package which-key
  :ensure
  :config
  (which-key-setup-side-window-right))
(which-key-mode)
