content/downloads/emacs/emacs_setup.org
* Global stuff

Some global settings such as line number. Well, just about everything
of emacs are global in a sense, say, a package, will affect the look
and behavior when loaded. Even though the mode could be refined to be
loaded only for some file pattern, but hey, the fun is about loading
these funky modes, and with them, a million funky keybinding combos to
remember.

So here, just some obvious value settings. If I find some to be more
topic specific, I will move them into that topic's section instead.

** by packages

These are achieved by using someone's package.

*** UTF-8

Make Emacs request UTF-8 first when pasting stuff

#+BEGIN_SRC emacs-lisp
(use-package unicode-escape
  :ensure t
  :init
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)))
(set-language-environment "UTF-8")
#+END_SRC

*** shell env

#+BEGIN_SRC emacs-lisp
(setq exec-path-from-shell-debug t)
(setenv "SHELL" "/usr/bin/zsh")
(use-package exec-path-from-shell
  :ensure t
  :if (memq window-system '(mac ns x))
  :config
  (exec-path-from-shell-initialize))
#+END_SRC

** UTF-8 env

#+BEGIN_SRC emacs-lisp
  (prefer-coding-system 'utf-8)

  (setenv "LANG" "en_US.UTF-8")
  (setenv "LC_ALL" "en_US.UTF-8")
  (setenv "LC_CTYPE" "en_US.UTF-8")
  (set-language-environment "UTF-8")
#+END_SRC

** browser (default: chrome)

I like Chrome. Period.

#+BEGIN_SRC emacs-lisp
(setq browse-url-generic-program (executable-find "google-chrome")
  browse-url-browser-function 'browse-url-generic)
#+END_SRC

** emacs server (default: off)

Start the background server, so we can use emacsclient.

#+BEGIN_SRC emacs-lisp :tangle no
(server-start)
#+END_SRC

** newline (only Unix wanted)

This should automatically convert any files with dos or Mac line
endings into Unix style ones. Code found [[https://www.emacswiki.org/emacs/EndOfLineTips][here]].

#+BEGIN_SRC emacs-lisp
  (defun no-junk-please-we-are-unixish ()
    (let ((coding-str (symbol-name buffer-file-coding-system)))
      (when (string-match "-\\(?:dos\\|mac\\)$" coding-str)
        (set-buffer-file-coding-system 'unix))))

  (add-hook 'find-file-hook 'no-junk-please-we-are-unixish)
#+END_SRC

** auto revert

Use =auto-revert=, which reloads a file if it's updated on disk and not
modified in the buffer.

#+BEGIN_SRC emacs-lisp
(global-auto-revert-mode 1)
(put 'upcase-region 'disabled nil)
(put 'narrow-to-region 'disabled nil)
#+END_SRC

** yes-or-no

Change all prompts to y or n:

#+BEGIN_SRC emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC

** hide menu bar & toolbar
Using i3 is forcing me to use keyboard.

#+BEGIN_SRC emacs-lisp
  (menu-bar-mode -1)
  (toggle-scroll-bar -1)
  (tool-bar-mode -1)
  (blink-cursor-mode -1)
#+END_SRC

** alternate key mappings

Letting one enter chars that are otherwise difficult in e.g. the
minibuffer.

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-m") 'newline-and-indent)
  (global-set-key (kbd "C-j") 'newline)
  (global-set-key [delete] 'delete-char)
  (global-set-key [kp-delete] 'delete-char)
#+END_SRC

** macros (default: off)

#+BEGIN_SRC emacs-lisp :tangle no
  (global-set-key [f3] 'start-kbd-macro)
  (global-set-key [f4] 'end-kbd-macro)
  (global-set-key [f5] 'call-last-kbd-macro)
#+END_SRC

