content/downloads/emacs/emacs_setup.html

<div id="outline-container-org13a5591" class="outline-2">
<h2 id="org13a5591"><span class="section-number-2">7</span> Global stuff</h2>
<div class="outline-text-2" id="text-7">
<p>
Some global settings such as line number. Well, just about everything
of emacs are global in a sense, say, a package, will affect the look
and behavior when loaded. Even though the mode could be refined to be
loaded only for some file pattern, but hey, the fun is about loading
these funky modes, and with them, a million funky keybinding combos to
remember.
</p>

<p>
So here, just some obvious value settings. If I find some to be more
topic specific, I will move them into that topic's section instead.
</p>
</div>

<div id="outline-container-orga38d852" class="outline-3">
<h3 id="orga38d852"><span class="section-number-3">7.1</span> by packages</h3>
<div class="outline-text-3" id="text-7-1">
<p>
These are achieved by using someone's package.
</p>
</div>

<div id="outline-container-org8ad0f8b" class="outline-4">
<h4 id="org8ad0f8b"><span class="section-number-4">7.1.1</span> UTF-8</h4>
<div class="outline-text-4" id="text-7-1-1">
<p>
Make Emacs request UTF-8 first when pasting stuff
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">unicode-escape</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:init</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> x-select-request-type '<span style="color: #b0b1a3;">(</span>UTF8_STRING COMPOUND_TEXT TEXT STRING<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>set-language-environment <span style="color: #EEDC82;">"UTF-8"</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga74e237" class="outline-4">
<h4 id="orga74e237"><span class="section-number-4">7.1.2</span> shell env</h4>
<div class="outline-text-4" id="text-7-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> exec-path-from-shell-debug t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>setenv <span style="color: #EEDC82;">"SHELL"</span> <span style="color: #EEDC82;">"/usr/bin/zsh"</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">exec-path-from-shell</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:if</span> <span style="color: #93a8c6;">(</span>memq window-system '<span style="color: #b0b1a3;">(</span>mac ns x<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span>exec-path-from-shell-initialize<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4f7e004" class="outline-3">
<h3 id="org4f7e004"><span class="section-number-3">7.2</span> UTF-8 env</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>prefer-coding-system 'utf-8<span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span>setenv <span style="color: #EEDC82;">"LANG"</span> <span style="color: #EEDC82;">"en_US.UTF-8"</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>setenv <span style="color: #EEDC82;">"LC_ALL"</span> <span style="color: #EEDC82;">"en_US.UTF-8"</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>setenv <span style="color: #EEDC82;">"LC_CTYPE"</span> <span style="color: #EEDC82;">"en_US.UTF-8"</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>set-language-environment <span style="color: #EEDC82;">"UTF-8"</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0bd1e32" class="outline-3">
<h3 id="org0bd1e32"><span class="section-number-3">7.3</span> browser (default: chrome)</h3>
<div class="outline-text-3" id="text-7-3">
<p>
I like Chrome. Period.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> browse-url-generic-program <span style="color: #93a8c6;">(</span>executable-find <span style="color: #EEDC82;">"google-chrome"</span><span style="color: #93a8c6;">)</span>
  browse-url-browser-function 'browse-url-generic<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c7e13d" class="outline-3">
<h3 id="org8c7e13d"><span class="section-number-3">7.4</span> emacs server (default: off)</h3>
<div class="outline-text-3" id="text-7-4">
<p>
Start the background server, so we can use emacsclient.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>server-start<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5d0d836" class="outline-3">
<h3 id="org5d0d836"><span class="section-number-3">7.5</span> newline (only Unix wanted)</h3>
<div class="outline-text-3" id="text-7-5">
<p>
This should automatically convert any files with dos or Mac line
endings into Unix style ones. Code found <a href="https://www.emacswiki.org/emacs/EndOfLineTips">here</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">no-junk-please-we-are-unixish</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">let</span> <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>coding-str <span style="color: #aebed8;">(</span>symbol-name buffer-file-coding-system<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">when</span> <span style="color: #97b098;">(</span>string-match <span style="color: #EEDC82;">"-</span><span style="color: #A63A62;">\\</span><span style="color: #A63A62;">(?:</span><span style="color: #EEDC82;">dos</span><span style="color: #A63A62;">\\</span><span style="color: #A63A62;">|</span><span style="color: #EEDC82;">mac</span><span style="color: #A63A62;">\\</span><span style="color: #A63A62;">)</span><span style="color: #EEDC82;">$"</span> coding-str<span style="color: #97b098;">)</span>
      <span style="color: #97b098;">(</span>set-buffer-file-coding-system 'unix<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span>add-hook 'find-file-hook 'no-junk-please-we-are-unixish<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org31b198b" class="outline-3">
<h3 id="org31b198b"><span class="section-number-3">7.6</span> auto revert</h3>
<div class="outline-text-3" id="text-7-6">
<p>
Use <code>auto-revert</code>, which reloads a file if it's updated on disk and not
modified in the buffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>global-auto-revert-mode 1<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>put 'upcase-region 'disabled nil<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>put 'narrow-to-region 'disabled nil<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6395748" class="outline-3">
<h3 id="org6395748"><span class="section-number-3">7.7</span> yes-or-no</h3>
<div class="outline-text-3" id="text-7-7">
<p>
Change all prompts to y or n:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>fset 'yes-or-no-p 'y-or-n-p<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9242036" class="outline-3">
<h3 id="org9242036"><span class="section-number-3">7.8</span> hide menu bar &amp; toolbar</h3>
<div class="outline-text-3" id="text-7-8">
<p>
Using i3 is forcing me to use keyboard.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>menu-bar-mode -1<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>toggle-scroll-bar -1<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>tool-bar-mode -1<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>blink-cursor-mode -1<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2963f91" class="outline-3">
<h3 id="org2963f91"><span class="section-number-3">7.9</span> alternate key mappings</h3>
<div class="outline-text-3" id="text-7-9">
<p>
Letting one enter chars that are otherwise difficult in e.g. the
minibuffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #93a8c6;">(</span>kbd <span style="color: #EEDC82;">"C-m"</span><span style="color: #93a8c6;">)</span> 'newline-and-indent<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #93a8c6;">(</span>kbd <span style="color: #EEDC82;">"C-j"</span><span style="color: #93a8c6;">)</span> 'newline<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #93a8c6;">[</span>delete<span style="color: #93a8c6;">]</span> 'delete-char<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #93a8c6;">[</span>kp-delete<span style="color: #93a8c6;">]</span> 'delete-char<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org494e7f4" class="outline-3">
<h3 id="org494e7f4"><span class="section-number-3">7.10</span> macros (default: off)</h3>
<div class="outline-text-3" id="text-7-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #93a8c6;">[</span>f3<span style="color: #93a8c6;">]</span> 'start-kbd-macro<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #93a8c6;">[</span>f4<span style="color: #93a8c6;">]</span> 'end-kbd-macro<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #93a8c6;">[</span>f5<span style="color: #93a8c6;">]</span> 'call-last-kbd-macro<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
