content/downloads/emacs/emacs_setup.org
** linum

For now, I'm doing it globally.

#+BEGIN_SRC emacs-lisp :tangle no
(global-display-line-numbers-mode t)
#+END_SRC


Yes I like having line numbers, but turnning it on globally makes some
buffers look strange. So let's limit it to the ones that I think
brings value. *Note* that the ones I skip are:

1. mu4e-compose-mode: when writing email, it's better not to count for line num.
2. markdown: for the same reason. I'm writing.

#+BEGIN_SRC emacs-lisp
  (add-hook 'c-mode-common-hook 'display-line-numbers-mode)
  ;; (add-hook 'org-mode-hook 'display-line-numbers-mode)
  (add-hook 'python-mode-hook 'display-line-numbers-mode)
  (add-hook 'web-mode-hook 'display-line-numbers-mode)
  (add-hook 'js2-mode-hook 'display-line-numbers-mode)
  (add-hook 'yaml-mode-hook 'display-line-numbers-mode)
  (add-hook 'json-mode-hook 'display-line-numbers-mode)
  (add-hook 'java-mode-hook 'display-line-numbers-mode)
  (add-hook 'groovy-mode-hook 'display-line-numbers-mode)
#+END_SRC

Format the line no and add a solid line as separation:

#+BEGIN_SRC emacs-lisp
(setq display-line-numbers-width nil)
(setq linum-format "%4d ")
#+END_SRC

** disable electric-indent

This is very annoying that it keeps indenting.

#+BEGIN_SRC emacs-lisp
(electric-indent-mode -1)
(add-hook 'after-change-major-mode-hook (lambda() (electric-indent-mode -1)))
#+END_SRC

** set clipboard to utf-8

This makes copy & paste from terminal to emacs buffer
work. Otherwise, some utf-8 symbols will be scrambled.

#+BEGIN_SRC emacs-lisp
(set-clipboard-coding-system 'utf-8)
#+END_SRC

* Font, theme

The whole point of using emacs is that I like the user experience, and
a big part of it is the color and look. There are too many ways to
tweak it. So I'll try not to run wild on this one. Most are inherited
from the original post, and I added some while playing with this
setting. Enjoy ~~

** by packages

*** sublime themes (default: spolsky)

Loading a theme I like.

#+BEGIN_SRC emacs-lisp
  (use-package sublime-themes
    :ensure t
    :config)
  (load-theme 'spolsky t)
#+END_SRC

*** mode lines
**** doom-modeline

#+BEGIN_SRC emacs-lisp
(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1))
#+END_SRC

**** remove some modelines

#+BEGIN_SRC emacs-lisp
  (use-package eldoc
    :delight)
#+END_SRC

**** nyan-mode

#+BEGIN_SRC emacs-lisp
(use-package nyan-mode
  :ensure t
  :bind ("C-M-x n" . 'nyan-mode))
#+END_SRC

*** delight

Package to remove some info from the mode-line for minor-modes.

#+BEGIN_SRC emacs-lisp
  (use-package delight
    :ensure t)

 (delight '((abbrev-mode " Abv" abbrev)
            (smart-tab-mode " \\t" smart-tab)
            (eldoc-mode nil "eldoc")
            (rainbow-mode)
            (overwrite-mode " Ov" t)
            (emacs-lisp-mode "Elisp" :major)))
#+END_SRC

*** multiple-cursors

Configure the shortcuts for multiple cursors.

#+BEGIN_SRC emacs-lisp
(use-package multiple-cursors
  :ensure t
  :bind (("C-S-c C-S-c" . 'mc/edit-lines)
         ("C->" . 'mc/mark-next-like-this)
         ("C-<" . 'mc/mark-previous-like-this)
         ("C-c C->" . 'mc/mark-all-like-this)))
#+END_SRC

*** dimmer

This will dim the buffer that is not the current. Sort of a visual
cue. However, I found that it can be ugly depending the theme.

#+BEGIN_SRC emacs-lisp
  (use-package dimmer
    :ensure
    :config
    (dimmer-configure-which-key)
    (dimmer-configure-helm))
  (dimmer-mode t)
#+END_SRC

