content/downloads/emacs/emacs_setup.html

<div id="outline-container-orgb89a0a7" class="outline-3">
<h3 id="orgb89a0a7"><span class="section-number-3">7.11</span> linum</h3>
<div class="outline-text-3" id="text-7-11">
<p>
For now, I'm doing it globally.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>global-display-line-numbers-mode t<span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Yes I like having line numbers, but turnning it on globally makes some
buffers look strange. So let's limit it to the ones that I think
brings value. <b>Note</b> that the ones I skip are:
</p>

<ol class="org-ol">
<li>mu4e-compose-mode: when writing email, it's better not to count for line num.</li>
<li>markdown: for the same reason. I'm writing.</li>
</ol>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>add-hook 'c-mode-common-hook 'display-line-numbers-mode<span style="color: #8c8c8c;">)</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">(add-hook 'org-mode-hook 'display-line-numbers-mode)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'python-mode-hook 'display-line-numbers-mode<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'web-mode-hook 'display-line-numbers-mode<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'js2-mode-hook 'display-line-numbers-mode<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'yaml-mode-hook 'display-line-numbers-mode<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'json-mode-hook 'display-line-numbers-mode<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'java-mode-hook 'display-line-numbers-mode<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'groovy-mode-hook 'display-line-numbers-mode<span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
Format the line no and add a solid line as separation:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> display-line-numbers-width nil<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> linum-format <span style="color: #EEDC82;">"%4d "</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3bd3a34" class="outline-3">
<h3 id="org3bd3a34"><span class="section-number-3">7.12</span> disable electric-indent</h3>
<div class="outline-text-3" id="text-7-12">
<p>
This is very annoying that it keeps indenting.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>electric-indent-mode -1<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'after-change-major-mode-hook <span style="color: #93a8c6;">(</span><span style="color: #F92672;">lambda</span><span style="color: #b0b1a3;">()</span> <span style="color: #b0b1a3;">(</span>electric-indent-mode -1<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5a1b9e6" class="outline-3">
<h3 id="org5a1b9e6"><span class="section-number-3">7.13</span> set clipboard to utf-8</h3>
<div class="outline-text-3" id="text-7-13">
<p>
This makes copy &amp; paste from terminal to emacs buffer
work. Otherwise, some utf-8 symbols will be scrambled.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>set-clipboard-coding-system 'utf-8<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org33a0787" class="outline-2">
<h2 id="org33a0787"><span class="section-number-2">8</span> Font, theme</h2>
<div class="outline-text-2" id="text-8">
<p>
The whole point of using emacs is that I like the user experience, and
a big part of it is the color and look. There are too many ways to
tweak it. So I'll try not to run wild on this one. Most are inherited
from the original post, and I added some while playing with this
setting. Enjoy ~~
</p>
</div>

<div id="outline-container-org86da230" class="outline-3">
<h3 id="org86da230"><span class="section-number-3">8.1</span> by packages</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-org4189640" class="outline-4">
<h4 id="org4189640"><span class="section-number-4">8.1.1</span> sublime themes (default: spolsky)</h4>
<div class="outline-text-4" id="text-8-1-1">
<p>
Loading a theme I like.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">sublime-themes</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>load-theme 'spolsky t<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3eae96f" class="outline-4">
<h4 id="org3eae96f"><span class="section-number-4">8.1.2</span> mode lines</h4>
<div class="outline-text-4" id="text-8-1-2">
</div>
<ol class="org-ol">
<li><a id="orgabf40f6"></a>doom-modeline<br />
<div class="outline-text-5" id="text-8-1-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">doom-modeline</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:init</span> <span style="color: #93a8c6;">(</span>doom-modeline-mode 1<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org25332f5"></a>remove some modelines<br />
<div class="outline-text-5" id="text-8-1-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">eldoc</span>
  <span style="color: #FF80F4;">:delight</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgd2a2211"></a>nyan-mode<br />
<div class="outline-text-5" id="text-8-1-2-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">nyan-mode</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:bind</span> <span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"C-M-x n"</span> . 'nyan-mode<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org8ef3f3f" class="outline-4">
<h4 id="org8ef3f3f"><span class="section-number-4">8.1.3</span> delight</h4>
<div class="outline-text-4" id="text-8-1-3">
<p>
Package to remove some info from the mode-line for minor-modes.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"> <span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">delight</span>
   <span style="color: #FF80F4;">:ensure</span> t<span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span>delight '<span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span>abbrev-mode <span style="color: #EEDC82;">" Abv"</span> abbrev<span style="color: #b0b1a3;">)</span>
           <span style="color: #b0b1a3;">(</span>smart-tab-mode <span style="color: #EEDC82;">" \\t"</span> smart-tab<span style="color: #b0b1a3;">)</span>
           <span style="color: #b0b1a3;">(</span>eldoc-mode nil <span style="color: #EEDC82;">"eldoc"</span><span style="color: #b0b1a3;">)</span>
           <span style="color: #b0b1a3;">(</span>rainbow-mode<span style="color: #b0b1a3;">)</span>
           <span style="color: #b0b1a3;">(</span>overwrite-mode <span style="color: #EEDC82;">" Ov"</span> t<span style="color: #b0b1a3;">)</span>
           <span style="color: #b0b1a3;">(</span>emacs-lisp-mode <span style="color: #EEDC82;">"Elisp"</span> <span style="color: #FF80F4;">:major</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1083fc8" class="outline-4">
<h4 id="org1083fc8"><span class="section-number-4">8.1.4</span> multiple-cursors</h4>
<div class="outline-text-4" id="text-8-1-4">
<p>
Configure the shortcuts for multiple cursors.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">multiple-cursors</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:bind</span> <span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-S-c C-S-c"</span> . 'mc/edit-lines<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-&gt;"</span> . 'mc/mark-next-like-this<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-&lt;"</span> . 'mc/mark-previous-like-this<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-c C-&gt;"</span> . 'mc/mark-all-like-this<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org90aec76" class="outline-4">
<h4 id="org90aec76"><span class="section-number-4">8.1.5</span> dimmer</h4>
<div class="outline-text-4" id="text-8-1-5">
<p>
This will dim the buffer that is not the current. Sort of a visual
cue. However, I found that it can be ugly depending the theme.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">dimmer</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span>dimmer-configure-which-key<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>dimmer-configure-helm<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>dimmer-mode t<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
