content/downloads/emacs/emacs_setup.el

(add-hook 'c-mode-common-hook 'display-line-numbers-mode)
(add-hook 'org-mode-hook 'display-line-numbers-mode)
(add-hook 'python-mode-hook 'display-line-numbers-mode)
(add-hook 'web-mode-hook 'display-line-numbers-mode)
(add-hook 'js2-mode-hook 'display-line-numbers-mode)
(add-hook 'yaml-mode-hook 'display-line-numbers-mode)
(add-hook 'json-mode-hook 'display-line-numbers-mode)
(add-hook 'java-mode-hook 'display-line-numbers-mode)
(add-hook 'groovy-mode-hook 'display-line-numbers-mode)

(setq linum-format "%4d ")

(electric-indent-mode -1)
(add-hook 'after-change-major-mode-hook (lambda() (electric-indent-mode -1)))

(use-package sublime-themes
  :ensure t
  :config)
(load-theme 'spolsky t)

(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1))

(use-package eldoc
  :delight)

(use-package nyan-mode
  :ensure t
  :bind ("C-M-x n" . 'nyan-mode))

(use-package delight
   :ensure t)

(delight '((abbrev-mode " Abv" abbrev)
           (smart-tab-mode " \\t" smart-tab)
           (eldoc-mode nil "eldoc")
           (rainbow-mode)
           (overwrite-mode " Ov" t)
           (emacs-lisp-mode "Elisp" :major)))

(use-package multiple-cursors
  :ensure t
  :bind (("C-S-c C-S-c" . 'mc/edit-lines)
         ("C->" . 'mc/mark-next-like-this)
         ("C-<" . 'mc/mark-previous-like-this)
         ("C-c C->" . 'mc/mark-all-like-this)))

(use-package dimmer
  :ensure
  :config
  (dimmer-configure-which-key)
  (dimmer-configure-helm))
(dimmer-mode t)
