content/downloads/emacs/emacs_setup.org
*** highlight indent

#+BEGIN_SRC emacs-lisp
  (use-package highlight-indent-guides
  :ensure
  :config
  (setq highlight-indent-guides-method 'character))
  (add-hook 'prog-mode-hook 'highlight-indent-guides-mode)
#+END_SRC

** fontlock

This gets the font coloring switched on for all buffers.

I have encountered a strange case when a mal-formatted Java file
caused Emacs to crash. After many research, the remedy is to use
[[https://github.com/jhipster/prettier-java][prettier-java]] to reformat this file first, then emacs is happy.

#+BEGIN_SRC emacs-lisp
  (global-font-lock-mode t)
#+END_SRC

** faces
**** list all the fonts

To list all the fonts available to your emacs, put this snippet to scratch, and
run =C-x C-e=:

#+BEGIN_SRC emacs-list :tangle no
(dolist (font (x-list-fonts "*"))
  (insert (format "%s\n" font)))
#+END_SRC

**** highlight, region

This makes some of the faces a bit more contrasted.

#+BEGIN_SRC emacs-lisp
  ;; faces for general region highlighting zenburn is too low-key.
  (custom-set-faces
   '(highlight ((t (:background "forest green"))))
   '(region ((t (:background "forest green")))))
#+END_SRC

**** mono font

Set default mono font:

#+BEGIN_SRC emacs-lisp
(add-to-list 'default-frame-alist
             '(font . "Ubuntu Mono-15"))
#+END_SRC

Set default font to monospace:
#+BEGIN_SRC emacs-lisp
;; set a default font
(when (member "Ubuntu Mono-15" (font-family-list))
  (set-face-attribute 'default nil :font "Ubuntu Mono-15"))
#+END_SRC

**** custome theme font

Remember to install =apt install fonts-firacode=.

#+BEGIN_SRC emacs-lisp
  (custom-theme-set-faces
   'user
   '(fixed-pitch ((t (:family "Fira Code" :height 140))))
  )
#+END_SRC

** be quiet
Remove bell and dings.

#+BEGIN_SRC emacs-lisp
(setq ring-bell-function
      '(lambda ()
         (message "The answer is 42...")))
(setq echo-keystrokes 0.1 use-dialog-box nil visible-bell t)
#+END_SRC

** In terminal mode

#+BEGIN_SRC emacs-lisp
(when (display-graphic-p)
  (set-background-color "#ffffff")
  (set-foreground-color "#141312"))
#+END_SRC

** In X11 mode: mouse and window title

#+BEGIN_SRC emacs-lisp
(setq frame-title-format "emacs @ %b - %f")
(when window-system
  (mouse-wheel-mode)  ;; enable wheelmouse support by default
  (set-selection-coding-system 'compound-text-with-extensions))
#+END_SRC

