content/downloads/emacs/emacs_setup.html

<div id="outline-container-orgf2edc60" class="outline-4">
<h4 id="orgf2edc60"><span class="section-number-4">8.1.6</span> highlight indent</h4>
<div class="outline-text-4" id="text-8-1-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">highlight-indent-guides</span>
<span style="color: #FF80F4;">:ensure</span>
<span style="color: #FF80F4;">:config</span>
<span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> highlight-indent-guides-method 'character<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'prog-mode-hook 'highlight-indent-guides-mode<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb39f714" class="outline-3">
<h3 id="orgb39f714"><span class="section-number-3">8.2</span> fontlock</h3>
<div class="outline-text-3" id="text-8-2">
<p>
This gets the font coloring switched on for all buffers.
</p>

<p>
I have encountered a strange case when a mal-formatted Java file
caused Emacs to crash. After many research, the remedy is to use
<a href="https://github.com/jhipster/prettier-java">prettier-java</a> to reformat this file first, then emacs is happy.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>global-font-lock-mode t<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org36c892b" class="outline-3">
<h3 id="org36c892b"><span class="section-number-3">8.3</span> faces</h3>
<div class="outline-text-3" id="text-8-3">
</div>
<ol class="org-ol">
<li><a id="orge4af994"></a>list all the fonts<br />
<div class="outline-text-5" id="text-8-3-0-1">
<p>
To list all the fonts available to your emacs, put this snippet to scratch, and
run <code>C-x C-e</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-list">(dolist (font (x-list-fonts "*"))
  (insert (format "%s\n" font)))
</pre>
</div>
</div>
</li>

<li><a id="orgf777de2"></a>highlight, region<br />
<div class="outline-text-5" id="text-8-3-0-2">
<p>
This makes some of the faces a bit more contrasted.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">faces for general region highlighting zenburn is too low-key.</span>
<span style="color: #8c8c8c;">(</span>custom-set-faces
 '<span style="color: #93a8c6;">(</span>highlight <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:background</span> <span style="color: #EEDC82;">"forest green"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>region <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:background</span> <span style="color: #EEDC82;">"forest green"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org8e3390d"></a>mono font<br />
<div class="outline-text-5" id="text-8-3-0-3">
<p>
Set default mono font:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>add-to-list 'default-frame-alist
             '<span style="color: #93a8c6;">(</span>font . <span style="color: #EEDC82;">"Ubuntu Mono-15"</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
Set default font to monospace:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">set a default font</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">when</span> <span style="color: #93a8c6;">(</span>member <span style="color: #EEDC82;">"Ubuntu Mono-15"</span> <span style="color: #b0b1a3;">(</span>font-family-list<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>set-face-attribute 'default nil <span style="color: #FF80F4;">:font</span> <span style="color: #EEDC82;">"Ubuntu Mono-15"</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgbbad397"></a>custome theme font<br />
<div class="outline-text-5" id="text-8-3-0-4">
<p>
Remember to install <code>apt install fonts-firacode</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>custom-theme-set-faces
 'user
 '<span style="color: #93a8c6;">(</span>fixed-pitch <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:family</span> <span style="color: #EEDC82;">"Fira Code"</span> <span style="color: #FF80F4;">:height</span> 140<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org479c9d5" class="outline-3">
<h3 id="org479c9d5"><span class="section-number-3">8.4</span> be quiet</h3>
<div class="outline-text-3" id="text-8-4">
<p>
Remove bell and dings.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> ring-bell-function
      '<span style="color: #93a8c6;">(</span>lambda <span style="color: #b0b1a3;">()</span>
         <span style="color: #b0b1a3;">(</span>message <span style="color: #EEDC82;">"The answer is 42..."</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> echo-keystrokes 0.1 use-dialog-box nil visible-bell t<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf25623e" class="outline-3">
<h3 id="orgf25623e"><span class="section-number-3">8.5</span> In terminal mode</h3>
<div class="outline-text-3" id="text-8-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">when</span> <span style="color: #93a8c6;">(</span>display-graphic-p<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>set-background-color <span style="color: #EEDC82;">"#ffffff"</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>set-foreground-color <span style="color: #EEDC82;">"#141312"</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org42be3fe" class="outline-3">
<h3 id="org42be3fe"><span class="section-number-3">8.6</span> In X11 mode: mouse and window title</h3>
<div class="outline-text-3" id="text-8-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> frame-title-format <span style="color: #EEDC82;">"emacs @ %b - %f"</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">when</span> window-system
  <span style="color: #93a8c6;">(</span>mouse-wheel-mode<span style="color: #93a8c6;">)</span>  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">enable wheelmouse support by default</span>
  <span style="color: #93a8c6;">(</span>set-selection-coding-system 'compound-text-with-extensions<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
