content/downloads/emacs/emacs_setup.el

(use-package highlight-indent-guides
:ensure
:config
(setq highlight-indent-guides-method 'character))
(add-hook 'prog-mode-hook 'highlight-indent-guides-mode)

(global-font-lock-mode t)

;; faces for general region highlighting zenburn is too low-key.
(custom-set-faces
 '(highlight ((t (:background "forest green"))))
 '(region ((t (:background "forest green")))))

(add-to-list 'default-frame-alist
             '(font . "Ubuntu Mono-14"))

;; set a default font
(when (member "Ubuntu Mono-14" (font-family-list))
  (set-face-attribute 'default nil :font "Ubuntu Mono-14"))

(custom-theme-set-faces
 'user
 '(fixed-pitch ((t (:family "Fira Code" :height 140))))
)

(setq ring-bell-function
      '(lambda ()
         (message "The answer is 42...")))
(setq echo-keystrokes 0.1 use-dialog-box nil visible-bell t)

(when (display-graphic-p)
  (set-background-color "#ffffff")
  (set-foreground-color "#141312"))

(setq frame-title-format "emacs @ %b - %f")
(when window-system
  (mouse-wheel-mode)  ;; enable wheelmouse support by default
  (set-selection-coding-system 'compound-text-with-extensions))
