content/downloads/emacs/emacs_setup.html

<div id="outline-container-org4b053c9" class="outline-3">
<h3 id="org4b053c9"><span class="section-number-3">8.7</span> dynamic cursor colors</h3>
<div class="outline-text-3" id="text-8-7">
<p>
The cursor is displayed in different colors, depending on overwrite or
insert mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> hcz-set-cursor-color-color <span style="color: #EEDC82;">""</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> hcz-set-cursor-color-buffer <span style="color: #EEDC82;">""</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">hcz-set-cursor-color-according-to-mode</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #EEDC82;">"change cursor color according to some minor modes."</span>
  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">set-cursor-color is somewhat costly, so we only call it when needed:</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">let</span> <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>color
         <span style="color: #aebed8;">(</span><span style="color: #F92672;">if</span> buffer-read-only <span style="color: #EEDC82;">"orange"</span>
           <span style="color: #b0b0b3;">(</span><span style="color: #F92672;">if</span> overwrite-mode <span style="color: #EEDC82;">"red"</span>
             <span style="color: #EEDC82;">"green"</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">unless</span> <span style="color: #97b098;">(</span><span style="color: #F92672;">and</span>
             <span style="color: #aebed8;">(</span>string= color hcz-set-cursor-color-color<span style="color: #aebed8;">)</span>
             <span style="color: #aebed8;">(</span>string= <span style="color: #b0b0b3;">(</span>buffer-name<span style="color: #b0b0b3;">)</span> hcz-set-cursor-color-buffer<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
      <span style="color: #97b098;">(</span>set-cursor-color <span style="color: #aebed8;">(</span><span style="color: #F92672;">setq</span> hcz-set-cursor-color-color color<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
      <span style="color: #97b098;">(</span><span style="color: #F92672;">setq</span> hcz-set-cursor-color-buffer <span style="color: #aebed8;">(</span>buffer-name<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span>add-hook 'post-command-hook 'hcz-set-cursor-color-according-to-mode<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
</div>
