content/downloads/emacs/emacs_setup.org
* Coding

Big part of my life is taken by coding. So here it is, all the coding
related stuff.
** set authinfo as source

#+BEGIN_SRC emacs-lisp
(setq auth-sources '("~/.authinfo"))
#+END_SRC

** taskjuggler-mode (tj3-mode)
#+BEGIN_SRC emacs-lisp
  (use-package tj3-mode
    :ensure t
    :after org-plus-contrib
    :config
    (require 'ox-taskjuggler)
    (custom-set-variables
     '(org-taskjuggler-process-command "/usr/local/bin/tj3 --silent --no-color --output-dir %o %f")
     '(org-taskjuggler-project-tag "PRJ")))
#+END_SRC

** Version control
*** magit

Add the powerful Magit

#+BEGIN_SRC emacs-lisp
  (use-package magit
    :ensure t
    :defer
    :config
    (add-hook 'after-save-hook 'magit-after-save-refresh-status t)
    :custom ((magit-diff-refine-hunk 'all)
             (magit-process-finish-apply-ansi-colors t))
    :bind ("C-x g" . 'magit-status))
  (use-package magit-todos
    :ensure t
    :defer)
  (use-package
    magit-gitflow

    :ensure
    :config (add-hook 'magit-mode-hook 'turn-on-magit-gitflow))
#+END_SRC

Add local workspace to manage multiple repositories:

#+BEGIN_SRC emacs-lisp
(setq magit-repository-directories
      `(("~/workspace/dhhs" . 2)))
(setq magit-repolist-columns
      '(("Name"    30 magit-repolist-column-ident ())
        ("Local On" 35 magit-repolist-column-branch ())
        ("B" 4 magit-repolist-column-branches ())
        ("L<U" 3 magit-repolist-column-unpulled-from-upstream
         ((:right-align t)
          (:help-echo "Upstream changes not in branch")))
        ("L>U" 3 magit-repolist-column-unpushed-to-upstream
         ((:right-align t)
          (:help-echo "Local changes not in upstream")))
       ))
#+END_SRC

Turn on ANSI-COLOR:

#+BEGIN_SRC emacs-lisp
(defun color-buffer (proc &rest args)
  (interactive)
  (with-current-buffer (process-buffer proc)
    (read-only-mode -1)
    (ansi-color-apply-on-region (point-min) (point-max))
    (read-only-mode 1)))

(advice-add 'magit-process-filter :after 'color-buffer)
#+END_SRC


Based on [[https://emacs.stackexchange.com/questions/19176/manage-several-git-repositories-from-magit][SO]]:
#+begin_src emacs-lisp
(magit-add-section-hook 'magit-status-sections-hook
                        'magit-insert-modules
                        'magit-insert-unpulled-from-pushremote)
#+end_src
*** monky
Add the Magit-copy for Mercurial 'monky'

#+BEGIN_SRC emacs-lisp
  (use-package monky
    :ensure t
    :defer
    :bind ("C-x m" . 'monky-status))
#+END_SRC

*** git informations in gutter
#+BEGIN_SRC emacs-lisp
(use-package git-gutter-fringe+
  :ensure t
  :defer
  :if window-system
  :bind ("C-c g" . 'git-gutter+-mode))
#+END_SRC

*** speedup VCS
Regexp matching directory names that are not under VC's control. The
default regexp prevents fruitless and time-consuming attempts to
determine the VC status in directories in which filenames are
interpreted as hostnames.

#+BEGIN_SRC emacs-lisp
(defvar locate-dominating-stop-dir-regexp
  "\\`\\(?:[\\/][\\/][^\\/]+\\|/\\(?:net\\|afs\\|\\.\\.\\.\\)/\\)\\'")
#+END_SRC

