content/downloads/emacs/emacs_setup.html

<div id="outline-container-orgf025bb4" class="outline-2">
<h2 id="orgf025bb4"><span class="section-number-2">9</span> Coding</h2>
<div class="outline-text-2" id="text-9">
<p>
Big part of my life is taken by coding. So here it is, all the coding
related stuff.
</p>
</div>
<div id="outline-container-org4d2a040" class="outline-3">
<h3 id="org4d2a040"><span class="section-number-3">9.1</span> set authinfo as source</h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> auth-sources '<span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"~/.authinfo"</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd61d9c9" class="outline-3">
<h3 id="orgd61d9c9"><span class="section-number-3">9.2</span> taskjuggler-mode (tj3-mode)</h3>
<div class="outline-text-3" id="text-9-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">tj3-mode</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:after</span> org-plus-contrib
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">require</span> '<span style="color: #FF80F4;">ox-taskjuggler</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>custom-set-variables
   '<span style="color: #b0b1a3;">(</span>org-taskjuggler-process-command <span style="color: #EEDC82;">"/usr/local/bin/tj3 --silent --no-color --output-dir %o %f"</span><span style="color: #b0b1a3;">)</span>
   '<span style="color: #b0b1a3;">(</span>org-taskjuggler-project-tag <span style="color: #EEDC82;">"PRJ"</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1d3ba9b" class="outline-3">
<h3 id="org1d3ba9b"><span class="section-number-3">9.3</span> Version control</h3>
<div class="outline-text-3" id="text-9-3">
</div>
<div id="outline-container-org5d6fb83" class="outline-4">
<h4 id="org5d6fb83"><span class="section-number-4">9.3.1</span> magit</h4>
<div class="outline-text-4" id="text-9-3-1">
<p>
Add the powerful Magit
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">magit</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:defer</span>
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span>add-hook 'after-save-hook 'magit-after-save-refresh-status t<span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:custom</span> <span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span>magit-diff-refine-hunk 'all<span style="color: #b0b1a3;">)</span>
           <span style="color: #b0b1a3;">(</span>magit-process-finish-apply-ansi-colors t<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:bind</span> <span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"C-x g"</span> . 'magit-status<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">magit-todos</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:defer</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span>
  magit-gitflow

  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span> <span style="color: #93a8c6;">(</span>add-hook 'magit-mode-hook 'turn-on-magit-gitflow<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
Add local workspace to manage multiple repositories:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> magit-repository-directories
      `<span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"~/workspace/mycompany"</span> . 2<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> magit-repolist-columns
      '<span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"Name"</span>    30 magit-repolist-column-ident <span style="color: #97b098;">()</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"Local On"</span> 35 magit-repolist-column-branch <span style="color: #97b098;">()</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"Bch"</span> 3 magit-repolist-column-branches <span style="color: #97b098;">()</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"B&lt;U"</span>      3 magit-repolist-column-unpulled-from-upstream
         <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:right-align</span> t<span style="color: #aebed8;">)</span>
          <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:help-echo</span> <span style="color: #EEDC82;">"Upstream changes not in branch"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"B&gt;U"</span>      3 magit-repolist-column-unpushed-to-upstream
         <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:right-align</span> t<span style="color: #aebed8;">)</span>
          <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:help-echo</span> <span style="color: #EEDC82;">"Local changes not in upstream"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
       <span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
Turn on ANSI-COLOR:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">color-buffer</span> <span style="color: #93a8c6;">(</span>proc <span style="color: #66D9EF;">&amp;rest</span> args<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">interactive</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">with-current-buffer</span> <span style="color: #b0b1a3;">(</span>process-buffer proc<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span>read-only-mode -1<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span>ansi-color-apply-on-region <span style="color: #97b098;">(</span>point-min<span style="color: #97b098;">)</span> <span style="color: #97b098;">(</span>point-max<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span>read-only-mode 1<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span>advice-add 'magit-process-filter <span style="color: #FF80F4;">:after</span> 'color-buffer<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1b2724f" class="outline-4">
<h4 id="org1b2724f"><span class="section-number-4">9.3.2</span> monky</h4>
<div class="outline-text-4" id="text-9-3-2">
<p>
Add the Magit-copy for Mercurial 'monky'
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">monky</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:defer</span>
  <span style="color: #FF80F4;">:bind</span> <span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"C-x m"</span> . 'monky-status<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf0b2df6" class="outline-4">
<h4 id="orgf0b2df6"><span class="section-number-4">9.3.3</span> git informations in gutter</h4>
<div class="outline-text-4" id="text-9-3-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">git-gutter-fringe+</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:defer</span>
  <span style="color: #FF80F4;">:if</span> window-system
  <span style="color: #FF80F4;">:bind</span> <span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"C-c g"</span> . 'git-gutter+-mode<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5c92c1c" class="outline-4">
<h4 id="org5c92c1c"><span class="section-number-4">9.3.4</span> speedup VCS</h4>
<div class="outline-text-4" id="text-9-3-4">
<p>
Regexp matching directory names that are not under VC's control. The
default regexp prevents fruitless and time-consuming attempts to
determine the VC status in directories in which filenames are
interpreted as hostnames.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">locate-dominating-stop-dir-regexp</span>
  <span style="color: #EEDC82;">"\\`</span><span style="color: #A63A62;">\\</span><span style="color: #A63A62;">(?:</span><span style="color: #EEDC82;">[\\/][\\/][</span><span style="color: #FF6C60;">^</span><span style="color: #EEDC82;">\\/]+</span><span style="color: #A63A62;">\\</span><span style="color: #A63A62;">|</span><span style="color: #EEDC82;">/</span><span style="color: #A63A62;">\\</span><span style="color: #A63A62;">(?:</span><span style="color: #EEDC82;">net</span><span style="color: #A63A62;">\\</span><span style="color: #A63A62;">|</span><span style="color: #EEDC82;">afs</span><span style="color: #A63A62;">\\</span><span style="color: #A63A62;">|</span><span style="color: #EEDC82;">\\.\\.\\.</span><span style="color: #A63A62;">\\</span><span style="color: #A63A62;">)</span><span style="color: #EEDC82;">/</span><span style="color: #A63A62;">\\</span><span style="color: #A63A62;">)</span><span style="color: #EEDC82;">\\'"</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
