content/downloads/emacs/emacs_setup.el

(setq auth-sources '("~/.authinfo"))

(use-package tj3-mode
  :ensure t
  :after org-plus-contrib
  :config
  (require 'ox-taskjuggler)
  (custom-set-variables
   '(org-taskjuggler-process-command "/usr/local/bin/tj3 --silent --no-color --output-dir %o %f")
   '(org-taskjuggler-project-tag "PRJ")))

(use-package magit
  :ensure t
  :defer
  :config
  (add-hook 'after-save-hook 'magit-after-save-refresh-status t)
  :bind ("C-x g" . 'magit-status))
(use-package magit-todos
  :ensure t
  :defer)
(use-package
  magit-gitflow

  :ensure
  :config (add-hook 'magit-mode-hook 'turn-on-magit-gitflow))

(setq magit-repository-directories
      `(("~/workspace/mycompany" . 2)))
(setq magit-repolist-columns
      '(("Name"    30 magit-repolist-column-ident ())
        ("Local On" 35 magit-repolist-column-branch ())
        ("Bch" 3 magit-repolist-column-branches ())
        ("B<U"      3 magit-repolist-column-unpulled-from-upstream
         ((:right-align t)
          (:help-echo "Upstream changes not in branch")))
        ("B>U"      3 magit-repolist-column-unpushed-to-upstream
         ((:right-align t)
          (:help-echo "Local changes not in upstream")))
       ))

(use-package monky
  :ensure t
  :defer
  :bind ("C-x m" . 'monky-status))

(use-package git-gutter-fringe+
  :ensure t
  :defer
  :if window-system
  :bind ("C-c g" . 'git-gutter+-mode))

(defvar locate-dominating-stop-dir-regexp
  "\\`\\(?:[\\/][\\/][^\\/]+\\|/\\(?:net\\|afs\\|\\.\\.\\.\\)/\\)\\'")
