content/downloads/emacs/emacs_setup.org
*** global caller

Have a single binding to call the most appropriate tool given the repository.

#+BEGIN_SRC emacs-lisp
  (defun paf/vcs-status ()
       (interactive)
       (condition-case nil
           (magit-status-setup-buffer)
         (error (monky-status))))

  (global-set-key (kbd "C-M-x v") 'paf/vcs-status)
#+END_SRC


#+RESULTS:
: paf/vcs-status
*** forge

#+BEGIN_SRC emacs-lisp
(use-package forge
  :after magit)
#+END_SRC

*** code review

This is really cool. It has fancier UI than the =github-review= tool.
Give it a shot!

#+BEGIN_SRC emacs-lisp :tangle no
(use-package code-review
  :ensure t)
(add-hook 'code-review-mode-hook #'emojify-mode)
(setq code-review-fill-column 80)
#+END_SRC

*** github review

I have been using [[https://github.com/charignon/github-review][this]] for a while daily, and it's wonderful!

#+BEGIN_SRC emacs-lisp
(use-package github-review
  :ensure t
  :config
  (setq github-review-reply-inline-comments t)
)
#+END_SRC

** Projectile

Start using projectile. It has the documentation [[https://docs.projectile.mx/en/latest/][here]].

#+BEGIN_SRC emacs-lisp
  (use-package projectile
    :ensure t
    :config
    (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
    (setq projectile-completion-system 'helm)
    (projectile-mode +1))

  (use-package helm-projectile
    :ensure t
    :after projectile
    :requires projectile
    :delight projectile-mode
    :config
    (helm-projectile-on))
#+END_SRC


Search the entire project with =C-c p s s= for a regexp. This let's
you turn the matching results into an editable buffer using =C-c
C-e=. Other keys are listed [[https://github.com/syohex/emacs-helm-ag#keymap][here]].

#+BEGIN_SRC emacs-lisp
  (use-package helm-ag
    :ensure t
    :config)
#+END_SRC


I havae used it by a =M-?= binding. It's just old habit:
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-?") 'helm-ag)
#+END_SRC

** debug w/ GDB
