content/downloads/emacs/emacs_setup.html

<div id="outline-container-orgebcff37" class="outline-4">
<h4 id="orgebcff37"><span class="section-number-4">9.3.5</span> global caller</h4>
<div class="outline-text-4" id="text-9-3-5">
<p>
Have a single binding to call the most appropriate tool given the repository.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">paf/vcs-status</span> <span style="color: #93a8c6;">()</span>
     <span style="color: #93a8c6;">(</span><span style="color: #F92672;">interactive</span><span style="color: #93a8c6;">)</span>
     <span style="color: #93a8c6;">(</span><span style="color: #F92672;">condition-case</span> nil
         <span style="color: #b0b1a3;">(</span>magit-status-setup-buffer<span style="color: #b0b1a3;">)</span>
       <span style="color: #b0b1a3;">(</span><span style="color: #FF6C60;">error</span> <span style="color: #97b098;">(</span>monky-status<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #93a8c6;">(</span>kbd <span style="color: #EEDC82;">"C-M-x v"</span><span style="color: #93a8c6;">)</span> 'paf/vcs-status<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb326beb" class="outline-4">
<h4 id="orgb326beb"><span class="section-number-4">9.3.6</span> forge</h4>
<div class="outline-text-4" id="text-9-3-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">forge</span>
  <span style="color: #FF80F4;">:after</span> magit<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9fe0007" class="outline-4">
<h4 id="org9fe0007"><span class="section-number-4">9.3.7</span> code review</h4>
<div class="outline-text-4" id="text-9-3-7">
<p>
This is really cool. It has fancier UI than the <code>github-review</code> tool.
Give it a shot!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">code-review</span>
  <span style="color: #FF80F4;">:ensure</span> t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'code-review-mode-hook #'emojify-mode<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> code-review-fill-column 80<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org02e15f7" class="outline-4">
<h4 id="org02e15f7"><span class="section-number-4">9.3.8</span> github review</h4>
<div class="outline-text-4" id="text-9-3-8">
<p>
I have been using <a href="https://github.com/charignon/github-review">this</a> for a while daily, and it's wonderful!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">github-review</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> github-review-reply-inline-comments t<span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge00fc98" class="outline-3">
<h3 id="orge00fc98"><span class="section-number-3">9.4</span> Projectile</h3>
<div class="outline-text-3" id="text-9-4">
<p>
Start using projectile. It has the documentation <a href="https://docs.projectile.mx/en/latest/">here</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">projectile</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span>define-key projectile-mode-map <span style="color: #b0b1a3;">(</span>kbd <span style="color: #EEDC82;">"C-c p"</span><span style="color: #b0b1a3;">)</span> 'projectile-command-map<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> projectile-completion-system 'helm<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>projectile-mode +1<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">helm-projectile</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:after</span> projectile
  <span style="color: #FF80F4;">:requires</span> projectile
  <span style="color: #FF80F4;">:delight</span> projectile-mode
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span>helm-projectile-on<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Search the entire project with <code>C-c p s s</code> for a regexp. This let's
you turn the matching results into an editable buffer using <code>C-c
C-e</code>. Other keys are listed <a href="https://github.com/syohex/emacs-helm-ag#keymap">here</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">helm-ag</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
I havae used it by a <code>M-?</code> binding. It's just old habit:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #93a8c6;">(</span>kbd <span style="color: #EEDC82;">"M-?"</span><span style="color: #93a8c6;">)</span> 'helm-ag<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
