content/downloads/emacs/emacs_setup.el

(defun paf/vcs-status ()
     (interactive)
     (condition-case nil
         (magit-status-setup-buffer)
       (error (monky-status))))

(global-set-key (kbd "C-M-x v") 'paf/vcs-status)

(use-package forge
  :after magit)

(use-package code-review
  :ensure t)

(use-package projectile
  :ensure t
  :config
  (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
  (setq projectile-completion-system 'helm)
  (projectile-mode +1))

(use-package helm-projectile
  :ensure t
  :after projectile
  :requires projectile
  :delight projectile-mode
  :config
  (helm-projectile-on))

(use-package helm-ag
  :ensure t
  :config)

(global-set-key (kbd "M-?") 'helm-ag)
