content/downloads/emacs/emacs_setup.html

<div id="outline-container-org62a71da" class="outline-3">
<h3 id="org62a71da"><span class="section-number-3">9.5</span> debug w/ GDB</h3>
<div class="outline-text-3" id="text-9-5">
</div>
<div id="outline-container-org0c21988" class="outline-4">
<h4 id="org0c21988"><span class="section-number-4">9.5.1</span> <span class="todo TODO">TODO</span> Make it so that the source frame placement is forced only when using gdb.</h4>
<div class="outline-text-4" id="text-9-5-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> gdb-many-windows t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> gdb-use-separate-io-buffer t<span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">easy-gdb-top-of-stack-and-restore-windows</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">interactive</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>switch-to-buffer <span style="color: #b0b1a3;">(</span>gdb-stack-buffer-name<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>goto-char <span style="color: #b0b1a3;">(</span>point-min<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>gdb-select-frame<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>gdb-restore-windows<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>other-window 2<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #93a8c6;">(</span>kbd <span style="color: #EEDC82;">"C-x C-a C-t"</span><span style="color: #93a8c6;">)</span> 'easy-gdb-top-of-stack-and-restore-windows<span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
This should display the source code always in the same window when debugging.
Found on <a href="https://stackoverflow.com/questions/39762833/emacsgdb-customization-how-to-display-source-buffer-in-one-window">Stack Overflow</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">This unfortunately also messes up the regular frame navigation of source code.</span>
<span style="color: #8C8C8C;">;</span><span style="color: #696969; font-style: italic;">(add-to-list 'display-buffer-alist</span>
<span style="color: #8C8C8C;">;             </span><span style="color: #696969; font-style: italic;">(cons 'cdb-source-code-buffer-p</span>
<span style="color: #8C8C8C;">;                   </span><span style="color: #696969; font-style: italic;">(cons 'display-source-code-buffer nil)))</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">cdb-source-code-buffer-p</span> <span style="color: #93a8c6;">(</span>bufName action<span style="color: #93a8c6;">)</span>
  <span style="color: #EEDC82;">"Return whether BUFNAME is a source code buffer."</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">let</span> <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>buf <span style="color: #aebed8;">(</span>get-buffer bufName<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">and</span> buf
         <span style="color: #97b098;">(</span><span style="color: #F92672;">with-current-buffer</span> buf
           <span style="color: #aebed8;">(</span>derived-mode-p buf 'c++-mode 'c-mode 'csharp-mode 'nxml-mode<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">display-source-code-buffer</span> <span style="color: #93a8c6;">(</span>sourceBuf alist<span style="color: #93a8c6;">)</span>
  <span style="color: #EEDC82;">"Find a window with source code and set sourceBuf inside it."</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">let*</span> <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>curbuf <span style="color: #aebed8;">(</span>current-buffer<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
         <span style="color: #97b098;">(</span>wincurbuf <span style="color: #aebed8;">(</span>get-buffer-window curbuf<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
         <span style="color: #97b098;">(</span>win <span style="color: #aebed8;">(</span><span style="color: #F92672;">if</span> <span style="color: #b0b0b3;">(</span><span style="color: #F92672;">and</span> wincurbuf
                       <span style="color: #90a890;">(</span>derived-mode-p sourceBuf 'c++-mode 'c-mode 'nxml-mode<span style="color: #90a890;">)</span>
                       <span style="color: #90a890;">(</span>derived-mode-p <span style="color: #a2b6da;">(</span>current-buffer<span style="color: #a2b6da;">)</span> 'c++-mode 'c-mode 'nxml-mode<span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span>
                  wincurbuf
                <span style="color: #b0b0b3;">(</span>get-window-with-predicate
                 <span style="color: #90a890;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #a2b6da;">(</span>window<span style="color: #a2b6da;">)</span>
                   <span style="color: #a2b6da;">(</span><span style="color: #F92672;">let</span> <span style="color: #9cb6ad;">(</span><span style="color: #8c8c8c;">(</span>bufName <span style="color: #93a8c6;">(</span>buffer-name <span style="color: #b0b1a3;">(</span>window-buffer window<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span><span style="color: #9cb6ad;">)</span>
                     <span style="color: #9cb6ad;">(</span><span style="color: #F92672;">or</span> <span style="color: #8c8c8c;">(</span>cdb-source-code-buffer-p bufName nil<span style="color: #8c8c8c;">)</span>
                         <span style="color: #8c8c8c;">(</span>assoc bufName display-buffer-alist<span style="color: #8c8c8c;">)</span>
                         <span style="color: #9cb6ad;">)</span><span style="color: #a2b6da;">)</span><span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span> <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">derived-mode-p doesn't work inside this, don't know why...</span>
    <span style="color: #b0b1a3;">(</span>set-window-buffer win sourceBuf<span style="color: #b0b1a3;">)</span>
    win<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Here is my cheatsheet for the keyboard commands:
</p>

<p>
All prefixed with <code>C-x C-a</code>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-center" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Domain</th>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-center">C-&lt;key&gt;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Breakpoint</td>
<td class="org-left">set</td>
<td class="org-center">b</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">temporary</td>
<td class="org-center">t</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">delete</td>
<td class="org-center">d</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Execute</td>
<td class="org-left">Next</td>
<td class="org-center">n</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Step Into</td>
<td class="org-center">s</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Return / Finish</td>
<td class="org-center">f</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Continue (run)</td>
<td class="org-center">r</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Stack</td>
<td class="org-left">Up</td>
<td class="org-center">&lt;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Down</td>
<td class="org-center">&gt;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Execute</td>
<td class="org-left">Until current line</td>
<td class="org-center">u</td>
</tr>

<tr>
<td class="org-left">(rarer)</td>
<td class="org-left">Single instruction</td>
<td class="org-center">i</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Jump to current line</td>
<td class="org-center">j</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
