content/downloads/emacs/emacs_setup.org
*** yasnippet

Let's first see how far I get with file-based capture templates and yankpad.
Install and config by [[https://www.reddit.com/r/emacs/comments/8vdhb4/tip_how_to_integrate_snippets_with_yasnippets/][reddit post]]:

#+BEGIN_SRC emacs-lisp

  (use-package yasnippet
    :defer 1
    :diminish yas-minor-mode
    :config (yas-global-mode))

  (use-package yasnippet-snippets
    :after yasnippet
    :config (yasnippet-snippets-initialize))

  ;; (yas-reload-all)
  (yas-global-mode 1)
#+END_SRC

Add a hydra:

#+begin_src emacs-lisp
  (use-package hydra
    :defer 2
    :bind ("C-c y" . hydra-yasnippet/body))

  (defhydra hydra-yasnippet (:color blue)
    "
    ^
    ^YASnippet^          ^Do^
    ^─────────^──────────^──^────────
    _q_ quit             _i_ insert
    ^^                   _m_ mode
    ^^                   _n_ new
    ^^                   ^^
    "
    ("q" nil)
    ("i" yas-insert-snippet)
    ("m" yas-minor-mode)
    ("n" yas-new-snippet))
#+end_src

*** diffing
[[https://github.com/justbur/emacs-vdiff][
vdiff]] let's one compare buffers or files.

#+BEGIN_SRC emacs-lisp
  (use-package vdiff
    :ensure t
    :config
    ; This binds commands under the prefix when vdiff is active.
    (define-key vdiff-mode-map (kbd "C-c") vdiff-mode-prefix-map))
#+END_SRC

*** commenting out
Easy commenting out of lines.

#+BEGIN_SRC emacs-lisp
  (autoload 'comment-out-region "comment" nil t)
  (global-set-key (kbd "C-c q") 'comment-out-region)
#+END_SRC

*** deduplicate and sort
Help cleanup the includes and using lists.
[[http://www.emacswiki.org/emacs/DuplicateLines][found here]]

#+BEGIN_SRC emacs-lisp
  (defun uniquify-region-lines (beg end)
    "Remove duplicate adjacent lines in region."
    (interactive "*r")
    (save-excursion
      (goto-char beg)
      (while (re-search-forward "^\\(.*\n\\)\\1+" end t)
        (replace-match "\\1"))))

  (defun paf/sort-and-uniquify-region ()
    "Remove duplicates and sort lines in region."
    (interactive)
    (sort-lines nil (region-beginning) (region-end))
    (uniquify-region-lines (region-beginning) (region-end)))
#+END_SRC


Simplify cleanup of =#include= / =typedef= / =using= blocks.

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-M-x s") 'paf/sort-and-uniquify-region)
#+END_SRC

*** selective display (default: off)
Will fold all text indented more than the position of the cursor at
the time the keys are pressed.

#+BEGIN_SRC emacs-lisp :tangle no
(defun set-selective-display-dlw (&optional level)
  "Fold text indented more than the cursor.
   If level is set, set the indent level to level.
   0 displays the entire buffer."
  (interactive "P")
  (set-selective-display (or level (current-column))))

(global-set-key "\C-x$" 'set-selective-display-dlw)
#+END_SRC

*** hightlight-indent-guide-mode

#+BEGIN_SRC emacs-lisp
(add-hook 'prog-mode-hook 'highlight-indent-guides-mode)
#+END_SRC

*** folding by indent level

This is very useful when browsing long yaml such as heml's values.

#+begin_src emacs-lisp
(use-package origami
  :bind ("C-c h o" . hydra-origami/body)
  :config

 (defhydra hydra-origami(:color red)
   "
  _o_pen node    _n_ext fold       toggle _f_orward  _s_how current only
  _c_lose node   _p_revious fold   toggle _a_ll
  "
   ("o" origami-open-node)
   ("c" origami-close-node)
   ("n" origami-next-fold)
   ("p" origami-previous-fold)
   ("f" origami-forward-toggle-node)
   ("a" origami-toggle-all-nodes)
   ("s" origami-show-only-node))
)

#+end_src

