content/downloads/emacs/emacs_setup.html
<div id="outline-container-org0f88ff7" class="outline-3">
<h3 id="org0f88ff7"><span class="section-number-3">9.6</span> editing</h3>
<div class="outline-text-3" id="text-9-6">
</div>
<div id="outline-container-orgba482b2" class="outline-4">
<h4 id="orgba482b2"><span class="section-number-4">9.6.1</span> diffing</h4>
<div class="outline-text-4" id="text-9-6-1">
<p>
<a href="https://github.com/justbur/emacs-vdiff">
vdiff</a> let's one compare buffers or files.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">vdiff</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">This binds commands under the prefix when vdiff is active.</span>
  <span style="color: #93a8c6;">(</span>define-key vdiff-mode-map <span style="color: #b0b1a3;">(</span>kbd <span style="color: #EEDC82;">"C-c"</span><span style="color: #b0b1a3;">)</span> vdiff-mode-prefix-map<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org067f400" class="outline-4">
<h4 id="org067f400"><span class="section-number-4">9.6.2</span> yasnippet</h4>
<div class="outline-text-4" id="text-9-6-2">
<p>
Let's first see how far I get with file-based capture templates and yankpad.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">yasnippet</span>
  <span style="color: #FF80F4;">:ensure</span> t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>yas-reload-all<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>yas-global-mode 1<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">yasnippet-snippets</span>
  <span style="color: #FF80F4;">:ensure</span> t<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1a55145" class="outline-4">
<h4 id="org1a55145"><span class="section-number-4">9.6.3</span> commenting out</h4>
<div class="outline-text-4" id="text-9-6-3">
<p>
Easy commenting out of lines.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>autoload 'comment-out-region <span style="color: #EEDC82;">"comment"</span> nil t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #93a8c6;">(</span>kbd <span style="color: #EEDC82;">"C-c q"</span><span style="color: #93a8c6;">)</span> 'comment-out-region<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org059092e" class="outline-4">
<h4 id="org059092e"><span class="section-number-4">9.6.4</span> deduplicate and sort</h4>
<div class="outline-text-4" id="text-9-6-4">
<p>
Help cleanup the includes and using lists.
<a href="http://www.emacswiki.org/emacs/DuplicateLines">found here</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">uniquify-region-lines</span> <span style="color: #93a8c6;">(</span>beg end<span style="color: #93a8c6;">)</span>
  <span style="color: #EEDC82;">"Remove duplicate adjacent lines in region."</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">interactive</span> <span style="color: #EEDC82;">"*r"</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">save-excursion</span>
    <span style="color: #b0b1a3;">(</span>goto-char beg<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">while</span> <span style="color: #97b098;">(</span>re-search-forward <span style="color: #EEDC82;">"^</span><span style="color: #A63A62;">\\</span><span style="color: #A63A62;">(</span><span style="color: #EEDC82;">.*\n</span><span style="color: #A63A62;">\\</span><span style="color: #A63A62;">)</span><span style="color: #EEDC82;">\\1+"</span> end t<span style="color: #97b098;">)</span>
      <span style="color: #97b098;">(</span>replace-match <span style="color: #EEDC82;">"\\1"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">paf/sort-and-uniquify-region</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #EEDC82;">"Remove duplicates and sort lines in region."</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">interactive</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>sort-lines nil <span style="color: #b0b1a3;">(</span>region-beginning<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">(</span>region-end<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>uniquify-region-lines <span style="color: #b0b1a3;">(</span>region-beginning<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">(</span>region-end<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Simplify cleanup of <code>#include</code> / <code>typedef</code> / <code>using</code> blocks.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #93a8c6;">(</span>kbd <span style="color: #EEDC82;">"C-M-x s"</span><span style="color: #93a8c6;">)</span> 'paf/sort-and-uniquify-region<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb449ec4" class="outline-4">
<h4 id="orgb449ec4"><span class="section-number-4">9.6.5</span> selective display (default: off)</h4>
<div class="outline-text-4" id="text-9-6-5">
<p>
Will fold all text indented more than the position of the cursor at
the time the keys are pressed.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">set-selective-display-dlw</span> <span style="color: #93a8c6;">(</span><span style="color: #66D9EF;">&amp;optional</span> level<span style="color: #93a8c6;">)</span>
  <span style="color: #EEDC82;">"Fold text indented more than the cursor.</span>
<span style="color: #EEDC82;">   If level is set, set the indent level to level.</span>
<span style="color: #EEDC82;">   0 displays the entire buffer."</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">interactive</span> <span style="color: #EEDC82;">"P"</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>set-selective-display <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">or</span> level <span style="color: #97b098;">(</span>current-column<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #EEDC82;">"\C-x$"</span> 'set-selective-display-dlw<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb559e77" class="outline-4">
<h4 id="orgb559e77"><span class="section-number-4">9.6.6</span> hightlight-indent-guide-mode</h4>
<div class="outline-text-4" id="text-9-6-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>add-hook 'prog-mode-hook 'highlight-indent-guides-mode<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org330c14a" class="outline-4">
<h4 id="org330c14a"><span class="section-number-4">9.6.7</span> folding by indent level</h4>
<div class="outline-text-4" id="text-9-6-7">
<p>
This is very useful when browsing long yaml such as heml's values.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">origami</span>
  <span style="color: #FF80F4;">:bind</span> <span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"C-c h o"</span> . hydra-origami/body<span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:config</span>

 <span style="color: #93a8c6;">(</span><span style="color: #F92672;">defhydra</span> hydra-origami<span style="color: #b0b1a3;">(</span><span style="color: #FF80F4;">:color</span> red<span style="color: #b0b1a3;">)</span>
   <span style="color: #EEDC82;">"</span>
<span style="color: #EEDC82;">  _o_pen node    _n_ext fold       toggle _f_orward  _s_how current only</span>
<span style="color: #EEDC82;">  _c_lose node   _p_revious fold   toggle _a_ll</span>
<span style="color: #EEDC82;">  "</span>
   <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"o"</span> origami-open-node<span style="color: #b0b1a3;">)</span>
   <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"c"</span> origami-close-node<span style="color: #b0b1a3;">)</span>
   <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"n"</span> origami-next-fold<span style="color: #b0b1a3;">)</span>
   <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"p"</span> origami-previous-fold<span style="color: #b0b1a3;">)</span>
   <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"f"</span> origami-forward-toggle-node<span style="color: #b0b1a3;">)</span>
   <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"a"</span> origami-toggle-all-nodes<span style="color: #b0b1a3;">)</span>
   <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"s"</span> origami-show-only-node<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">)</span>

</pre>
</div>
</div>
</div>
</div>
