content/downloads/emacs/emacs_setup.el

(use-package yasnippet
  :ensure t)
(yas-reload-all)
(yas-global-mode 1)
(use-package yasnippet-snippets
  :ensure t)

(autoload 'comment-out-region "comment" nil t)
(global-set-key (kbd "C-c q") 'comment-out-region)

(defun uniquify-region-lines (beg end)
  "Remove duplicate adjacent lines in region."
  (interactive "*r")
  (save-excursion
    (goto-char beg)
    (while (re-search-forward "^\\(.*\n\\)\\1+" end t)
      (replace-match "\\1"))))

(defun paf/sort-and-uniquify-region ()
  "Remove duplicates and sort lines in region."
  (interactive)
  (sort-lines nil (region-beginning) (region-end))
  (uniquify-region-lines (region-beginning) (region-end)))

(global-set-key (kbd "C-M-x s") 'paf/sort-and-uniquify-region)

(add-hook 'prog-mode-hook 'highlight-indent-guides-mode)

(use-package
  circe
    :ensure
    :config(
