content/downloads/emacs/emacs_setup.org
** IRC
Use =circe=.
#+BEGIN_SRC emacs-lisp
  (use-package
    circe
      :ensure
      :config(
      setq circe-network-options '((
      "Freenode" :tls t
      :nick "fengxia41103"
      :channels ("#emacs"
      "#python"
      "#odoo"
      "#reactjs"
      "#latex")))))
  (use-package
    helm-circe

    :ensure
    :config)
#+END_SRC

** restclient

#+BEGIN_SRC emacs-lisp
(use-package restclient
  :ensure)
#+END_SRC


Then wrap it w/ this, you can then embed restcall in org!

#+BEGIN_SRC emacs-lisp
(load-file "~/workspace/3rd/ob-restclient.el/ob-restclient.el")
(require 'ob-restclient)
(org-babel-do-load-languages
 'org-babel-load-languages
 '((restclient . t)))
#+END_SRC

** lsp

#+begin_src emacs-lisp
  (use-package lsp-mode
    :init
    ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
    (setq lsp-keymap-prefix "C-c l")
    :hook (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
           (XXX-mode . lsp)
           ;; if you want which-key integration
           (lsp-mode . lsp-enable-which-key-integration))
    :commands lsp)

  (use-package lsp-mode
    :ensure t
    :defer t
    :init
    (setq lsp-keymap-prefix "C-c l")
    :hook ((css-mode-hook . lsp-deferred)
           (html-mode-hook . lsp-deferred)
           (web-mode-hook . lsp-deferred)
           (js2-mode-hook . lsp-deferred)
           (c++-mode-hook . lsp-deferred)
           (c-mode-hook . lsp-deferred)
           (java-mode-hook . lsp-deferred)
           (lsp-mode-hook . lsp-enable-which-key-integration))
    :commands (lsp lsp-deferred)
    :bind (:map lsp-mode-map
                ("M-<RET>" . lsp-execute-code-action)))

  (use-package lsp-ui
    :ensure t
    :defer t
    :config
    (setq lsp-ui-sideline-enable nil)
    :hook (lsp-mode-hook . lsp-ui-mode)
    :bind (:map lsp-ui-mode-map
                ("C-c i" . lsp-ui-imenu)))

  ;; LSP integration with treemacs

  (use-package lsp-treemacs
    :ensure t
    :defer t
    :after lsp)

  ;; Debugger

  ;; (use-package dap-mode
  ;;   :ensure t
  ;;   :defer t
  ;;   :after lsp-mode
  ;;   :config
  ;;   (dap-auto-configure-mode)
  ;;   :bind (:map dap-mode-map
  ;;               ("C-c C-c" . dap-java-debug)
  ;;               ("C-c R" . dap-java-run-test-class)
  ;;               ("C-c d" . dap-java-debug-test-method)
  ;;               ("C-c r" . dap-java-run-test-method)))

  ;; Requires lsp-mode

  (use-package lsp-java
    :ensure t
    :defer t
    :after lsp
    :config
    (setq lsp-java-format-on-type-enabled nil)
    (defun my/java-mode-hook ()
      (setq c-basic-offset 2
            c-label-offset 0
            tab-width 2
            indent-tabs-mode nil
            require-final-newline nil))
    :hook (java-mode-hook . (lsp my/java-mode-hook)))

  ;; Requires dap-mode

  ;; (use-package dap-java
  ;;   :ensure nil
  ;;   :defer t
  ;;   :after (lsp-java))
#+end_src

** languages

These are minor modes to handle programming language specifics which
are often termed as development rules agreed by the team.
