content/downloads/emacs/emacs_setup.html

<div id="outline-container-org6640e38" class="outline-3">
<h3 id="org6640e38"><span class="section-number-3">9.7</span> IRC</h3>
<div class="outline-text-3" id="text-9-7">
<p>
Use <code>circe</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span>
  circe
    <span style="color: #FF80F4;">:ensure</span>
    <span style="color: #FF80F4;">:config</span><span style="color: #93a8c6;">(</span>
    setq circe-network-options '<span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>
    <span style="color: #EEDC82;">"Freenode"</span> <span style="color: #FF80F4;">:tls</span> t
    <span style="color: #FF80F4;">:nick</span> <span style="color: #EEDC82;">"fengxia41103"</span>
    <span style="color: #FF80F4;">:channels</span> <span style="color: #aebed8;">(</span><span style="color: #EEDC82;">"#emacs"</span>
    <span style="color: #EEDC82;">"#python"</span>
    <span style="color: #EEDC82;">"#odoo"</span>
    <span style="color: #EEDC82;">"#reactjs"</span>
    <span style="color: #EEDC82;">"#latex"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span>
  helm-circe

  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc2c84da" class="outline-3">
<h3 id="orgc2c84da"><span class="section-number-3">9.8</span> restclient</h3>
<div class="outline-text-3" id="text-9-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">restclient</span>
  <span style="color: #FF80F4;">:ensure</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Then wrap it w/ this, you can then embed restcall in org!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>load-file <span style="color: #EEDC82;">"~/workspace/3rd/ob-restclient.el/ob-restclient.el"</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">require</span> '<span style="color: #FF80F4;">ob-restclient</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>org-babel-do-load-languages
 'org-babel-load-languages
 '<span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span>restclient . t<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd644334" class="outline-3">
<h3 id="orgd644334"><span class="section-number-3">9.9</span> lsp</h3>
<div class="outline-text-3" id="text-9-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">lsp-mode</span>
  <span style="color: #FF80F4;">:init</span>
  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> lsp-keymap-prefix <span style="color: #EEDC82;">"C-c l"</span><span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:hook</span> <span style="color: #93a8c6;">(</span><span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">replace XXX-mode with concrete major-mode(e. g. python-mode)</span>
         <span style="color: #b0b1a3;">(</span>XXX-mode . lsp<span style="color: #b0b1a3;">)</span>
         <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">if you want which-key integration</span>
         <span style="color: #b0b1a3;">(</span>lsp-mode . lsp-enable-which-key-integration<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:commands</span> lsp<span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">lsp-mode</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:defer</span> t
  <span style="color: #FF80F4;">:init</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> lsp-keymap-prefix <span style="color: #EEDC82;">"C-c l"</span><span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:hook</span> <span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span>css-mode-hook . lsp-deferred<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span>html-mode-hook . lsp-deferred<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span>web-mode-hook . lsp-deferred<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span>js2-mode-hook . lsp-deferred<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span>c++-mode-hook . lsp-deferred<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span>c-mode-hook . lsp-deferred<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span>java-mode-hook . lsp-deferred<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span>lsp-mode-hook . lsp-enable-which-key-integration<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:commands</span> <span style="color: #93a8c6;">(</span>lsp lsp-deferred<span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:bind</span> <span style="color: #93a8c6;">(</span><span style="color: #FF80F4;">:map</span> lsp-mode-map
              <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"M-&lt;RET&gt;"</span> . lsp-execute-code-action<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">lsp-ui</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:defer</span> t
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> lsp-ui-sideline-enable nil<span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:hook</span> <span style="color: #93a8c6;">(</span>lsp-mode-hook . lsp-ui-mode<span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:bind</span> <span style="color: #93a8c6;">(</span><span style="color: #FF80F4;">:map</span> lsp-ui-mode-map
              <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-c i"</span> . lsp-ui-imenu<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">LSP integration with treemacs</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">lsp-treemacs</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:defer</span> t
  <span style="color: #FF80F4;">:after</span> lsp<span style="color: #8c8c8c;">)</span>

<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Debugger</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">dap-mode</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:defer</span> t
  <span style="color: #FF80F4;">:after</span> lsp-mode
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span>dap-auto-configure-mode<span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:bind</span> <span style="color: #93a8c6;">(</span><span style="color: #FF80F4;">:map</span> dap-mode-map
              <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-c C-c"</span> . dap-java-debug<span style="color: #b0b1a3;">)</span>
              <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-c R"</span> . dap-java-run-test-class<span style="color: #b0b1a3;">)</span>
              <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-c d"</span> . dap-java-debug-test-method<span style="color: #b0b1a3;">)</span>
              <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-c r"</span> . dap-java-run-test-method<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Requires lsp-mode</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">lsp-java</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:defer</span> t
  <span style="color: #FF80F4;">:after</span> lsp
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> lsp-java-format-on-type-enabled nil<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">my/java-mode-hook</span> <span style="color: #b0b1a3;">()</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">setq</span> c-basic-offset 2
          c-label-offset 0
          tab-width 2
          indent-tabs-mode nil
          require-final-newline nil<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:hook</span> <span style="color: #93a8c6;">(</span>java-mode-hook . <span style="color: #b0b1a3;">(</span>lsp my/java-mode-hook<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Requires dap-mode</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">dap-java</span>
  <span style="color: #FF80F4;">:ensure</span> nil
  <span style="color: #FF80F4;">:defer</span> t
  <span style="color: #FF80F4;">:after</span> <span style="color: #93a8c6;">(</span>lsp-java<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgab48dc9" class="outline-3">
<h3 id="orgab48dc9"><span class="section-number-3">9.10</span> languages</h3>
<div class="outline-text-3" id="text-9-10">
<p>
These are minor modes to handle programming language specifics which
are often termed as development rules agreed by the team.
</p>
</div>
