content/downloads/emacs/emacs_setup.el
    setq circe-network-options '((
    "Freenode" :tls t
    :nick "fengxia41103"
    :channels ("#emacs"
    "#python"
    "#odoo"
    "#reactjs"
    "#latex")))))
(use-package
  helm-circe

  :ensure
  :config)

(use-package restclient
  :ensure)

(load-file "~/workspace/3rd/ob-restclient.el/ob-restclient.el")
(require 'ob-restclient)
(org-babel-do-load-languages
 'org-babel-load-languages
 '((restclient . t)))
