content/downloads/emacs/emacs_setup.org
*** markdown
Enough to handle my Markdown needs.

#+BEGIN_SRC emacs-lisp
  (use-package writegood-mode
    :ensure
    :config)

  (use-package
    markdown-mode

    :ensure
    :config
    (add-to-list 'auto-mode-alist '("\\.md\\'" . markdown-mode)
    (add-hook 'markdown-mode-hook
              (lambda ()
                (visual-line-mode t)
                (writegood-mode t)
                (auto-fill-mode t)
                (flyspell-mode t)))))
#+END_SRC

Tweak the section header fonts a bit:

#+BEGIN_SRC emacs-lisp :tangle no

(let* ((variable-tuple
          (cond ((x-list-fonts "ETBembo")         '(:font "ETBembo"))
                ((x-list-fonts "Source Sans Pro") '(:font "Source Sans Pro"))
                ((x-list-fonts "Lucida Grande")   '(:font "Lucida Grande"))
                ((x-list-fonts "Verdana")         '(:font "Verdana"))
                ((x-family-fonts "Sans Serif")    '(:family "Sans Serif"))
                (nil (warn "Cannot find a Sans Serif Font.  Install Source Sans Pro."))))
         (headline           `(:inherit default :weight bold :foreground "#F5F5F5")))

(custom-set-faces
 '(markdown-header-face ((t (,@headline ,@variable-tuple :height 1.0))))
 '(markdown-header-face-1 ((t (,@headline ,@variable-tuple :height 1.3)))
 '(markdown-header-face-2 ((t (,@headline ,@variable-tuple :height 1.2 :foreground "#8BC34A"))))
 '(markdown-header-face-3 ((t (,@headline ,@variable-tuple :height 1.1 :foreground "#FEB236"))))
)
#+END_SRC

Set more markdown faces:

#+BEGIN_SRC emacs-lisp
  (custom-theme-set-faces
   'user
   '(markdown-code-face ((t (:background "gray10"))))
  )
#+END_SRC

*** C/C++
**** header/implementation toggle

Switch from header to implementation file quickly.
#+BEGIN_SRC emacs-lisp
(add-hook 'c-mode-common-hook
          (lambda ()
            (local-set-key  (kbd "C-c o") 'ff-find-other-file)))
#+END_SRC

**** no indentation of namespaces in C++
Essentially, use the Google C++ style formatting.
#+BEGIN_SRC emacs-lisp
  (use-package google-c-style
    :ensure t
    :config
    (add-hook 'c-mode-common-hook 'google-set-c-style)
    (add-hook 'c-mode-common-hook 'google-make-newline-indent))

#+END_SRC

