content/downloads/emacs/emacs_setup.html
<div id="outline-container-org7905d77" class="outline-4">
<h4 id="org7905d77"><span class="section-number-4">9.10.1</span> markdown</h4>
<div class="outline-text-4" id="text-9-10-1">
<p>
Enough to handle my Markdown needs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">writegood-mode</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span>
  markdown-mode

  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span>add-to-list 'auto-mode-alist '<span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"\\.md\\'"</span> . markdown-mode<span style="color: #b0b1a3;">)</span>
  <span style="color: #b0b1a3;">(</span>add-hook 'markdown-mode-hook
            <span style="color: #97b098;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #aebed8;">()</span>
              <span style="color: #aebed8;">(</span>visual-line-mode t<span style="color: #aebed8;">)</span>
              <span style="color: #aebed8;">(</span>writegood-mode t<span style="color: #aebed8;">)</span>
              <span style="color: #aebed8;">(</span>auto-fill-mode t<span style="color: #aebed8;">)</span>
              <span style="color: #aebed8;">(</span>flyspell-mode t<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
Tweak the section header fonts a bit:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">let*</span> <span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span>variable-tuple
          <span style="color: #97b098;">(</span><span style="color: #F92672;">cond</span> <span style="color: #aebed8;">(</span><span style="color: #b0b0b3;">(</span>x-list-fonts <span style="color: #EEDC82;">"ETBembo"</span><span style="color: #b0b0b3;">)</span>         '<span style="color: #b0b0b3;">(</span><span style="color: #FF80F4;">:font</span> <span style="color: #EEDC82;">"ETBembo"</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
                <span style="color: #aebed8;">(</span><span style="color: #b0b0b3;">(</span>x-list-fonts <span style="color: #EEDC82;">"Source Sans Pro"</span><span style="color: #b0b0b3;">)</span> '<span style="color: #b0b0b3;">(</span><span style="color: #FF80F4;">:font</span> <span style="color: #EEDC82;">"Source Sans Pro"</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
                <span style="color: #aebed8;">(</span><span style="color: #b0b0b3;">(</span>x-list-fonts <span style="color: #EEDC82;">"Lucida Grande"</span><span style="color: #b0b0b3;">)</span>   '<span style="color: #b0b0b3;">(</span><span style="color: #FF80F4;">:font</span> <span style="color: #EEDC82;">"Lucida Grande"</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
                <span style="color: #aebed8;">(</span><span style="color: #b0b0b3;">(</span>x-list-fonts <span style="color: #EEDC82;">"Verdana"</span><span style="color: #b0b0b3;">)</span>         '<span style="color: #b0b0b3;">(</span><span style="color: #FF80F4;">:font</span> <span style="color: #EEDC82;">"Verdana"</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
                <span style="color: #aebed8;">(</span><span style="color: #b0b0b3;">(</span>x-family-fonts <span style="color: #EEDC82;">"Sans Serif"</span><span style="color: #b0b0b3;">)</span>    '<span style="color: #b0b0b3;">(</span><span style="color: #FF80F4;">:family</span> <span style="color: #EEDC82;">"Sans Serif"</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
                <span style="color: #aebed8;">(</span>nil <span style="color: #b0b0b3;">(</span><span style="color: #FF6C60;">warn</span> <span style="color: #EEDC82;">"Cannot find a Sans Serif Font.  Install Source Sans Pro."</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span>headline           `<span style="color: #97b098;">(</span><span style="color: #FF80F4;">:inherit</span> default <span style="color: #FF80F4;">:weight</span> bold <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"#F5F5F5"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>

<span style="color: #93a8c6;">(</span>custom-set-faces
 '<span style="color: #b0b1a3;">(</span>markdown-header-face <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>t <span style="color: #b0b0b3;">(</span>,@headline ,@variable-tuple <span style="color: #FF80F4;">:height</span> 1.0<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
 '<span style="color: #b0b1a3;">(</span>markdown-header-face-1 <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>t <span style="color: #b0b0b3;">(</span>,@headline ,@variable-tuple <span style="color: #FF80F4;">:height</span> 1.3<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
 '<span style="color: #97b098;">(</span>markdown-header-face-2 <span style="color: #aebed8;">(</span><span style="color: #b0b0b3;">(</span>t <span style="color: #90a890;">(</span>,@headline ,@variable-tuple <span style="color: #FF80F4;">:height</span> 1.2 <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"#8BC34A"</span><span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
 '<span style="color: #97b098;">(</span>markdown-header-face-3 <span style="color: #aebed8;">(</span><span style="color: #b0b0b3;">(</span>t <span style="color: #90a890;">(</span>,@headline ,@variable-tuple <span style="color: #FF80F4;">:height</span> 1.1 <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"#FEB236"</span><span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
<span style="color: #b0b1a3;">)</span>
</pre>
</div>

<p>
Set more markdown faces:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>custom-theme-set-faces
 'user
 '<span style="color: #93a8c6;">(</span>markdown-code-face <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:background</span> <span style="color: #EEDC82;">"gray10"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7a085fe" class="outline-4">
<h4 id="org7a085fe"><span class="section-number-4">9.10.2</span> C/C++</h4>
<div class="outline-text-4" id="text-9-10-2">
</div>
<ol class="org-ol">
<li><a id="org263aada"></a>header/implementation toggle<br />
<div class="outline-text-5" id="text-9-10-2-1">
<p>
Switch from header to implementation file quickly.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>add-hook 'c-mode-common-hook
          <span style="color: #93a8c6;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #b0b1a3;">()</span>
            <span style="color: #b0b1a3;">(</span>local-set-key  <span style="color: #97b098;">(</span>kbd <span style="color: #EEDC82;">"C-c o"</span><span style="color: #97b098;">)</span> 'ff-find-other-file<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org86bddf5"></a>no indentation of namespaces in C++<br />
<div class="outline-text-5" id="text-9-10-2-2">
<p>
Essentially, use the Google C++ style formatting.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">google-c-style</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span>add-hook 'c-mode-common-hook 'google-set-c-style<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>add-hook 'c-mode-common-hook 'google-make-newline-indent<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

</pre>
</div>
</div>
</li>
</ol>
</div>
