content/downloads/emacs/emacs_setup.el

(use-package writegood-mode
  :ensure
  :config)

(use-package
  markdown-mode

  :ensure
  :config
  (add-to-list 'auto-mode-alist '("\\.md\\'" . markdown-mode)
  (add-hook 'markdown-mode-hook
            (lambda ()
              (visual-line-mode t)
              (writegood-mode t)
              (auto-fill-mode t)
              (flyspell-mode t)))))

(custom-theme-set-faces
 'user
 '(markdown-code-face ((t (:background "gray10"))))
)

(add-hook 'c-mode-common-hook
          (lambda ()
            (local-set-key  (kbd "C-c o") 'ff-find-other-file)))

(use-package google-c-style
  :ensure t
  :config
  (add-hook 'c-mode-common-hook 'google-set-c-style)
  (add-hook 'c-mode-common-hook 'google-make-newline-indent))
