content/downloads/emacs/emacs_setup.org
*** python

Setup an IDE:

#+BEGIN_SRC emacs-lisp :tangle no
(use-package elpy
  :ensure t
  :init
  (elpy-enable))
#+END_SRC


ELPY has its own indentation mode, which is overriding the one I use
globally, so disable this one:

#+BEGIN_SRC emacs-lisp :tangle no
  (add-hook 'elpy-mode-hook (lambda () (highlight-indentation-mode -1)))
#+END_SRC


Link to yasnippet mode:
#+BEGIN_SRC emacs-lisp :tangle no
(add-hook 'elpy-mode-hook #'yas-minor-mode)
#+END_SRC


Auto black on save:
#+BEGIN_SRC emacs-lisp
(add-hook 'before-save-hook #'elpy-black-fix-code nil t)
#+END_SRC


Force UTF-8 encoding. Otherwise, elpy will complain w/ some exit 1 abnormal
error.

#+BEGIN_SRC emacs-lisp
(setenv "PYTHONIOENCODING" "utf-8")
(add-to-list 'process-coding-system-alist '("python" . (utf-8 . utf-8)))
(add-to-list 'process-coding-system-alist '("elpy" . (utf-8 . utf-8)))
(add-to-list 'process-coding-system-alist '("flake8" . (utf-8 . utf-8)))
#+END_SRC


And set up virtualenv path:
#+BEGIN_SRC emacs-lisp :tangle no
;; workon home
(setenv "WORKON_HOME" "/home/fengxia/workspace/me/python-venv/")
(setq elpy-rpc-virtualenv-path 'current)
#+END_SRC

Add [[https://github.com/naiquevin/sphinx-doc.el][sphinx-doc]] to generate docstrings:
#+begin_src emacs-lisp
(use-package sphinx-doc
  :ensure t)
(add-hook 'python-mode-hook (lambda ()
                              (require 'sphinx-doc)
                              (sphinx-doc-mode t)))
#+end_src

**** auto-virtualenv

#+BEGIN_SRC
(use-package auto-virtualenv
  :ensure t
  :init
  (use-package pyvenv
    :ensure t)
  :config
  (add-hook 'python-mode-hook 'auto-virtualenv-set-virtualenv)
  (add-hook 'projectile-after-switch-project-hook 'auto-virtualenv-set-virtualenv)
  )
#+END_SRC

**** py-autopep8

Add hook to reformat python code based on pep8 spec. You need to
install =pip install autopep8= offline.

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package
    py-autopep8
    :ensure)
  (add-hook 'python-mode-hook 'py-autopep8-enable-on-save)
  (setq py-autopep8-options '("--max-line-length=88"))
#+END_SRC


#+RESULTS:
| --max-line-length=79 |

**** py-isort
Sort python import. Need to install =pip install isort= offline.

#+BEGIN_SRC emacs-lisp
  (use-package
    py-isort

    :ensure
    :config
    (add-hook 'before-save-hook 'py-isort-before-save)
    (setq py-isort-options '("-sl --profile black --filter-files")))
#+END_SRC

**** imenu-list

#+BEGIN_SRC emacs-lisp
  (use-package imenu-list
  :ensure)
#+END_SRC

**** smartparens
#+BEGIN_SRC emacs-lisp
(add-hook 'python-mode-hook #'smartparens-mode)
#+END_SRC

**** python-black

I installed ~black~ using ~apt install black~ because my default
virtualenv is still on python 2.7. If you have 3.x, you should follow
their [[https://github.com/psf/black][official instruction]]. Anyway, I think either should be fine.

Now use the emacs wrapper:

#+BEGIN_SRC emacs-lisp
(use-package python-black
  :ensure)
#+END_SRC

**** sphinx-doc

Creat [[https://github.com/naiquevin/sphinx-doc.el][sphinx doc]] string from function definition directly.

#+BEGIN_SRC emacs-lisp

(use-package sphinx-doc
  :ensure)
  (add-hook 'python-mode-hook (lambda ()
  (require 'sphinx-doc)
  (sphinx-doc-mode t)))
#+END_SRC

