content/downloads/emacs/emacs_setup.html

<div id="outline-container-org7283245" class="outline-4">
<h4 id="org7283245"><span class="section-number-4">9.10.3</span> python</h4>
<div class="outline-text-4" id="text-9-10-3">
<p>
Setup an IDE:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">elpy</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:init</span>
  <span style="color: #93a8c6;">(</span>elpy-enable<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
ELPY has its own indentation mode, which is overriding the one I use
globally, so disable this one:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>add-hook 'elpy-mode-hook <span style="color: #93a8c6;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #b0b1a3;">()</span> <span style="color: #b0b1a3;">(</span>highlight-indentation-mode -1<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Link to yasnippet mode:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>add-hook 'elpy-mode-hook #'yas-minor-mode<span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Auto black on save:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>add-hook 'before-save-hook #'elpy-black-fix-code nil t<span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Force UTF-8 encoding. Otherwise, elpy will complain w/ some exit 1 abnormal
error.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>setenv <span style="color: #EEDC82;">"PYTHONIOENCODING"</span> <span style="color: #EEDC82;">"utf-8"</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-to-list 'process-coding-system-alist '<span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"python"</span> . <span style="color: #b0b1a3;">(</span>utf-8 . utf-8<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-to-list 'process-coding-system-alist '<span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"elpy"</span> . <span style="color: #b0b1a3;">(</span>utf-8 . utf-8<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-to-list 'process-coding-system-alist '<span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"flake8"</span> . <span style="color: #b0b1a3;">(</span>utf-8 . utf-8<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
And set up virtualenv path:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">workon home</span>
<span style="color: #8c8c8c;">(</span>setenv <span style="color: #EEDC82;">"WORKON_HOME"</span> <span style="color: #EEDC82;">"/home/fengxia/.virtualenvs/"</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> elpy-rpc-virtualenv-path 'current<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="orgde3a0c3"></a>auto-virtualenv<br />
<div class="outline-text-5" id="text-9-10-3-1">
<pre class="example">
(use-package auto-virtualenv
  :ensure t
  :init
  (use-package pyvenv
    :ensure t)
  :config
  (add-hook 'python-mode-hook 'auto-virtualenv-set-virtualenv)
  (add-hook 'projectile-after-switch-project-hook 'auto-virtualenv-set-virtualenv)
  )
</pre>
</div>
</li>

<li><a id="org109ccdc"></a>py-autopep8<br />
<div class="outline-text-5" id="text-9-10-3-2">
<p>
Add hook to reformat python code based on pep8 spec. You need to
install <code>pip install autopep8</code> offline.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span>
  py-autopep8
  <span style="color: #FF80F4;">:ensure</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'python-mode-hook 'py-autopep8-enable-on-save<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> py-autopep8-options '<span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"--max-line-length=88"</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org3f5c108"></a>py-isort<br />
<div class="outline-text-5" id="text-9-10-3-3">
<p>
Sort python import. Need to install <code>pip install isort</code> offline.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span>
  py-isort

  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span>add-hook 'before-save-hook 'py-isort-before-save<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> py-isort-options '<span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"-sl --profile black --filter-files"</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgdb6564e"></a>imenu-list<br />
<div class="outline-text-5" id="text-9-10-3-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">imenu-list</span>
<span style="color: #FF80F4;">:ensure</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org3344a21"></a>smartparens<br />
<div class="outline-text-5" id="text-9-10-3-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>add-hook 'python-mode-hook #'smartparens-mode<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgc835361"></a>python-black<br />
<div class="outline-text-5" id="text-9-10-3-6">
<p>
I installed <code>black</code> using <code>apt install black</code> because my default
virtualenv is still on python 2.7. If you have 3.x, you should follow
their <a href="https://github.com/psf/black">official instruction</a>. Anyway, I think either should be fine.
</p>

<p>
Now use the emacs wrapper:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">python-black</span>
  <span style="color: #FF80F4;">:ensure</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org9450a3f"></a>sphinx-doc<br />
<div class="outline-text-5" id="text-9-10-3-7">
<p>
Creat <a href="https://github.com/naiquevin/sphinx-doc.el">sphinx doc</a> string from function definition directly.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">sphinx-doc</span>
  <span style="color: #FF80F4;">:ensure</span><span style="color: #8c8c8c;">)</span>
  <span style="color: #8c8c8c;">(</span>add-hook 'python-mode-hook <span style="color: #93a8c6;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #b0b1a3;">()</span>
  <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">require</span> '<span style="color: #FF80F4;">sphinx-doc</span><span style="color: #b0b1a3;">)</span>
  <span style="color: #b0b1a3;">(</span>sphinx-doc-mode t<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
