content/downloads/emacs/emacs_setup.el

(setenv "PYTHONIOENCODING" "utf-8")
(add-to-list 'process-coding-system-alist '("python" . (utf-8 . utf-8)))
(add-to-list 'process-coding-system-alist '("elpy" . (utf-8 . utf-8)))
(add-to-list 'process-coding-system-alist '("flake8" . (utf-8 . utf-8)))

(use-package
  py-isort

  :ensure
  :config
  (add-hook 'before-save-hook 'py-isort-before-save)
  (setq py-isort-options '("-sl --profile black --filter-files")))

(use-package imenu-list
:ensure)

(add-hook 'python-mode-hook #'smartparens-mode)

(use-package python-black
  :ensure)

(use-package sphinx-doc
  :ensure)
  (add-hook 'python-mode-hook (lambda ()
  (require 'sphinx-doc)
  (sphinx-doc-mode t)))
