content/downloads/emacs/emacs_setup.org
*** web-mode
web-mode with config for Polymer editing
#+BEGIN_SRC emacs-lisp
  (use-package web-mode
    :ensure t
    :config
    (setq web-mode-enable-current-element-highlight t)
    (setq web-mode-enable-current-column-highlight t)
    (setq web-mode-enable-css-colorization t))
    (setq web-mode-markup-indent-offset 2)
    (setq web-mode-css-indent-offset 2)
    (setq web-mode-code-indent-offset 2)
#+END_SRC


Who should use this mode:
#+BEGIN_SRC emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.html\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.[agj]sp\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.ftl\\'" . web-mode))
#+END_SRC

This is actually depending on =js-beautify=. See [[https://github.com/yasuyk/web-beautify][web-beautify]] for
details.

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package web-beautify
    :ensure
    :config)
  ;; (add-hook 'js2-mode-hook
  ;;           (lambda ()
  ;;             (add-hook 'before-save-hook 'web-beautify-js-buffer t t)))
  ;; (add-hook 'json-mode-hook
  ;;           (lambda ()
  ;;             (add-hook 'before-save-hook 'web-beautify-js-buffer t t)))
  (add-hook 'web-mode-hook
            (lambda ()
              (add-hook 'before-save-hook 'web-beautify-html-buffer t t)))
  ;; (add-hook 'css-mode-hook
  ;;           (lambda ()
  ;;             (add-hook 'before-save-hook 'web-beautify-css-buffer t t)))
  (add-hook 'html-mode-hook
            (lambda ()
              (add-hook 'before-save-hook 'web-beautify-html-buffer t t)))
#+END_SRC

*** [[https://github.com/smihica/emmet-mode][emmet-mode]]

Useful abbreviations when coding in HTML. See [[https://github.com/rooney/zencoding][zencoding]] for details.

#+BEGIN_SRC emacs-lisp
  (use-package emmet-mode
    :ensure t
    :after(web-mode css-mode scss-mode)
    :config)
  (setq emmet-expand-jsx-className? t)
  (setq emmet-move-cursor-between-quotes t)
  (add-hook 'emmet-mode-hook (lambda () (setq emmet-indent-after-insert nil)))
  (add-hook 'sgml-mode-hook 'emmet-mode)
  (add-hook 'web-mode-hook 'emmet-mode)
  (add-hook 'css-mode-hook  'emmet-mode)
  (add-hook 'scss-mode-hook  'emmet-mode)
#+END_SRC

*** javascript family: .js .ts .jsx
There are a couple packages for .js files.

**** js2-mode
First, use =js2-mode= to handle =.js= and =.jsx= files.

#+BEGIN_SRC emacs-lisp
  (use-package js2-mode
    :ensure
    :config)
  (setq js2-indent-level 2)
  (add-to-list 'auto-mode-alist '("\\.js[x]\\'" . js2-mode))
  (add-to-list 'auto-mode-alist '("\\.ts[x]\\'" . js2-mode))
  (add-hook 'js2-mode-hook #'smartparens-mode)
  (add-hook 'js2-mode-hook #'(lambda () (setq-local electric-indent-inhibit t)))
#+END_SRC

