content/downloads/emacs/emacs_setup.html

<div id="outline-container-org05c18d9" class="outline-4">
<h4 id="org05c18d9"><span class="section-number-4">9.10.4</span> web-mode</h4>
<div class="outline-text-4" id="text-9-10-4">
<p>
web-mode with config for Polymer editing
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">web-mode</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> web-mode-enable-current-element-highlight t<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> web-mode-enable-current-column-highlight t<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> web-mode-enable-css-colorization t<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
  <span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> web-mode-markup-indent-offset 2<span style="color: #8c8c8c;">)</span>
  <span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> web-mode-css-indent-offset 2<span style="color: #8c8c8c;">)</span>
  <span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> web-mode-code-indent-offset 2<span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Who should use this mode:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>add-to-list 'auto-mode-alist '<span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"\\.html\\'"</span> . web-mode<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-to-list 'auto-mode-alist '<span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"\\.tpl\\.php\\'"</span> . web-mode<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-to-list 'auto-mode-alist '<span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"\\.[agj]sp\\'"</span> . web-mode<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-to-list 'auto-mode-alist '<span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"\\.as[cp]x\\'"</span> . web-mode<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-to-list 'auto-mode-alist '<span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"\\.erb\\'"</span> . web-mode<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-to-list 'auto-mode-alist '<span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"\\.mustache\\'"</span> . web-mode<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-to-list 'auto-mode-alist '<span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"\\.ftl\\'"</span> . web-mode<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
This is actually depending on <code>js-beautify</code>. See <a href="https://github.com/yasuyk/web-beautify">web-beautify</a> for
details.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">web-beautify</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">(add-hook 'js2-mode-hook</span>
<span style="color: #8C8C8C;">;;           </span><span style="color: #696969; font-style: italic;">(lambda ()</span>
<span style="color: #8C8C8C;">;;             </span><span style="color: #696969; font-style: italic;">(add-hook 'before-save-hook 'web-beautify-js-buffer t t)))</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">(add-hook 'json-mode-hook</span>
<span style="color: #8C8C8C;">;;           </span><span style="color: #696969; font-style: italic;">(lambda ()</span>
<span style="color: #8C8C8C;">;;             </span><span style="color: #696969; font-style: italic;">(add-hook 'before-save-hook 'web-beautify-js-buffer t t)))</span>
<span style="color: #8c8c8c;">(</span>add-hook 'web-mode-hook
          <span style="color: #93a8c6;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #b0b1a3;">()</span>
            <span style="color: #b0b1a3;">(</span>add-hook 'before-save-hook 'web-beautify-html-buffer t t<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">(add-hook 'css-mode-hook</span>
<span style="color: #8C8C8C;">;;           </span><span style="color: #696969; font-style: italic;">(lambda ()</span>
<span style="color: #8C8C8C;">;;             </span><span style="color: #696969; font-style: italic;">(add-hook 'before-save-hook 'web-beautify-css-buffer t t)))</span>
<span style="color: #8c8c8c;">(</span>add-hook 'html-mode-hook
          <span style="color: #93a8c6;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #b0b1a3;">()</span>
            <span style="color: #b0b1a3;">(</span>add-hook 'before-save-hook 'web-beautify-html-buffer t t<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc9148d5" class="outline-4">
<h4 id="orgc9148d5"><span class="section-number-4">9.10.5</span> <a href="https://github.com/smihica/emmet-mode">emmet-mode</a></h4>
<div class="outline-text-4" id="text-9-10-5">
<p>
Useful abbreviations when coding in HTML. See <a href="https://github.com/rooney/zencoding">zencoding</a> for details.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">emmet-mode</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:after</span><span style="color: #93a8c6;">(</span>web-mode css-mode scss-mode<span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> emmet-expand-jsx-className? t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> emmet-move-cursor-between-quotes t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'emmet-mode-hook <span style="color: #93a8c6;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #b0b1a3;">()</span> <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">setq</span> emmet-indent-after-insert nil<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'sgml-mode-hook 'emmet-mode<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'web-mode-hook 'emmet-mode<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'css-mode-hook  'emmet-mode<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'scss-mode-hook  'emmet-mode<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org21eb8a4" class="outline-4">
<h4 id="org21eb8a4"><span class="section-number-4">9.10.6</span> javascript family: .js .ts .jsx</h4>
<div class="outline-text-4" id="text-9-10-6">
<p>
There are a couple packages for .js files.
</p>
</div>

<ol class="org-ol">
<li><a id="org26c370b"></a>js2-mode<br />
<div class="outline-text-5" id="text-9-10-6-1">
<p>
First, use <code>js2-mode</code> to handle <code>.js</code> and <code>.jsx</code> files.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">js2-mode</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> js2-indent-level 2<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-to-list 'auto-mode-alist '<span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"\\.js[x]\\'"</span> . js2-mode<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-to-list 'auto-mode-alist '<span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"\\.ts[x]\\'"</span> . js2-mode<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'js2-mode-hook #'smartparens-mode<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'js2-mode-hook #'<span style="color: #93a8c6;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #b0b1a3;">()</span> <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">setq-local</span> electric-indent-inhibit t<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>
