content/downloads/emacs/emacs_setup.el

(use-package web-mode
  :ensure t
  :config
  (setq web-mode-enable-current-element-highlight t)
  (setq web-mode-enable-current-column-highlight t)
  (setq web-mode-enable-css-colorization t))
  (setq web-mode-markup-indent-offset 2)
  (setq web-mode-css-indent-offset 2)
  (setq web-mode-code-indent-offset 2)

(add-to-list 'auto-mode-alist '("\\.html\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.[agj]sp\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.ftl\\'" . web-mode))

(use-package emmet-mode
  :ensure t
  :after(web-mode css-mode scss-mode)
  :config)
(setq emmet-expand-jsx-className? t)
(setq emmet-move-cursor-between-quotes t)
(add-hook 'emmet-mode-hook (lambda () (setq emmet-indent-after-insert nil)))
(add-hook 'sgml-mode-hook 'emmet-mode)
(add-hook 'web-mode-hook 'emmet-mode)
(add-hook 'css-mode-hook  'emmet-mode)
(add-hook 'scss-mode-hook  'emmet-mode)

(use-package js2-mode
    :ensure
    :config)
(setq js2-indent-level 2)
(add-to-list 'auto-mode-alist '("\\.js[x]\\'" . js2-mode))
(add-to-list 'auto-mode-alist '("\\.ts[x]\\'" . js2-mode))
(add-hook 'js2-mode-hook #'smartparens-mode)
(add-hook 'js2-mode-hook #'(lambda () (setq-local electric-indent-inhibit t)))
