content/downloads/emacs/emacs_setup.org
**** prettier
Link js2-mode to prettier to beautify my code.
Follow [[https://github.com/jscheid/prettier.el][official site]] to install and config.

Set which prettier to use. Note that w/ NVM, you must set =nvm use 16.15.1= in
=.bashrc= or =.zshrc= so that shell will use the right path, also. You can check
which is the default node path in effect in Emacs by =M-x prettier-info=.

#+begin_src emacs-lisp :tangle no
(setenv "NODE_PATH" "/home/fengxia/.nvm/versions/node/v16.15.1/bin")
#+end_src

#+BEGIN_SRC emacs-lisp
  (use-package prettier
    :ensure
    :config)
  (add-hook 'js2-mode-hook 'prettier-mode)
  (add-hook 'json-mode-hook 'prettier-mode)
  (add-hook 'js-mode-hook 'prettier-mode)
  (setq indent-tabs-mode nil js-indent-level 2)
  (add-hook
   'js2-mode-hook
   (lambda ()
     (when (string-match "\\.[tj]sx?$" buffer-file-name)
       (setq-local prettier-parsers '(typescript)))))
#+END_SRC

**** js-doc
Nothing is complete without a doc solution.

#+BEGIN_SRC emacs-lisp
(use-package js-doc
  :ensure
  :config
  (setq js-doc-mail-address "feng.xia@mycompany.io")
  (setq js-doc-author (format "Feng Xia <%s>" js-doc-mail-address))
  (setq js-doc-url "http://www.mycompany.com")
  (setq js-doc-license "Company License")
)
(add-hook 'js2-mode-hook
          #'(lambda ()
              (define-key js2-mode-map "\C-ci" 'js-doc-insert-function-doc)
              (define-key js2-mode-map "@" 'js-doc-insert-tag)))

#+END_SRC

*** csv
mode to edit CSV files.
#+BEGIN_SRC emacs-lisp :tangle no
  (use-package csv-mode
    :ensure t
    :mode "\\.csv\\'")
#+END_SRC

*** json

This should be installed before the javascript stuff because I'll be
using the =prettier= as beautifier.

#+BEGIN_SRC emacs-lisp
  (use-package json-mode
    :ensure
    :config)
#+END_SRC

*** yaml

Details are [[https://github.com/yoshiki/yaml-mode][here]].

#+BEGIN_SRC emacs-lisp
  (use-package yaml-mode
    :ensure
    :config)
  (add-to-list 'auto-mode-alist '("\\.yml\\'" . yaml-mode))
  (add-hook 'yaml-mode-hook
            '(lambda ()
          (define-key yaml-mode-map "\C-m" 'newline-and-indent)))
#+END_SRC

Add [[https://github.com/iquiw/lsp-yaml][lsp-yaml]]:

#+begin_src emacs-lisp
(use-package lsp-yaml
  :after lsp
  :config
  (add-hook 'yaml-mode-hook #'lsp))
#+end_src

*** jenkins

#+BEGIN_SRC emacs-lisp
  (use-package jenkinsfile-mode
    :ensure
    :config)

#+END_SRC

*** SQL

I guess I would have to deal w/ SQL eventually. See the [[https://github.com/purcell/sqlformat][instructions here]]. You
need to install =apt install pgformatter= offline.

#+begin_src emacs-lisp
  (use-package sqlformat
    :ensure
    :config)
#+end_src

If using =pg_format=, set the configs:

#+begin_src emacs-lisp
(setq sqlformat-command 'pgformatter)
(setq sqlformat-args '("-s4" "-B" "-w150" "-k" "-f2" "-U2" "--extra-keyword=/home/fengxia/workspace/tmp/oracle-keywords"))
#+end_src

If using =sqlformat=, set the configs:
#+begin_src emacs-lisp :tango no
(setq sqlformat-command 'sqlformat)
(setq sqlformat-args '("-k" "upper" "-i" "upper" "-s" "-r" "--indent_width=4"))
#+end_src

And define a keybind for formatting:

#+begin_src emacs-lisp
(add-hook 'sql-mode-hook '(lambda()
  (define-key sql-mode-map (kbd "C-c C-f") 'sqlformat-buffer)))
#+end_src

