content/downloads/emacs/emacs_setup.html

<li><a id="org75d945d"></a>prettier<br />
<div class="outline-text-5" id="text-9-10-6-2">
<p>
Link js2-mode to prettier to beautify my code.
Follow <a href="https://github.com/jscheid/prettier.el">official site</a> to install and config.
</p>

<p>
Set which prettier to use. Note that w/ NVM, you must set <code>nvm use 16.15.1</code> in
<code>.bashrc</code> or <code>.zshrc</code> so that shell will use the right path, also. You can check
which is the default node path in effect in Emacs by <code>M-x prettier-info</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>setenv <span style="color: #EEDC82;">"NODE_PATH"</span> <span style="color: #EEDC82;">"/home/fengxia/.nvm/versions/node/v16.15.1/bin"</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">prettier</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'js2-mode-hook 'prettier-mode<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'json-mode-hook 'prettier-mode<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'js-mode-hook 'prettier-mode<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> indent-tabs-mode nil js-indent-level 2<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook
 'js2-mode-hook
 <span style="color: #93a8c6;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #b0b1a3;">()</span>
   <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">when</span> <span style="color: #97b098;">(</span>string-match <span style="color: #EEDC82;">"\\.[tj]sx?$"</span> buffer-file-name<span style="color: #97b098;">)</span>
     <span style="color: #97b098;">(</span><span style="color: #F92672;">setq-local</span> prettier-parsers '<span style="color: #aebed8;">(</span>typescript<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org7fd6845"></a>js-doc<br />
<div class="outline-text-5" id="text-9-10-6-3">
<p>
Nothing is complete without a doc solution.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">js-doc</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> js-doc-mail-address <span style="color: #EEDC82;">"feng.xia@mycompany.io"</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> js-doc-author <span style="color: #b0b1a3;">(</span>format <span style="color: #EEDC82;">"Feng Xia &lt;%s&gt;"</span> js-doc-mail-address<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> js-doc-url <span style="color: #EEDC82;">"http://www.mycompany.com"</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> js-doc-license <span style="color: #EEDC82;">"Company License"</span><span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'js2-mode-hook
          #'<span style="color: #93a8c6;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #b0b1a3;">()</span>
              <span style="color: #b0b1a3;">(</span>define-key js2-mode-map <span style="color: #EEDC82;">"\C-ci"</span> 'js-doc-insert-function-doc<span style="color: #b0b1a3;">)</span>
              <span style="color: #b0b1a3;">(</span>define-key js2-mode-map <span style="color: #EEDC82;">"@"</span> 'js-doc-insert-tag<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgffb48d1" class="outline-4">
<h4 id="orgffb48d1"><span class="section-number-4">9.10.7</span> csv</h4>
<div class="outline-text-4" id="text-9-10-7">
<p>
mode to edit CSV files.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">csv-mode</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:mode</span> <span style="color: #EEDC82;">"\\.csv\\'"</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf94ed3d" class="outline-4">
<h4 id="orgf94ed3d"><span class="section-number-4">9.10.8</span> json</h4>
<div class="outline-text-4" id="text-9-10-8">
<p>
This should be installed before the javascript stuff because I'll be
using the <code>prettier</code> as beautifier.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">json-mode</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgac07113" class="outline-4">
<h4 id="orgac07113"><span class="section-number-4">9.10.9</span> yaml</h4>
<div class="outline-text-4" id="text-9-10-9">
<p>
Details are <a href="https://github.com/yoshiki/yaml-mode">here</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">yaml-mode</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-to-list 'auto-mode-alist '<span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"\\.yml\\'"</span> . yaml-mode<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'yaml-mode-hook
          '<span style="color: #93a8c6;">(</span>lambda <span style="color: #b0b1a3;">()</span>
        <span style="color: #b0b1a3;">(</span>define-key yaml-mode-map <span style="color: #EEDC82;">"\C-m"</span> 'newline-and-indent<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
Add <a href="https://github.com/iquiw/lsp-yaml">lsp-yaml</a>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">lsp-yaml</span>
  <span style="color: #FF80F4;">:after</span> lsp
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span>add-hook 'yaml-mode-hook #'lsp<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org44a4e54" class="outline-4">
<h4 id="org44a4e54"><span class="section-number-4">9.10.10</span> jenkins</h4>
<div class="outline-text-4" id="text-9-10-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">jenkinsfile-mode</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org83ae7f3" class="outline-4">
<h4 id="org83ae7f3"><span class="section-number-4">9.10.11</span> SQL</h4>
<div class="outline-text-4" id="text-9-10-11">
<p>
I guess I would have to deal w/ SQL eventually. See the <a href="https://github.com/purcell/sqlformat">instructions here</a>. You
need to install <code>apt install pgformatter</code> offline.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">sqlformat</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
If using <code>pg_format</code>, set the configs:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> sqlformat-command 'pgformatter<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> sqlformat-args '<span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"-s4"</span> <span style="color: #EEDC82;">"-B"</span> <span style="color: #EEDC82;">"-w150"</span> <span style="color: #EEDC82;">"-k"</span> <span style="color: #EEDC82;">"-f2"</span> <span style="color: #EEDC82;">"-U2"</span> <span style="color: #EEDC82;">"--extra-keyword=/home/fengxia/workspace/tmp/oracle-keywords"</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
If using <code>sqlformat</code>, set the configs:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> sqlformat-command 'sqlformat<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> sqlformat-args '<span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"-k"</span> <span style="color: #EEDC82;">"upper"</span> <span style="color: #EEDC82;">"-i"</span> <span style="color: #EEDC82;">"upper"</span> <span style="color: #EEDC82;">"-s"</span> <span style="color: #EEDC82;">"-r"</span> <span style="color: #EEDC82;">"--indent_width=4"</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
And define a keybind for formatting:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>add-hook 'sql-mode-hook '<span style="color: #93a8c6;">(</span>lambda<span style="color: #b0b1a3;">()</span>
  <span style="color: #b0b1a3;">(</span>define-key sql-mode-map <span style="color: #97b098;">(</span>kbd <span style="color: #EEDC82;">"C-c C-f"</span><span style="color: #97b098;">)</span> 'sqlformat-buffer<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
