content/downloads/emacs/emacs_setup.el

(use-package prettier
  :ensure
  :config)
  (add-hook 'js2-mode-hook 'prettier-mode)
  (add-hook 'json-mode-hook 'prettier-mode)
  (add-hook 'js-mode-hook 'prettier-mode)
  (setq indent-tabs-mode nil js-indent-level 2)
  (add-hook
  'js22-mode-hook
  (lambda ()
  (when (string-match "\.tsx?$" buffer-file-name)
  (setq-local prettier-parsers '(typescript)))))

(use-package js-doc
  :ensure
  :config
  (setq js-doc-mail-address "feng.xia@mycompany.io")
  (setq js-doc-author (format "Feng Xia <%s>" js-doc-mail-address))
  (setq js-doc-url "http://www.mycompany.com")
  (setq js-doc-license "Company License")
)
(add-hook 'js2-mode-hook
          #'(lambda ()
              (define-key js2-mode-map "\C-ci" 'js-doc-insert-function-doc)
              (define-key js2-mode-map "@" 'js-doc-insert-tag)))

(use-package csv-mode
  :ensure t
  :mode "\\.csv\\'")

(use-package json-mode
  :ensure
  :config)

(use-package yaml-mode
  :ensure
  :config)
(add-to-list 'auto-mode-alist '("\\.yml\\'" . yaml-mode))
(add-hook 'yaml-mode-hook
          '(lambda ()
        (define-key yaml-mode-map "\C-m" 'newline-and-indent)))

(use-package jenkinsfile-mode
  :ensure
  :config)
