content/downloads/emacs/emacs_setup.org
*** Microsoft DAX

Load the =dax-mode= by [[https://github.com/fpvmorais/dax-mode/tree/master][github]]:

#+begin_src emacs-lisp
(load "~/.emacs.d/dax-mode/dax-mode.el")
#+end_src


Add a formatter function by the [[https://fpvmorais.com/post/emacs-major-modes-for-power-bi/][blog]]:

#+begin_src emacs-lisp
(defun dax-pretty-print ()
  "Pretty print the DAX buffer via DaxFormatter API."
  (interactive)
  (goto-char (point-min))
  (while (search-forward ";" nil t)
    (replace-match ","))
  (goto-char (point-min))
  (setq payload (make-hash-table))
  (setf (gethash "Dax" payload) `(delete-and-extract-region (point-min) (point-max)))
  (setf (gethash "l" payload) "short")
  (let* (
         (url-request-method "POST")
         (url-request-extra-headers '(("Content-Type" . "application/json")))
         (url-request-data (json-encode `(("Dax" ., (delete-and-extract-region (point-min) (point-max)) ))))
         ;; (url-request-data (json-encode ,payload))
         (buf (current-buffer))
         (newbuff (url-retrieve-synchronously "http://www.daxformatter.com/api/daxformatter/DaxFormat/"))
         )
    (set-buffer newbuff)
    (goto-char (point-min))
    (re-search-forward "^$")
    (delete-region (point) (point-min))
    (setq noQuotes (substring (buffer-string) 1 nil))
    (setq noRN (replace-regexp-in-string "\r\n" "\n" noQuotes))
    (setq noBars (replace-regexp-in-string "\\\\" "" noRN))
    (princ noBars buf)
    (kill-buffer newbuff)
    )
  )
#+end_src

Last, define a keyboard bind for formatting:

#+begin_src emacs-lisp :tangle no

(add-hook dax-mode-hook '(lambda()
  (define-key sql-mode-map (kbd "C-c C-f") 'dax-pretty-print)))

#+end_src

*** Terraform

#+begin_src emacs-lis
  (use-package terraform-mode
    :ensure
    :config)
(add-hook 'terraform-mode-hook #'outline-minor-mode)
(setq terraform-format-on-sav t)
#+end_src

*** Java

Ah, the one language I promised myself not to learn. But finally, I read about
Java and Spring. It's just, that.

#+begin_src emacs-lisp
  (use-package lsp-java
    :after java
    :config
    (add-hook 'java-mode-hook #'lsp))
#+end_src

Some additional packages according to [[https://github.com/emacs-lsp/lsp-java][this]]:

#+begin_src emacs-lisp
  (use-package projectile)
  (use-package flycheck)
  (use-package lsp-mode :hook ((lsp-mode . lsp-enable-which-key-integration)))
  (use-package company)
  (use-package lsp-ui)
  (use-package which-key :config (which-key-mode))
  (use-package dap-mode :after lsp-mode :config (dap-auto-configure-mode))
  (use-package dap-java :ensure nil)
  (use-package lsp-treemacs)
#+end_src

