content/downloads/emacs/emacs_setup.html

<div id="outline-container-org8921601" class="outline-4">
<h4 id="org8921601"><span class="section-number-4">9.10.12</span> Microsoft DAX</h4>
<div class="outline-text-4" id="text-9-10-12">
<p>
Load the <code>dax-mode</code> by <a href="https://github.com/fpvmorais/dax-mode/tree/master">github</a>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>load <span style="color: #EEDC82;">"~/.emacs.d/dax-mode/dax-mode.el"</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Add a formatter function by the <a href="https://fpvmorais.com/post/emacs-major-modes-for-power-bi/">blog</a>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">dax-pretty-print</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #EEDC82;">"Pretty print the DAX buffer via DaxFormatter API."</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">interactive</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>goto-char <span style="color: #b0b1a3;">(</span>point-min<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">while</span> <span style="color: #b0b1a3;">(</span>search-forward <span style="color: #EEDC82;">";"</span> nil t<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span>replace-match <span style="color: #EEDC82;">","</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>goto-char <span style="color: #b0b1a3;">(</span>point-min<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> payload <span style="color: #b0b1a3;">(</span>make-hash-table<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setf</span> <span style="color: #b0b1a3;">(</span>gethash <span style="color: #EEDC82;">"Dax"</span> payload<span style="color: #b0b1a3;">)</span> `<span style="color: #b0b1a3;">(</span>delete-and-extract-region <span style="color: #97b098;">(</span>point-min<span style="color: #97b098;">)</span> <span style="color: #97b098;">(</span>point-max<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setf</span> <span style="color: #b0b1a3;">(</span>gethash <span style="color: #EEDC82;">"l"</span> payload<span style="color: #b0b1a3;">)</span> <span style="color: #EEDC82;">"short"</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">let*</span> <span style="color: #b0b1a3;">(</span>
         <span style="color: #97b098;">(</span>url-request-method <span style="color: #EEDC82;">"POST"</span><span style="color: #97b098;">)</span>
         <span style="color: #97b098;">(</span>url-request-extra-headers '<span style="color: #aebed8;">(</span><span style="color: #b0b0b3;">(</span><span style="color: #EEDC82;">"Content-Type"</span> . <span style="color: #EEDC82;">"application/json"</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
         <span style="color: #97b098;">(</span>url-request-data <span style="color: #aebed8;">(</span>json-encode `<span style="color: #b0b0b3;">(</span><span style="color: #90a890;">(</span><span style="color: #EEDC82;">"Dax"</span> ., <span style="color: #a2b6da;">(</span>delete-and-extract-region <span style="color: #9cb6ad;">(</span>point-min<span style="color: #9cb6ad;">)</span> <span style="color: #9cb6ad;">(</span>point-max<span style="color: #9cb6ad;">)</span><span style="color: #a2b6da;">)</span> <span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
         <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">(url-request-data (json-encode ,payload))</span>
         <span style="color: #97b098;">(</span>buf <span style="color: #aebed8;">(</span>current-buffer<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
         <span style="color: #97b098;">(</span>newbuff <span style="color: #aebed8;">(</span>url-retrieve-synchronously <span style="color: #EEDC82;">"http://www.daxformatter.com/api/daxformatter/DaxFormat/"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
         <span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span>set-buffer newbuff<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span>goto-char <span style="color: #97b098;">(</span>point-min<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span>re-search-forward <span style="color: #EEDC82;">"^$"</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span>delete-region <span style="color: #97b098;">(</span>point<span style="color: #97b098;">)</span> <span style="color: #97b098;">(</span>point-min<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">setq</span> noQuotes <span style="color: #97b098;">(</span>substring <span style="color: #aebed8;">(</span>buffer-string<span style="color: #aebed8;">)</span> 1 nil<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">setq</span> noRN <span style="color: #97b098;">(</span>replace-regexp-in-string <span style="color: #EEDC82;">"\r\n"</span> <span style="color: #EEDC82;">"\n"</span> noQuotes<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">setq</span> noBars <span style="color: #97b098;">(</span>replace-regexp-in-string <span style="color: #EEDC82;">"\\\\"</span> <span style="color: #EEDC82;">""</span> noRN<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span>princ noBars buf<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span>kill-buffer newbuff<span style="color: #b0b1a3;">)</span>
    <span style="color: #93a8c6;">)</span>
  <span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
Last, define a keyboard bind for formatting:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #8c8c8c;">(</span>add-hook dax-mode-hook '<span style="color: #93a8c6;">(</span>lambda<span style="color: #b0b1a3;">()</span>
  <span style="color: #b0b1a3;">(</span>define-key sql-mode-map <span style="color: #97b098;">(</span>kbd <span style="color: #EEDC82;">"C-c C-f"</span><span style="color: #97b098;">)</span> 'dax-pretty-print<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org3712e97" class="outline-4">
<h4 id="org3712e97"><span class="section-number-4">9.10.13</span> Terraform</h4>
<div class="outline-text-4" id="text-9-10-13">
<div class="org-src-container">
<pre class="src src-emacs-lis">  (use-package terraform-mode
    :ensure
    :config)
(add-hook 'terraform-mode-hook #'outline-minor-mode)
(setq terraform-format-on-sav t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org97134b5" class="outline-4">
<h4 id="org97134b5"><span class="section-number-4">9.10.14</span> Java</h4>
<div class="outline-text-4" id="text-9-10-14">
<p>
Ah, the one language I promised myself not to learn. But finally, I read about
Java and Spring. It's just, that.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">lsp-java</span>
  <span style="color: #FF80F4;">:after</span> java
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span>add-hook 'java-mode-hook #'lsp<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
Some additional packages according to <a href="https://github.com/emacs-lsp/lsp-java">this</a>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">projectile</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">flycheck</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">lsp-mode</span> <span style="color: #FF80F4;">:hook</span> <span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span>lsp-mode . lsp-enable-which-key-integration<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">company</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">lsp-ui</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">which-key</span> <span style="color: #FF80F4;">:config</span> <span style="color: #93a8c6;">(</span>which-key-mode<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">dap-mode</span> <span style="color: #FF80F4;">:after</span> lsp-mode <span style="color: #FF80F4;">:config</span> <span style="color: #93a8c6;">(</span>dap-auto-configure-mode<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">dap-java</span> <span style="color: #FF80F4;">:ensure</span> nil<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">lsp-treemacs</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>

<ol class="org-ol">
