content/downloads/emacs/emacs_setup.html
<li><a id="org2800b62"></a>lombok<br />
<div class="outline-text-5" id="text-9-10-14-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8C8C8C;">;;; </span><span style="color: #696969; font-style: italic;">lsp-java-lombok.el --- Description -*- lexical-binding: t; -*-</span>
<span style="color: #8C8C8C;">;;</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Copyright (C) 2021 Kevin Ziegler</span>
<span style="color: #8C8C8C;">;;</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Author: Kevin Ziegler <a href="https://github.com/kevinziegler">&lt;https://github.com/kevinziegler&gt;</a></span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Maintainer: Kevin Ziegler</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Created: February 12, 2021</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Modified: February 12, 2021</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Version: 0.0.1</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Homepage: https://github.com/kevinziegler/lsp-java-lombok</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Package-Requires: ((emacs "24.3"))</span>
<span style="color: #8C8C8C;">;;</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">This file is not part of GNU Emacs.</span>
<span style="color: #8C8C8C;">;;</span>
<span style="color: #8C8C8C;">;;; </span><span style="color: #696969; font-style: italic;">Commentary:</span>
<span style="color: #8C8C8C;">;;  </span><span style="color: #696969; font-style: italic;">Helper library for setting up Lombok with LSP-java</span>
<span style="color: #8C8C8C;">;;</span>
<span style="color: #8C8C8C;">;;; </span><span style="color: #696969; font-style: italic;">Code:</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">require</span> '<span style="color: #FF80F4;">lsp-java</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">lsp-java-lombok/enabled</span> nil
  <span style="color: #EEDC82;">"Indicates the LSP server should be started with Lombok."</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">lsp-java-lombok/version</span> nil
  <span style="color: #EEDC82;">"When non-nil, use the specified Lombok version, otherwise use the latest."</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">lsp-java-lombok/jar-url-base</span> <span style="color: #EEDC82;">"https://projectlombok.org/downloads/"</span>
  <span style="color: #EEDC82;">"The base path to download Lombok jars from."</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">lsp-java-lombok/dir</span> user-emacs-directory
  <span style="color: #EEDC82;">"The path on disk where lombok jars are saved."</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">lsp-java-lombok/jar-file</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #EEDC82;">"Get the filename for the Lombok jar."</span>
  <span style="color: #93a8c6;">(</span>concat <span style="color: #EEDC82;">"lombok"</span>
          <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">when</span> lsp-java-lombok/version <span style="color: #EEDC82;">"-"</span><span style="color: #b0b1a3;">)</span>
          lsp-java-lombok/version
          <span style="color: #EEDC82;">".jar"</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">lsp-java-lombok/jar-path</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #EEDC82;">"Generate the path on disk for the Lombok jar."</span>
  <span style="color: #93a8c6;">(</span>concat user-emacs-directory <span style="color: #b0b1a3;">(</span>lsp-java-lombok/jar-file<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">lsp-java-lombok/download-jar</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #EEDC82;">"Download the latest lombok jar for use with LSP."</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">let*</span> <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>lombok-url <span style="color: #aebed8;">(</span>url-generic-parse-url lsp-java-lombok/jar-url-base<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
         <span style="color: #97b098;">(</span>base-path <span style="color: #aebed8;">(</span>file-name-as-directory <span style="color: #b0b0b3;">(</span>url-filename lombok-url<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
         <span style="color: #97b098;">(</span>file-path <span style="color: #aebed8;">(</span>concat base-path <span style="color: #b0b0b3;">(</span>lsp-java-lombok/jar-file<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">setf</span> <span style="color: #97b098;">(</span>url-filename lombok-url<span style="color: #97b098;">)</span> file-path<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span>url-copy-file lombok-url <span style="color: #97b098;">(</span>lsp-java-lombok/jar-path<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">lsp-java-lombok/append-vmargs</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #EEDC82;">"Apply lombok args to lsp-java-vmargs."</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> lsp-java-vmargs
        <span style="color: #b0b1a3;">(</span>append lsp-java-vmargs
                <span style="color: #97b098;">(</span>concat <span style="color: #EEDC82;">"-javaagent:"</span> <span style="color: #aebed8;">(</span>lsp-java-lombok/jar-path<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">lsp-java-lombok/setup</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #EEDC82;">"Download Lombok if it hasn't been downloaded already."</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">when</span> <span style="color: #b0b1a3;">(</span>not <span style="color: #97b098;">(</span>file-exists-p <span style="color: #aebed8;">(</span>lsp-java-lombok/jar-path<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span>message <span style="color: #EEDC82;">"Could not find lombok for lsp-java.  Downloading..."</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span>lsp-java-lombok/download-jar<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">lsp-java-lombok/init</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #EEDC82;">"Initialize lsp-java-lombok."</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">when</span> lsp-java-lombok/enabled
    <span style="color: #b0b1a3;">(</span>lsp-java-lombok/setup<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span>lsp-java-lombok/append-vmargs<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">provide</span> '<span style="color: #FF80F4;">lsp-java-lombok</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8C8C8C;">;;; </span><span style="color: #696969; font-style: italic;">lsp-java-lombok.el ends here</span>

</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
