content/downloads/emacs/emacs_setup.org
** LAST: enforce my tab style

Found this [[https://github.com/syl20bnr/spacemacs/issues/5923][here]], and I like it, to set my styles in a central
location. This was researched while battling the .js tab level. I
don't want to use the =customize= way since that will be a hidden
manual step after a fresh install.

First, define a func to include my indent settings. It takes an input
argument:

#+BEGIN_SRC emacs-lisp
    (defun my-setup-indent (n)
      ;; java/c/c++
      (setq-local standard-indent n)
      (setq-local c-basic-offset n)

      ;; javascript family
      (setq-local javascript-indent-level n) ; javascript-mode
      (setq-local js-indent-level n) ; js-mode
      (setq-local js2-basic-offset n) ; js2-mode
      (setq-local js-switch-indent-offset n) ; js-mode
      (setq-local javascript-indent-level n) ; javacript-mode
      (setq-local react-indent-level n) ; react-mode
      (setq-local js2-basic-offset n)

      ;; html, css
      (setq-local web-mode-attr-indent-offset n) ; web-mode
      (setq-local web-mode-code-indent-offset n) ; web-mode, js code in html file
      (setq-local web-mode-css-indent-offset n) ; web-mode, css in html file
      (setq-local web-mode-markup-indent-offset n) ; web-mode, html tag in html file
      (setq-local web-mode-sql-indent-offset n) ; web-mode
      (setq-local web-mode-attr-value-indent-offset n) ; web-mode
      (setq web-mode-comment-style 2) ;; web-mode
      (setq-local css-indent-offset n) ; css-mode

      ;; shells
      (setq-local sh-basic-offset n) ; shell scripts
      (setq-local sh-indentation n))
#+END_SRC


Now set the tabs:

#+BEGIN_SRC emacs-lisp
  (defun my-personal-code-style ()
    (interactive)
    (message "My personal code style!")
    ;; use space instead of tab
    (setq indent-tabs-mode nil)
    ;; indent 2 spaces width
    (my-setup-indent 2))

  ;; it would be lovely if this was enough, but it gets stomped on by modes.
  (my-personal-code-style)
#+END_SRC


So, to enfore this on some modes:
#+BEGIN_SRC emacs-lisp
  (add-hook 'css-mode-hook 'my-personal-code-style)
  (add-hook 'js2-mode-hook 'my-personal-code-style)
  (add-hook 'react-mode-hook 'my-personal-code-style)
  (add-hook 'sh-mode-hook 'my-personal-code-style)
  (add-hook 'groovy-mode-hook 'my-personal-code-style)
#+END_SRC

* Buffers

There are three concepts seem to me: desktop, window config, and buffers.

- desktop: is like virtual desktop, and you can have many, like i3.
- window config: think of it like a look you have created using
  buffers, eg. stack them this way or that way, on the same
  desktop. So switching a window config will switch the buffer layout
  within your current desktop.
- buffer: is the building block.

** by packages
*** multi desktops: eyebrowse

Awesome window manager. It's like using i3m but inside emacs. Use the
=C-c C-w <0..9>= key to switch to so called desktop. On each desktop,
you can have different buffers open and so on, so I don't have to
close buffers, or =C-x b= a lot anymore. Look for details [[https://depp.brause.cc/eyebrowse/][here]].

#+BEGIN_SRC emacs-lisp
  (use-package eyebrowse
    :ensure t)
(eyebrowse-mode t)
#+END_SRC

