content/downloads/emacs/emacs_setup.html

<div id="outline-container-org89a338f" class="outline-3">
<h3 id="org89a338f"><span class="section-number-3">9.11</span> LAST: enforce my tab style</h3>
<div class="outline-text-3" id="text-9-11">
<p>
Found this <a href="https://github.com/syl20bnr/spacemacs/issues/5923">here</a>, and I like it, to set my styles in a central
location. This was researched while battling the .js tab level. I
don't want to use the <code>customize</code> way since that will be a hidden
manual step after a fresh install.
</p>

<p>
First, define a func to include my indent settings. It takes an input
argument:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">my-setup-indent</span> <span style="color: #93a8c6;">(</span>n<span style="color: #93a8c6;">)</span>
  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">java/c/c++</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq-local</span> standard-indent n<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq-local</span> c-basic-offset n<span style="color: #93a8c6;">)</span>

  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">javascript family</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq-local</span> javascript-indent-level n<span style="color: #93a8c6;">)</span> <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">javascript-mode</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq-local</span> js-indent-level n<span style="color: #93a8c6;">)</span> <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">js-mode</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq-local</span> js2-basic-offset n<span style="color: #93a8c6;">)</span> <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">js2-mode</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq-local</span> js-switch-indent-offset n<span style="color: #93a8c6;">)</span> <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">js-mode</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq-local</span> javascript-indent-level n<span style="color: #93a8c6;">)</span> <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">javacript-mode</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq-local</span> react-indent-level n<span style="color: #93a8c6;">)</span> <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">react-mode</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq-local</span> js2-basic-offset n<span style="color: #93a8c6;">)</span>

  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">html, css</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq-local</span> web-mode-attr-indent-offset n<span style="color: #93a8c6;">)</span> <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">web-mode</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq-local</span> web-mode-code-indent-offset n<span style="color: #93a8c6;">)</span> <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">web-mode, js code in html file</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq-local</span> web-mode-css-indent-offset n<span style="color: #93a8c6;">)</span> <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">web-mode, css in html file</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq-local</span> web-mode-markup-indent-offset n<span style="color: #93a8c6;">)</span> <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">web-mode, html tag in html file</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq-local</span> web-mode-sql-indent-offset n<span style="color: #93a8c6;">)</span> <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">web-mode</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq-local</span> web-mode-attr-value-indent-offset n<span style="color: #93a8c6;">)</span> <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">web-mode</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> web-mode-comment-style 2<span style="color: #93a8c6;">)</span> <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">web-mode</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq-local</span> css-indent-offset n<span style="color: #93a8c6;">)</span> <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">css-mode</span>

  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">shells</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq-local</span> sh-basic-offset n<span style="color: #93a8c6;">)</span> <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">shell scripts</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq-local</span> sh-indentation n<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Now set the tabs:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">my-personal-code-style</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">interactive</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>message <span style="color: #EEDC82;">"My personal code style!"</span><span style="color: #93a8c6;">)</span>
  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">use space instead of tab</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> indent-tabs-mode nil<span style="color: #93a8c6;">)</span>
  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">indent 2 spaces width</span>
  <span style="color: #93a8c6;">(</span>my-setup-indent 2<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">it would be lovely if this was enough, but it gets stomped on by modes.</span>
<span style="color: #8c8c8c;">(</span>my-personal-code-style<span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
So, to enfore this on some modes:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>add-hook 'css-mode-hook 'my-personal-code-style<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'js2-mode-hook 'my-personal-code-style<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'react-mode-hook 'my-personal-code-style<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'sh-mode-hook 'my-personal-code-style<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'groovy-mode-hook 'my-personal-code-style<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org85083e4" class="outline-2">
<h2 id="org85083e4"><span class="section-number-2">10</span> Buffers</h2>
<div class="outline-text-2" id="text-10">
<p>
There are three concepts seem to me: desktop, window config, and buffers.
</p>

<ul class="org-ul">
<li>desktop: is like virtual desktop, and you can have many, like i3.</li>
<li>window config: think of it like a look you have created using
buffers, eg. stack them this way or that way, on the same
desktop. So switching a window config will switch the buffer layout
within your current desktop.</li>
<li>buffer: is the building block.</li>
</ul>
</div>

<div id="outline-container-org5d4f00a" class="outline-3">
<h3 id="org5d4f00a"><span class="section-number-3">10.1</span> by packages</h3>
<div class="outline-text-3" id="text-10-1">
</div>
<div id="outline-container-org511cffa" class="outline-4">
<h4 id="org511cffa"><span class="section-number-4">10.1.1</span> multi desktops: eyebrowse</h4>
<div class="outline-text-4" id="text-10-1-1">
<p>
Awesome window manager. It's like using i3m but inside emacs. Use the
<code>C-c C-w &lt;0..9&gt;</code> key to switch to so called desktop. On each desktop,
you can have different buffers open and so on, so I don't have to
close buffers, or <code>C-x b</code> a lot anymore. Look for details <a href="https://depp.brause.cc/eyebrowse/">here</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">eyebrowse</span>
    <span style="color: #FF80F4;">:ensure</span> t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>eyebrowse-mode t<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
