content/downloads/emacs/emacs_setup.el

(defun my-setup-indent (n)
  ;; java/c/c++
  (setq-local standard-indent n)
  (setq-local c-basic-offset n)

  ;; javascript family
  (setq-local javascript-indent-level n) ; javascript-mode
  (setq-local js-indent-level n) ; js-mode
  (setq-local js2-basic-offset n) ; js2-mode
  (setq-local js-switch-indent-offset n) ; js-mode
  (setq-local javascript-indent-level n) ; javacript-mode
  (setq-local react-indent-level n) ; react-mode
  (setq-local js2-basic-offset n)

  ;; html, css
  (setq-local web-mode-attr-indent-offset n) ; web-mode
  (setq-local web-mode-code-indent-offset n) ; web-mode, js code in html file
  (setq-local web-mode-css-indent-offset n) ; web-mode, css in html file
  (setq-local web-mode-markup-indent-offset n) ; web-mode, html tag in html file
  (setq-local web-mode-sql-indent-offset n) ; web-mode
  (setq-local web-mode-attr-value-indent-offset n) ; web-mode
  (setq web-mode-comment-style 2) ;; web-mode
  (setq-local css-indent-offset n) ; css-mode

  ;; shells
  (setq-local sh-basic-offset n) ; shell scripts
  (setq-local sh-indentation n))

(defun my-personal-code-style ()
  (interactive)
  (message "My personal code style!")
  ;; use space instead of tab
  (setq indent-tabs-mode nil)
  ;; indent 2 spaces width
  (my-setup-indent 2))

;; it would be lovely if this was enough, but it gets stomped on by modes.
(my-personal-code-style)

(add-hook 'css-mode-hook 'my-personal-code-style)
(add-hook 'js2-mode-hook 'my-personal-code-style)
(add-hook 'react-mode-hook 'my-personal-code-style)
(add-hook 'sh-mode-hook 'my-personal-code-style)
(add-hook 'groovy-mode-hook 'my-personal-code-style)

(use-package eyebrowse
    :ensure t)
(eyebrowse-mode t)
