content/downloads/emacs/emacs_setup.org
*** select buffer

#+BEGIN_SRC emacs-lisp
  (use-package ace-window
    :ensure
    :config
    (setq aw-ignore-current t)
    (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
    (setq aw-minibuffer-flag nil)
    (setq aw-background t)
    (global-set-key (kbd "C-x C-o") 'ace-window)
    (custom-set-faces
     '(aw-leading-char-face
       ((t (:inherit ace-jump-face-foreground
       :foreground "#D52349"
       :height 1000
       :overline t
       :box nil)))))
  )
#+END_SRC


#+RESULTS:
: t

*** buffer naming
#+BEGIN_SRC emacs-lisp
(use-package uniquify
  :init
  (setq uniquify-buffer-name-style 'post-forward-angle-brackets))
#+END_SRC

** save & restore buffers

First, you need to create a folder =~/.emacs.d/savehist=. If not, upon
existing emacs, it will complain, asking you whether you want to
=ignore= it, answer =yes= will be fine. No harm. It's just the session
will not then be saved.


#+BEGIN_SRC emacs-lisp

  (setq desktop-path (list "~/.emacs.d/savehist"))
  (setq desktop-dirname "~/.emacs.d/savehist")
  (setq desktop-restore-eager 5)
  (setq desktop-load-locked-desktop t)
  (desktop-save-mode 1)

    (setq history-length t)
  (setq history-delete-duplicates t)
  (setq savehist-save-minibuffer-history 1)
  (setq savehist-additional-variables '(kill-ring search-ring regexp-search-ring))

#+END_SRC


But skip the followings:
#+BEGIN_SRC emacs-lisp
  (setq desktop-buffers-not-to-save
       (concat "\\("
               "^nn\\.a[0-9]+\\|\\.log\\|(ftp)\\|^tags\\|^TAGS"
               "\\|\\.emacs.*\\|\\.diary\\|\\.newsrc-dribble\\|\\.bbdb"
               "\\)$"))
  (add-to-list 'desktop-modes-not-to-save 'dired-mode)
  (add-to-list 'desktop-modes-not-to-save 'Info-mode)
  (add-to-list 'desktop-modes-not-to-save 'info-lookup-mode)
  (add-to-list 'desktop-modes-not-to-save 'fundamental-mode)
#+END_SRC


See [[https://github.com/thierryvolpiatto/psession][here]]:

#+BEGIN_SRC emacs-lisp
  (use-package psession
    :ensure)
  (psession-mode 1)
  (psession-savehist-mode 1)
  (psession-autosave-mode 1)
#+END_SRC

** switch window config: winner-mode

Read [[https://www.emacswiki.org/emacs/WinnerMode][here]]. A config is essentially a look of buffers, and there can be
many, say, a config has two windows side by side, while another is 3
stacked. This mode will let you switch between them on the same desktop.

Enables =winner-mode=. Navigate buffer-window configs with =C-c left= and
=C-c right=.

#+BEGIN_SRC emacs-lisp :tangle no
  (winner-mode 1)
#+END_SRC


However, with eyebrowse, I think this is redundant function. Maybe I should skip
this?

** toggle maximize buffer

Temporarily maximize a buffer.  [[https://gist.github.com/mads379/3402786][found here]]

#+BEGIN_SRC emacs-lisp
(defun toggle-maximize-buffer () "Maximize buffer"
  (interactive)
  (if (= 1 (length (window-list)))
      (jump-to-register '_)
    (progn
      (window-configuration-to-register '_)
      (delete-other-windows))))
#+END_SRC


Map it to a key.

#+BEGIN_SRC emacs-lisp
  (global-set-key [M-f8] 'toggle-maximize-buffer)
#+END_SRC

