content/downloads/emacs/emacs_setup.html

<div id="outline-container-org931516d" class="outline-4">
<h4 id="org931516d"><span class="section-number-4">10.1.2</span> select buffer</h4>
<div class="outline-text-4" id="text-10-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">ace-window</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> aw-ignore-current t<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> aw-keys '<span style="color: #b0b1a3;">(</span>?a ?s ?d ?f ?g ?h ?j ?k ?l<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> aw-minibuffer-flag nil<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> aw-background t<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>global-set-key <span style="color: #b0b1a3;">(</span>kbd <span style="color: #EEDC82;">"C-x C-o"</span><span style="color: #b0b1a3;">)</span> 'ace-window<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>custom-set-faces
   '<span style="color: #b0b1a3;">(</span>aw-leading-char-face
     <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>t <span style="color: #b0b0b3;">(</span><span style="color: #FF80F4;">:inherit</span> ace-jump-face-foreground
     <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"#D52349"</span>
     <span style="color: #FF80F4;">:height</span> 1000
     <span style="color: #FF80F4;">:overline</span> t
     <span style="color: #FF80F4;">:box</span> nil<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbfc7ec0" class="outline-4">
<h4 id="orgbfc7ec0"><span class="section-number-4">10.1.3</span> buffer naming</h4>
<div class="outline-text-4" id="text-10-1-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">uniquify</span>
  <span style="color: #FF80F4;">:init</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> uniquify-buffer-name-style 'post-forward-angle-brackets<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcd5071a" class="outline-3">
<h3 id="orgcd5071a"><span class="section-number-3">10.2</span> save &amp; restore buffers</h3>
<div class="outline-text-3" id="text-10-2">
<p>
First, you need to create a folder <code>~/.emacs.d/savehist</code>. If not, upon
existing emacs, it will complain, asking you whether you want to
<code>ignore</code> it, answer <code>yes</code> will be fine. No harm. It's just the session
will not then be saved.
</p>


<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> desktop-path <span style="color: #93a8c6;">(</span>list <span style="color: #EEDC82;">"~/.emacs.d/savehist"</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> desktop-dirname <span style="color: #EEDC82;">"~/.emacs.d/savehist"</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> desktop-restore-eager 5<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> desktop-load-locked-desktop t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>desktop-save-mode 1<span style="color: #8c8c8c;">)</span>

  <span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> history-length t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> history-delete-duplicates t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> savehist-save-minibuffer-history 1<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> savehist-additional-variables '<span style="color: #93a8c6;">(</span>kill-ring search-ring regexp-search-ring<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

</pre>
</div>


<p>
But skip the followings:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> desktop-buffers-not-to-save
     <span style="color: #93a8c6;">(</span>concat <span style="color: #EEDC82;">"</span><span style="color: #A63A62;">\\</span><span style="color: #A63A62;">(</span><span style="color: #EEDC82;">"</span>
             <span style="color: #EEDC82;">"^nn\\.a[0-9]+</span><span style="color: #A63A62;">\\</span><span style="color: #A63A62;">|</span><span style="color: #EEDC82;">\\.log</span><span style="color: #A63A62;">\\</span><span style="color: #A63A62;">|</span><span style="color: #EEDC82;">(ftp)</span><span style="color: #A63A62;">\\</span><span style="color: #A63A62;">|</span><span style="color: #EEDC82;">^tags</span><span style="color: #A63A62;">\\</span><span style="color: #A63A62;">|</span><span style="color: #EEDC82;">^TAGS"</span>
             <span style="color: #EEDC82;">"</span><span style="color: #A63A62;">\\</span><span style="color: #A63A62;">|</span><span style="color: #EEDC82;">\\.emacs.*</span><span style="color: #A63A62;">\\</span><span style="color: #A63A62;">|</span><span style="color: #EEDC82;">\\.diary</span><span style="color: #A63A62;">\\</span><span style="color: #A63A62;">|</span><span style="color: #EEDC82;">\\.newsrc-dribble</span><span style="color: #A63A62;">\\</span><span style="color: #A63A62;">|</span><span style="color: #EEDC82;">\\.bbdb"</span>
             <span style="color: #EEDC82;">"</span><span style="color: #A63A62;">\\</span><span style="color: #A63A62;">)</span><span style="color: #EEDC82;">$"</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-to-list 'desktop-modes-not-to-save 'dired-mode<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-to-list 'desktop-modes-not-to-save 'Info-mode<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-to-list 'desktop-modes-not-to-save 'info-lookup-mode<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-to-list 'desktop-modes-not-to-save 'fundamental-mode<span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
See <a href="https://github.com/thierryvolpiatto/psession">here</a>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">psession</span>
  <span style="color: #FF80F4;">:ensure</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>psession-mode 1<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>psession-savehist-mode 1<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>psession-autosave-mode 1<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6472802" class="outline-3">
<h3 id="org6472802"><span class="section-number-3">10.3</span> switch window config: winner-mode</h3>
<div class="outline-text-3" id="text-10-3">
<p>
Read <a href="https://www.emacswiki.org/emacs/WinnerMode">here</a>. A config is essentially a look of buffers, and there can be
many, say, a config has two windows side by side, while another is 3
stacked. This mode will let you switch between them on the same desktop.
</p>

<p>
Enables <code>winner-mode</code>. Navigate buffer-window configs with <code>C-c left</code> and
<code>C-c right</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>winner-mode 1<span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
However, with eyebrowse, I think this is redundant function. Maybe I should skip
this?
</p>
</div>
</div>

<div id="outline-container-orgaf585fb" class="outline-3">
<h3 id="orgaf585fb"><span class="section-number-3">10.4</span> toggle maximize buffer</h3>
<div class="outline-text-3" id="text-10-4">
<p>
Temporarily maximize a buffer.  <a href="https://gist.github.com/mads379/3402786">found here</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">toggle-maximize-buffer</span> <span style="color: #93a8c6;">()</span> <span style="color: #EEDC82;">"Maximize buffer"</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">interactive</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">if</span> <span style="color: #b0b1a3;">(</span>= 1 <span style="color: #97b098;">(</span>length <span style="color: #aebed8;">(</span>window-list<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
      <span style="color: #b0b1a3;">(</span>jump-to-register '_<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">progn</span>
      <span style="color: #97b098;">(</span>window-configuration-to-register '_<span style="color: #97b098;">)</span>
      <span style="color: #97b098;">(</span>delete-other-windows<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Map it to a key.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #93a8c6;">[</span>M-f8<span style="color: #93a8c6;">]</span> 'toggle-maximize-buffer<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
