content/downloads/emacs/emacs_setup.org
** buffer decorations
Setup the visual cues about the current editing buffer
#+BEGIN_SRC emacs-lisp
  (column-number-mode t)
  (setq visible-bell t)
  (setq scroll-step 1)
  (setq-default transient-mark-mode t)  ;; highlight selection
#+END_SRC

* Editing

The heart of editor is, well, editing. Many things are determining the
experience. Here are the ones I use to make editing quicker, easier,
less typing essentially.

** by packages
*** auto company

A good auto completion thing. See details [[https://company-mode.github.io/][here]].

#+BEGIN_SRC emacs-lisp
(use-package company
  :ensure t
  :config)
(add-hook 'prog-mode-hook 'global-company-mode)
#+END_SRC

*** undo tree

More [[https://elpa.gnu.org/packages/undo-tree.html][undos]]?

#+BEGIN_SRC emacs-lisp :tangle no
    ;; (use-package undo-tree
    ;;   :ensure t
    ;;   :config
    ;;   (setq undo-tree-visualizer-timestamps t)
    ;;   (setq undo-tree-visualizer-diff t))
    ;; (global-undo-tree-mode)

  (use-package undo-tree
    :defer t
    :diminish undo-tree-mode
    :init (global-undo-tree-mode)
    :custom
    (undo-tree-visualizer-diff t)
    (undo-tree-history-directory-alist '(("." . "~/.emacs.d/undo")))
    (undo-tree-visualizer-timestamps t))
#+END_SRC

*** search & jump
**** ag
Use the silversearcher.
#+BEGIN_SRC emacs-lisp
  (use-package ag
    :ensure
    :config
    (setq ag-highlight-search t)
    (setq ag-reuse-buffers t))
#+END_SRC


Follow the [[https://github.com/emacsorphanage/helm-ag][helm-ag manual]], "Insert thing at point as default search
pattern, if this value is non nil":

#+BEGIN_SRC emacs-lisp
  (setq helm-ag-insert-at-point 'symbol)
  (setq helm-ag-use-temp-buffer t)
#+END_SRC

**** dumb-jump

First, let's make sure we have =xref= because we will hook into the
xref backend:

#+BEGIN_SRC emacs-lisp
  (use-package xref
    :ensure
    :config)
#+END_SRC


Now install =dumb-jump=:

#+BEGIN_SRC emacs-lisp
  (use-package dumb-jump
    :ensure
    :config
    (setq dumb-jump-prefer-searcher 'ag))
#+END_SRC


Some hydra:
#+BEGIN_SRC emacs-lisp
(defhydra dumb-jump-hydra (:color blue :columns 3)
    "Dumb Jump"
    ("j" dumb-jump-go "Go")
    ("o" dumb-jump-go-other-window "Other window")
    ("e" dumb-jump-go-prefer-external "Go external")
    ("x" dumb-jump-go-prefer-external-other-window "Go external other window")
    ("i" dumb-jump-go-prompt "Prompt")
    ("l" dumb-jump-quick-look "Quick look")
    ("b" dumb-jump-back "Back"))
#+END_SRC


Last, hook to =xref= to use =M.= bind:

#+BEGIN_SRC emacs-lisp
  (add-hook 'xref-backend-functions #'dumb-jump-xref-activate)
#+END_SRC

**** ripgrep
This enables searching recursively in projects.

#+BEGIN_SRC emacs-lisp
  (use-package ripgrep
    :ensure t)
  (use-package projectile-ripgrep
    :ensure t
    :requires (ripgrep projectile))
#+END_SRC

*** max 80 cols wide
#+BEGIN_SRC emacs-lisp
  (use-package column-enforce-mode
    :ensure t
    :config
    (setq column-enforce-column 80)
    :bind ("C-c m" . 'column-enforce-mode))
  ;; column-enforce-face
#+END_SRC

