content/downloads/emacs/emacs_setup.html

<div id="outline-container-orge24969e" class="outline-3">
<h3 id="orge24969e"><span class="section-number-3">10.5</span> buffer decorations</h3>
<div class="outline-text-3" id="text-10-5">
<p>
Setup the visual cues about the current editing buffer
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>column-number-mode t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> visible-bell t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> scroll-step 1<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq-default</span> transient-mark-mode t<span style="color: #8c8c8c;">)</span>  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">highlight selection</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org32403aa" class="outline-2">
<h2 id="org32403aa"><span class="section-number-2">11</span> Editing</h2>
<div class="outline-text-2" id="text-11">
<p>
The heart of editor is, well, editing. Many things are determining the
experience. Here are the ones I use to make editing quicker, easier,
less typing essentially.
</p>
</div>

<div id="outline-container-org964cb45" class="outline-3">
<h3 id="org964cb45"><span class="section-number-3">11.1</span> by packages</h3>
<div class="outline-text-3" id="text-11-1">
</div>
<div id="outline-container-orga3d53c0" class="outline-4">
<h4 id="orga3d53c0"><span class="section-number-4">11.1.1</span> auto company</h4>
<div class="outline-text-4" id="text-11-1-1">
<p>
A good auto completion thing. See details <a href="https://company-mode.github.io/">here</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">company</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'prog-mode-hook 'global-company-mode<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2bd6d66" class="outline-4">
<h4 id="org2bd6d66"><span class="section-number-4">11.1.2</span> undo tree</h4>
<div class="outline-text-4" id="text-11-1-2">
<p>
More <a href="https://elpa.gnu.org/packages/undo-tree.html">undos</a>?
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">(use-package undo-tree</span>
  <span style="color: #8C8C8C;">;;   </span><span style="color: #696969; font-style: italic;">:ensure t</span>
  <span style="color: #8C8C8C;">;;   </span><span style="color: #696969; font-style: italic;">:config</span>
  <span style="color: #8C8C8C;">;;   </span><span style="color: #696969; font-style: italic;">(setq undo-tree-visualizer-timestamps t)</span>
  <span style="color: #8C8C8C;">;;   </span><span style="color: #696969; font-style: italic;">(setq undo-tree-visualizer-diff t))</span>
  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">(global-undo-tree-mode)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">undo-tree</span>
  <span style="color: #FF80F4;">:defer</span> t
  <span style="color: #FF80F4;">:diminish</span> undo-tree-mode
  <span style="color: #FF80F4;">:init</span> <span style="color: #93a8c6;">(</span>global-undo-tree-mode<span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:custom</span>
  <span style="color: #93a8c6;">(</span>undo-tree-visualizer-diff t<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>undo-tree-history-directory-alist '<span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span><span style="color: #EEDC82;">"."</span> . <span style="color: #EEDC82;">"~/.emacs.d/undo"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>undo-tree-visualizer-timestamps t<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org79e098d" class="outline-4">
<h4 id="org79e098d"><span class="section-number-4">11.1.3</span> search &amp; jump</h4>
<div class="outline-text-4" id="text-11-1-3">
</div>
<ol class="org-ol">
<li><a id="org4777c11"></a>ag<br />
<div class="outline-text-5" id="text-11-1-3-1">
<p>
Use the silversearcher.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">ag</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> ag-highlight-search t<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> ag-reuse-buffers t<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Follow the <a href="https://github.com/emacsorphanage/helm-ag">helm-ag manual</a>, "Insert thing at point as default search
pattern, if this value is non nil":
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> helm-ag-insert-at-point 'symbol<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> helm-ag-use-temp-buffer t<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orge20f0ec"></a>dumb-jump<br />
<div class="outline-text-5" id="text-11-1-3-2">
<p>
First, let's make sure we have <code>xref</code> because we will hook into the
xref backend:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">xref</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Now install <code>dumb-jump</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">dumb-jump</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> dumb-jump-prefer-searcher 'ag<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Some hydra:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defhydra</span> dumb-jump-hydra <span style="color: #93a8c6;">(</span><span style="color: #FF80F4;">:color</span> blue <span style="color: #FF80F4;">:columns</span> 3<span style="color: #93a8c6;">)</span>
    <span style="color: #EEDC82;">"Dumb Jump"</span>
    <span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"j"</span> dumb-jump-go <span style="color: #EEDC82;">"Go"</span><span style="color: #93a8c6;">)</span>
    <span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"o"</span> dumb-jump-go-other-window <span style="color: #EEDC82;">"Other window"</span><span style="color: #93a8c6;">)</span>
    <span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"e"</span> dumb-jump-go-prefer-external <span style="color: #EEDC82;">"Go external"</span><span style="color: #93a8c6;">)</span>
    <span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"x"</span> dumb-jump-go-prefer-external-other-window <span style="color: #EEDC82;">"Go external other window"</span><span style="color: #93a8c6;">)</span>
    <span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"i"</span> dumb-jump-go-prompt <span style="color: #EEDC82;">"Prompt"</span><span style="color: #93a8c6;">)</span>
    <span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"l"</span> dumb-jump-quick-look <span style="color: #EEDC82;">"Quick look"</span><span style="color: #93a8c6;">)</span>
    <span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"b"</span> dumb-jump-back <span style="color: #EEDC82;">"Back"</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Last, hook to <code>xref</code> to use <code>M.</code> bind:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>add-hook 'xref-backend-functions #'dumb-jump-xref-activate<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org695dd9f"></a>ripgrep<br />
<div class="outline-text-5" id="text-11-1-3-3">
<p>
This enables searching recursively in projects.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">ripgrep</span>
  <span style="color: #FF80F4;">:ensure</span> t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">projectile-ripgrep</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:requires</span> <span style="color: #93a8c6;">(</span>ripgrep projectile<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org781adf2" class="outline-4">
<h4 id="org781adf2"><span class="section-number-4">11.1.4</span> max 80 cols wide</h4>
<div class="outline-text-4" id="text-11-1-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">column-enforce-mode</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> column-enforce-column 80<span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:bind</span> <span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"C-c m"</span> . 'column-enforce-mode<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">column-enforce-face</span>
</pre>
</div>
</div>
</div>
