content/downloads/emacs/emacs_setup.el

(column-number-mode t)
(setq visible-bell t)
(setq scroll-step 1)
(setq-default transient-mark-mode t)  ;; highlight selection

(use-package company
  :ensure t
  :config)
(add-hook 'prog-mode-hook 'global-company-mode)

;; (use-package undo-tree
  ;;   :ensure t
  ;;   :config
  ;;   (setq undo-tree-visualizer-timestamps t)
  ;;   (setq undo-tree-visualizer-diff t))
  ;; (global-undo-tree-mode)

(use-package undo-tree
  :defer t
  :diminish undo-tree-mode
  :init (global-undo-tree-mode)
  :custom
  (undo-tree-visualizer-diff t)
  (undo-tree-history-directory-alist '(("." . "~/.emacs.d/undo")))
  (undo-tree-visualizer-timestamps t))

(use-package ag
  :ensure
  :config
  (setq ag-highlight-search t)
  (setq ag-reuse-buffers t))

(setq helm-ag-insert-at-point 'symbol)
(setq helm-ag-use-temp-buffer t)

(use-package xref
  :ensure
  :config)

(use-package dumb-jump
  :ensure
  :config
  (setq dumb-jump-prefer-searcher 'ag))

(defhydra dumb-jump-hydra (:color blue :columns 3)
    "Dumb Jump"
    ("j" dumb-jump-go "Go")
    ("o" dumb-jump-go-other-window "Other window")
    ("e" dumb-jump-go-prefer-external "Go external")
    ("x" dumb-jump-go-prefer-external-other-window "Go external other window")
    ("i" dumb-jump-go-prompt "Prompt")
    ("l" dumb-jump-quick-look "Quick look")
    ("b" dumb-jump-back "Back"))

(add-hook 'xref-backend-functions #'dumb-jump-xref-activate)

(use-package ripgrep
  :ensure t)
(use-package projectile-ripgrep
  :ensure t
  :requires (ripgrep projectile))

(use-package column-enforce-mode
  :ensure t
  :config
  (setq column-enforce-column 80)
  :bind ("C-c m" . 'column-enforce-mode))
;; column-enforce-face
