content/downloads/emacs/emacs_setup.org
*** highlight whitespace & lines > 80 long

Highlight unnecessary chars and lines over 80.

#+BEGIN_SRC emacs-lisp :tangle no
(use-package whitespace
  :ensure
  :config (setq whitespace-style '(face empty tabs lines-tail trailing))
  :config (global-whitespace-mode t))
#+END_SRC

*** browse kill ring

Don't use =popup-kill-ring= as it's dead. Use the [[https://github.com/browse-kill-ring/browse-kill-ring][browse-kill-ring]]:

#+BEGIN_SRC emacs-lisp
  (use-package browse-kill-ring
    :ensure
    :config
    (setq browse-kill-ring-highlight-current-entry t)
    (setq browse-kill-ring-highlight-inserted-item t))

  (browse-kill-ring-default-keybindings)
#+END_SRC

*** parenthesis

Borrowing from old init.el:

#+BEGIN_SRC emacs-lisp
(show-paren-mode t)
(set-face-attribute 'region nil
                    :background "#666"
                    :foreground "#d52349")
(set-face-background 'show-paren-match (face-background 'default))
(set-face-foreground 'show-paren-match "#d52349")
(set-face-attribute 'show-paren-match nil
                    :weight 'extra-bold)
#+END_SRC

**** show matching delimiters (default: on)

Use [[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiter]]. Do not set the
=rainbow-delimiters-mismatched-face= because it will raise alarm all all
the following brackets when there is a mismatch, like a xmas lights,
and it's distracting to find out the actual mismatch!

#+BEGIN_SRC emacs-lisp
  (use-package rainbow-delimiters
    :ensure
    :config
    (set-face-attribute 'rainbow-delimiters-unmatched-face nil
                        :background "GhostWhite"))
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode)
#+END_SRC

**** type using smartparens (default: on)

Well, who wants to type parenthesis.

#+BEGIN_SRC emacs-lisp
  (use-package smartparens
    :ensure
    :config
    (require 'smartparens-config))
  (add-hook 'prog-mode-hook #'smartparens-mode)
#+END_SRC

*** string inflection (default: some modes)

This is useful in coding to change a string to snake, camel and so on.

#+BEGIN_SRC emacs-lisp
  (use-package string-inflection
    :ensure
    :config)
  (add-hook 'python-mode-hook
              '(lambda ()
                 (local-set-key (kbd "C-q C-u")
                                'string-inflection-python-style-cycle)))
  (add-hook 'org-mode-hook
              '(lambda ()
                 (local-set-key (kbd "C-q C-u")
                                'string-inflection-python-style-cycle)))
  (add-hook 'mu4e-compose-mode-hook
              '(lambda ()
                 (local-set-key (kbd "C-q C-u")
                                'string-inflection-python-style-cycle)))
  (add-hook 'js2-mode-hook
              '(lambda ()
                 (local-set-key (kbd "C-q C-u")
                                'string-inflection-python-style-cycle)))
  #+END_SRC

