content/downloads/emacs/emacs_setup.html

<div id="outline-container-org21f853a" class="outline-4">
<h4 id="org21f853a"><span class="section-number-4">11.1.5</span> highlight whitespace &amp; lines &gt; 80 long</h4>
<div class="outline-text-4" id="text-11-1-5">
<p>
Highlight unnecessary chars and lines over 80.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">whitespace</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span> <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> whitespace-style '<span style="color: #b0b1a3;">(</span>face empty tabs lines-tail trailing<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:config</span> <span style="color: #93a8c6;">(</span>global-whitespace-mode t<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbff639e" class="outline-4">
<h4 id="orgbff639e"><span class="section-number-4">11.1.6</span> browse kill ring</h4>
<div class="outline-text-4" id="text-11-1-6">
<p>
Don't use <code>popup-kill-ring</code> as it's dead. Use the <a href="https://github.com/browse-kill-ring/browse-kill-ring">browse-kill-ring</a>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">browse-kill-ring</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> browse-kill-ring-highlight-current-entry t<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> browse-kill-ring-highlight-inserted-item t<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span>browse-kill-ring-default-keybindings<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org43ab51f" class="outline-4">
<h4 id="org43ab51f"><span class="section-number-4">11.1.7</span> parenthesis</h4>
<div class="outline-text-4" id="text-11-1-7">
<p>
Borrowing from old init.el:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>show-paren-mode t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>set-face-attribute 'region nil
                    <span style="color: #FF80F4;">:background</span> <span style="color: #EEDC82;">"#666"</span>
                    <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"#d52349"</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>set-face-background 'show-paren-match <span style="color: #93a8c6;">(</span>face-background 'default<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>set-face-foreground 'show-paren-match <span style="color: #EEDC82;">"#d52349"</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>set-face-attribute 'show-paren-match nil
                    <span style="color: #FF80F4;">:weight</span> 'extra-bold<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="orgefa1770"></a>show matching delimiters (default: on)<br />
<div class="outline-text-5" id="text-11-1-7-1">
<p>
Use <a href="https://github.com/Fanael/rainbow-delimiters">rainbow-delimiter</a>. Do not set the
<code>rainbow-delimiters-mismatched-face</code> because it will raise alarm all all
the following brackets when there is a mismatch, like a xmas lights,
and it's distracting to find out the actual mismatch!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">rainbow-delimiters</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span>set-face-attribute 'rainbow-delimiters-unmatched-face nil
                      <span style="color: #FF80F4;">:background</span> <span style="color: #EEDC82;">"GhostWhite"</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'prog-mode-hook #'rainbow-delimiters-mode<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org3269a27"></a>type using smartparens (default: on)<br />
<div class="outline-text-5" id="text-11-1-7-2">
<p>
Well, who wants to type parenthesis.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">smartparens</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">require</span> '<span style="color: #FF80F4;">smartparens-config</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'prog-mode-hook #'smartparens-mode<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgb4cd88a" class="outline-4">
<h4 id="orgb4cd88a"><span class="section-number-4">11.1.8</span> string inflection (default: some modes)</h4>
<div class="outline-text-4" id="text-11-1-8">
<p>
This is useful in coding to change a string to snake, camel and so on.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">string-inflection</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'python-mode-hook
            '<span style="color: #93a8c6;">(</span>lambda <span style="color: #b0b1a3;">()</span>
               <span style="color: #b0b1a3;">(</span>local-set-key <span style="color: #97b098;">(</span>kbd <span style="color: #EEDC82;">"C-q C-u"</span><span style="color: #97b098;">)</span>
                              'string-inflection-python-style-cycle<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'org-mode-hook
            '<span style="color: #93a8c6;">(</span>lambda <span style="color: #b0b1a3;">()</span>
               <span style="color: #b0b1a3;">(</span>local-set-key <span style="color: #97b098;">(</span>kbd <span style="color: #EEDC82;">"C-q C-u"</span><span style="color: #97b098;">)</span>
                              'string-inflection-python-style-cycle<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'mu4e-compose-mode-hook
            '<span style="color: #93a8c6;">(</span>lambda <span style="color: #b0b1a3;">()</span>
               <span style="color: #b0b1a3;">(</span>local-set-key <span style="color: #97b098;">(</span>kbd <span style="color: #EEDC82;">"C-q C-u"</span><span style="color: #97b098;">)</span>
                              'string-inflection-python-style-cycle<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'js2-mode-hook
            '<span style="color: #93a8c6;">(</span>lambda <span style="color: #b0b1a3;">()</span>
               <span style="color: #b0b1a3;">(</span>local-set-key <span style="color: #97b098;">(</span>kbd <span style="color: #EEDC82;">"C-q C-u"</span><span style="color: #97b098;">)</span>
                              'string-inflection-python-style-cycle<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
