content/downloads/emacs/emacs_setup.el

(use-package browse-kill-ring
  :ensure
  :config
  (setq browse-kill-ring-highlight-current-entry t)
  (setq browse-kill-ring-highlight-inserted-item t))

(browse-kill-ring-default-keybindings)

(show-paren-mode t)
(set-face-attribute 'region nil
                    :background "#666"
                    :foreground "#d52349")
(set-face-background 'show-paren-match (face-background 'default))
(set-face-foreground 'show-paren-match "#d52349")
(set-face-attribute 'show-paren-match nil
                    :weight 'extra-bold)

(use-package rainbow-delimiters
  :ensure
  :config
  (set-face-attribute 'rainbow-delimiters-unmatched-face nil
                      :background "GhostWhite"))
(add-hook 'prog-mode-hook #'rainbow-delimiters-mode)

(use-package smartparens
  :ensure
  :config
  (require 'smartparens-config))
(add-hook 'prog-mode-hook #'smartparens-mode)

(use-package string-inflection
  :ensure
  :config)
(add-hook 'python-mode-hook
            '(lambda ()
               (local-set-key (kbd "C-q C-u")
                              'string-inflection-python-style-cycle)))
(add-hook 'org-mode-hook
            '(lambda ()
               (local-set-key (kbd "C-q C-u")
                              'string-inflection-python-style-cycle)))
(add-hook 'mu4e-compose-mode-hook
            '(lambda ()
               (local-set-key (kbd "C-q C-u")
                              'string-inflection-python-style-cycle)))
(add-hook 'js2-mode-hook
            '(lambda ()
               (local-set-key (kbd "C-q C-u")
                              'string-inflection-python-style-cycle)))
