content/downloads/emacs/emacs_setup.org
*** annotate-mode (default: some modes)

The file-annotations are store externally. Seems to fail with
=args-out-of-range= and then Emacs is confused. (filed issue for this)

Also, it seems to interfere with colorful modes like =magit= or
=org-agenda-mode= so that I went with a whitelist instead of the wish of
a blacklist of modes.

Read more [[https://github.com/bastibe/annotate.el][here]].

#+BEGIN_SRC emacs-lisp
  (use-package annotate
    :ensure t

    ;; for ledger-mode, as 'C-c C-a' is taken there.
    :bind ("C-c C-A" . 'annotate-annotate)

    :config
    (add-hook 'org-mode 'annotate-mode)
    (add-hook 'csv-mode 'annotate-mode)
    (add-hook 'c-mode 'annotate-mode)
    (add-hook 'c++-mode 'annotate-mode)
    (add-hook 'sh-mode 'annotate-mode)
  ;;;  (define-globalized-minor-mode global-annotate-mode annotate-mode
  ;;;    (lambda () (annotate-mode 1)))
  ;;;  (global-annotate-mode 1)
    )
#+END_SRC

*** writeroom-mode (default: off)

It seems to be a particular way of changing the buffer look so the
writer can focus on, writing. Read [[https://github.com/joostkremers/writeroom-mode][more here]].

#+BEGIN_SRC emacs-lisp
  (use-package writeroom-mode
    :ensure t
    :config)
#+END_SRC

*** anzu

Show number of search matches.

#+BEGIN_SRC emacs-lisp
  (use-package
    anzu

    :ensure
    :config)
  (global-anzu-mode +1)
#+END_SRC

*** move-text

Looks convenient [[https://github.com/emacsfodder/move-text][here]]:
- =Meta-up= move-text-up (line or active region)
- =Meta-down= move-text-down (line or active region)

#+BEGIN_SRC emacs-lisp
  (use-package move-text
    :ensure
    :config)
(move-text-default-bindings)
#+END_SRC

*** tabs to 2

These are global tab settings. Since TAB is such a sensitive thing,
each coding mode may have a different style/preference that will
override this.

#+BEGIN_SRC emacs-lisp
  (setq-default indent-tabs-mode nil)
  (setq require-final-newline t)
  (setq indent-line-function 'insert-tab)
  (setq-default tab-width 2)
#+END_SRC

** no trailing spaces

Delete all trailing white space in the buffer.

#+BEGIN_SRC emacs-lisp
(setq next-line-add-newlines nil)
(add-hook 'before-save-hook 'delete-trailing-whitespace)
#+END_SRC

** iedit mode

Instead of using the string replacement, use this edit mode will
highlight all the occurances in the buffer, and now your editing will
take effect on all of them.

#+BEGIN_SRC emacs-lisp
  (use-package iedit
    :ensure)

  (global-set-key (kbd "C-M-i") 'iedit-mode)
#+END_SRC

** ediff

#+begin_src emacs-lisp
(custom-set-variables
 '(ediff-window-setup-function 'ediff-setup-windows-plain)
 '(ediff-diff-options "-w")
 '(ediff-split-window-function 'split-window-horizontally))
#+end_src

* Navigate file & dir

I'm not quite used to using emacs as file manager yet. To me, it's
much easier to just start a shell and type.

Nonetheless, navigating code tree is necessary, and the one like CP is
so deeply buried that having a good navigator is probably a good
thing.

The most dramatic thing is [[#treemacs][treemacs]], which I need some time to get
used to. It looks nice, but feels a bit, exaggerated to my taste.

** dir hack
#+BEGIN_SRC emacs-lisp
  (use-package dash
    :ensure
    :config)

  (use-package dired-hacks-utils
    :ensure
    :config)
#+END_SRC

