content/downloads/emacs/emacs_setup.html

<div id="outline-container-orgd5ed151" class="outline-4">
<h4 id="orgd5ed151"><span class="section-number-4">11.1.9</span> annotate-mode (default: some modes)</h4>
<div class="outline-text-4" id="text-11-1-9">
<p>
The file-annotations are store externally. Seems to fail with
<code>args-out-of-range</code> and then Emacs is confused. (filed issue for this)
</p>

<p>
Also, it seems to interfere with colorful modes like <code>magit</code> or
<code>org-agenda-mode</code> so that I went with a whitelist instead of the wish of
a blacklist of modes.
</p>

<p>
Read more <a href="https://github.com/bastibe/annotate.el">here</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">annotate</span>
  <span style="color: #FF80F4;">:ensure</span> t

  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">for ledger-mode, as 'C-c C-a' is taken there.</span>
  <span style="color: #FF80F4;">:bind</span> <span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"C-c C-A"</span> . 'annotate-annotate<span style="color: #93a8c6;">)</span>

  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span>add-hook 'org-mode 'annotate-mode<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>add-hook 'csv-mode 'annotate-mode<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>add-hook 'c-mode 'annotate-mode<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>add-hook 'c++-mode 'annotate-mode<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>add-hook 'sh-mode 'annotate-mode<span style="color: #93a8c6;">)</span>
<span style="color: #8C8C8C;">;;;  </span><span style="color: #696969; font-style: italic;">(define-globalized-minor-mode global-annotate-mode annotate-mode</span>
<span style="color: #8C8C8C;">;;;    </span><span style="color: #696969; font-style: italic;">(lambda () (annotate-mode 1)))</span>
<span style="color: #8C8C8C;">;;;  </span><span style="color: #696969; font-style: italic;">(global-annotate-mode 1)</span>
  <span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf1674cb" class="outline-4">
<h4 id="orgf1674cb"><span class="section-number-4">11.1.10</span> writeroom-mode (default: off)</h4>
<div class="outline-text-4" id="text-11-1-10">
<p>
It seems to be a particular way of changing the buffer look so the
writer can focus on, writing. Read <a href="https://github.com/joostkremers/writeroom-mode">more here</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">writeroom-mode</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc53aa49" class="outline-4">
<h4 id="orgc53aa49"><span class="section-number-4">11.1.11</span> anzu</h4>
<div class="outline-text-4" id="text-11-1-11">
<p>
Show number of search matches.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span>
  anzu

  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>global-anzu-mode +1<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf85a357" class="outline-4">
<h4 id="orgf85a357"><span class="section-number-4">11.1.12</span> move-text</h4>
<div class="outline-text-4" id="text-11-1-12">
<p>
Looks convenient <a href="https://github.com/emacsfodder/move-text">here</a>:
</p>
<ul class="org-ul">
<li><code>Meta-up</code> move-text-up (line or active region)</li>
<li><code>Meta-down</code> move-text-down (line or active region)</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">move-text</span>
    <span style="color: #FF80F4;">:ensure</span>
    <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>move-text-default-bindings<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbe6fe49" class="outline-4">
<h4 id="orgbe6fe49"><span class="section-number-4">11.1.13</span> tabs to 2</h4>
<div class="outline-text-4" id="text-11-1-13">
<p>
These are global tab settings. Since TAB is such a sensitive thing,
each coding mode may have a different style/preference that will
override this.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq-default</span> indent-tabs-mode nil<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> require-final-newline t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> indent-line-function 'insert-tab<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq-default</span> tab-width 2<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc47d845" class="outline-3">
<h3 id="orgc47d845"><span class="section-number-3">11.2</span> no trailing spaces</h3>
<div class="outline-text-3" id="text-11-2">
<p>
Delete all trailing white space in the buffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> next-line-add-newlines nil<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'before-save-hook 'delete-trailing-whitespace<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org875fd07" class="outline-3">
<h3 id="org875fd07"><span class="section-number-3">11.3</span> iedit mode</h3>
<div class="outline-text-3" id="text-11-3">
<p>
Instead of using the string replacement, use this edit mode will
highlight all the occurances in the buffer, and now your editing will
take effect on all of them.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">iedit</span>
  <span style="color: #FF80F4;">:ensure</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #93a8c6;">(</span>kbd <span style="color: #EEDC82;">"C-M-i"</span><span style="color: #93a8c6;">)</span> 'iedit-mode<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7738147" class="outline-3">
<h3 id="org7738147"><span class="section-number-3">11.4</span> ediff</h3>
<div class="outline-text-3" id="text-11-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>custom-set-variables
 '<span style="color: #93a8c6;">(</span>ediff-window-setup-function 'ediff-setup-windows-plain<span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>ediff-diff-options <span style="color: #EEDC82;">"-w"</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>ediff-split-window-function 'split-window-horizontally<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5b8939f" class="outline-2">
<h2 id="org5b8939f"><span class="section-number-2">12</span> Navigate file &amp; dir</h2>
<div class="outline-text-2" id="text-12">
<p>
I'm not quite used to using emacs as file manager yet. To me, it's
much easier to just start a shell and type.
</p>

<p>
Nonetheless, navigating code tree is necessary, and the one like CP is
so deeply buried that having a good navigator is probably a good
thing.
</p>

<p>
The most dramatic thing is <a href="#treemacs">treemacs</a>, which I need some time to get
used to. It looks nice, but feels a bit, exaggerated to my taste.
</p>
</div>

<div id="outline-container-org391a73b" class="outline-3">
<h3 id="org391a73b"><span class="section-number-3">12.1</span> dir hack</h3>
<div class="outline-text-3" id="text-12-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">dash</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">dired-hacks-utils</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
