content/downloads/emacs/emacs_setup.el

(use-package annotate
  :ensure t

  ;; for ledger-mode, as 'C-c C-a' is taken there.
  :bind ("C-c C-A" . 'annotate-annotate)

  :config
  (add-hook 'org-mode 'annotate-mode)
  (add-hook 'csv-mode 'annotate-mode)
  (add-hook 'c-mode 'annotate-mode)
  (add-hook 'c++-mode 'annotate-mode)
  (add-hook 'sh-mode 'annotate-mode)
;;;  (define-globalized-minor-mode global-annotate-mode annotate-mode
;;;    (lambda () (annotate-mode 1)))
;;;  (global-annotate-mode 1)
  )

(use-package writeroom-mode
  :ensure t
  :config)

(use-package
  anzu

  :ensure
  :config)
(global-anzu-mode +1)

(use-package move-text
    :ensure
    :config)
(move-text-default-bindings)

(setq-default indent-tabs-mode nil)
(setq require-final-newline t)
(setq indent-line-function 'insert-tab)
(setq-default tab-width 2)

(setq next-line-add-newlines nil)
(add-hook 'before-save-hook 'delete-trailing-whitespace)

(global-set-key (kbd "C-M-i") 'iedit-mode)

(use-package dash
  :ensure
  :config)

(use-package dired-hacks-utils
  :ensure
  :config)
