content/downloads/emacs/emacs_setup.html

<div id="outline-container-org97ea6d0" class="outline-3">
<h3 id="org97ea6d0"><span class="section-number-3">12.2</span> dired-rainbow</h3>
<div class="outline-text-3" id="text-12-2">
<p>
Make the dired coloful. Copied from <a href="https://github.com/Fuco1/dired-hacks">dired-hacks</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">dired-rainbow</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">progn</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">dired-rainbow-define-chmod</span> directory <span style="color: #EEDC82;">"#6cb2eb"</span> <span style="color: #EEDC82;">"d.*"</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">dired-rainbow-define</span> html <span style="color: #EEDC82;">"#eb5286"</span> <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"css"</span> <span style="color: #EEDC82;">"less"</span> <span style="color: #EEDC82;">"sass"</span> <span style="color: #EEDC82;">"scss"</span> <span style="color: #EEDC82;">"htm"</span> <span style="color: #EEDC82;">"html"</span> <span style="color: #EEDC82;">"jhtm"</span> <span style="color: #EEDC82;">"mht"</span> <span style="color: #EEDC82;">"eml"</span> <span style="color: #EEDC82;">"mustache"</span> <span style="color: #EEDC82;">"xhtml"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">dired-rainbow-define</span> xml <span style="color: #EEDC82;">"#f2d024"</span> <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"xml"</span> <span style="color: #EEDC82;">"xsd"</span> <span style="color: #EEDC82;">"xsl"</span> <span style="color: #EEDC82;">"xslt"</span> <span style="color: #EEDC82;">"wsdl"</span> <span style="color: #EEDC82;">"bib"</span> <span style="color: #EEDC82;">"json"</span> <span style="color: #EEDC82;">"msg"</span> <span style="color: #EEDC82;">"pgn"</span> <span style="color: #EEDC82;">"rss"</span> <span style="color: #EEDC82;">"yaml"</span> <span style="color: #EEDC82;">"yml"</span> <span style="color: #EEDC82;">"rdata"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">dired-rainbow-define</span> document <span style="color: #EEDC82;">"#9561e2"</span> <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"docm"</span> <span style="color: #EEDC82;">"doc"</span> <span style="color: #EEDC82;">"docx"</span> <span style="color: #EEDC82;">"odb"</span> <span style="color: #EEDC82;">"odt"</span> <span style="color: #EEDC82;">"pdb"</span> <span style="color: #EEDC82;">"pdf"</span> <span style="color: #EEDC82;">"ps"</span> <span style="color: #EEDC82;">"rtf"</span> <span style="color: #EEDC82;">"djvu"</span> <span style="color: #EEDC82;">"epub"</span> <span style="color: #EEDC82;">"odp"</span> <span style="color: #EEDC82;">"ppt"</span> <span style="color: #EEDC82;">"pptx"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">dired-rainbow-define</span> markdown <span style="color: #EEDC82;">"#ffed4a"</span> <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"org"</span> <span style="color: #EEDC82;">"etx"</span> <span style="color: #EEDC82;">"info"</span> <span style="color: #EEDC82;">"markdown"</span> <span style="color: #EEDC82;">"md"</span> <span style="color: #EEDC82;">"mkd"</span> <span style="color: #EEDC82;">"nfo"</span> <span style="color: #EEDC82;">"pod"</span> <span style="color: #EEDC82;">"rst"</span> <span style="color: #EEDC82;">"tex"</span> <span style="color: #EEDC82;">"textfile"</span> <span style="color: #EEDC82;">"txt"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">dired-rainbow-define</span> database <span style="color: #EEDC82;">"#6574cd"</span> <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"xlsx"</span> <span style="color: #EEDC82;">"xls"</span> <span style="color: #EEDC82;">"csv"</span> <span style="color: #EEDC82;">"accdb"</span> <span style="color: #EEDC82;">"db"</span> <span style="color: #EEDC82;">"mdb"</span> <span style="color: #EEDC82;">"sqlite"</span> <span style="color: #EEDC82;">"nc"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">dired-rainbow-define</span> media <span style="color: #EEDC82;">"#de751f"</span> <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"mp3"</span> <span style="color: #EEDC82;">"mp4"</span> <span style="color: #EEDC82;">"MP3"</span> <span style="color: #EEDC82;">"MP4"</span> <span style="color: #EEDC82;">"avi"</span> <span style="color: #EEDC82;">"mpeg"</span> <span style="color: #EEDC82;">"mpg"</span> <span style="color: #EEDC82;">"flv"</span> <span style="color: #EEDC82;">"ogg"</span> <span style="color: #EEDC82;">"mov"</span> <span style="color: #EEDC82;">"mid"</span> <span style="color: #EEDC82;">"midi"</span> <span style="color: #EEDC82;">"wav"</span> <span style="color: #EEDC82;">"aiff"</span> <span style="color: #EEDC82;">"flac"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">dired-rainbow-define</span> image <span style="color: #EEDC82;">"#f66d9b"</span> <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"tiff"</span> <span style="color: #EEDC82;">"tif"</span> <span style="color: #EEDC82;">"cdr"</span> <span style="color: #EEDC82;">"gif"</span> <span style="color: #EEDC82;">"ico"</span> <span style="color: #EEDC82;">"jpeg"</span> <span style="color: #EEDC82;">"jpg"</span> <span style="color: #EEDC82;">"png"</span> <span style="color: #EEDC82;">"psd"</span> <span style="color: #EEDC82;">"eps"</span> <span style="color: #EEDC82;">"svg"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">dired-rainbow-define</span> log <span style="color: #EEDC82;">"#c17d11"</span> <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"log"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">dired-rainbow-define</span> shell <span style="color: #EEDC82;">"#f6993f"</span> <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"awk"</span> <span style="color: #EEDC82;">"bash"</span> <span style="color: #EEDC82;">"bat"</span> <span style="color: #EEDC82;">"sed"</span> <span style="color: #EEDC82;">"sh"</span> <span style="color: #EEDC82;">"zsh"</span> <span style="color: #EEDC82;">"vim"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">dired-rainbow-define</span> interpreted <span style="color: #EEDC82;">"#38c172"</span> <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"py"</span> <span style="color: #EEDC82;">"ipynb"</span> <span style="color: #EEDC82;">"rb"</span> <span style="color: #EEDC82;">"pl"</span> <span style="color: #EEDC82;">"t"</span> <span style="color: #EEDC82;">"msql"</span> <span style="color: #EEDC82;">"mysql"</span> <span style="color: #EEDC82;">"pgsql"</span> <span style="color: #EEDC82;">"sql"</span> <span style="color: #EEDC82;">"r"</span> <span style="color: #EEDC82;">"clj"</span> <span style="color: #EEDC82;">"cljs"</span> <span style="color: #EEDC82;">"scala"</span> <span style="color: #EEDC82;">"js"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">dired-rainbow-define</span> compiled <span style="color: #EEDC82;">"#4dc0b5"</span> <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"asm"</span> <span style="color: #EEDC82;">"cl"</span> <span style="color: #EEDC82;">"lisp"</span> <span style="color: #EEDC82;">"el"</span> <span style="color: #EEDC82;">"c"</span> <span style="color: #EEDC82;">"h"</span> <span style="color: #EEDC82;">"c++"</span> <span style="color: #EEDC82;">"h++"</span> <span style="color: #EEDC82;">"hpp"</span> <span style="color: #EEDC82;">"hxx"</span> <span style="color: #EEDC82;">"m"</span> <span style="color: #EEDC82;">"cc"</span> <span style="color: #EEDC82;">"cs"</span> <span style="color: #EEDC82;">"cp"</span> <span style="color: #EEDC82;">"cpp"</span> <span style="color: #EEDC82;">"go"</span> <span style="color: #EEDC82;">"f"</span> <span style="color: #EEDC82;">"for"</span> <span style="color: #EEDC82;">"ftn"</span> <span style="color: #EEDC82;">"f90"</span> <span style="color: #EEDC82;">"f95"</span> <span style="color: #EEDC82;">"f03"</span> <span style="color: #EEDC82;">"f08"</span> <span style="color: #EEDC82;">"s"</span> <span style="color: #EEDC82;">"rs"</span> <span style="color: #EEDC82;">"hi"</span> <span style="color: #EEDC82;">"hs"</span> <span style="color: #EEDC82;">"pyc"</span> <span style="color: #EEDC82;">".java"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">dired-rainbow-define</span> executable <span style="color: #EEDC82;">"#8cc4ff"</span> <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"exe"</span> <span style="color: #EEDC82;">"msi"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">dired-rainbow-define</span> compressed <span style="color: #EEDC82;">"#51d88a"</span> <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"7z"</span> <span style="color: #EEDC82;">"zip"</span> <span style="color: #EEDC82;">"bz2"</span> <span style="color: #EEDC82;">"tgz"</span> <span style="color: #EEDC82;">"txz"</span> <span style="color: #EEDC82;">"gz"</span> <span style="color: #EEDC82;">"xz"</span> <span style="color: #EEDC82;">"z"</span> <span style="color: #EEDC82;">"Z"</span> <span style="color: #EEDC82;">"jar"</span> <span style="color: #EEDC82;">"war"</span> <span style="color: #EEDC82;">"ear"</span> <span style="color: #EEDC82;">"rar"</span> <span style="color: #EEDC82;">"sar"</span> <span style="color: #EEDC82;">"xpi"</span> <span style="color: #EEDC82;">"apk"</span> <span style="color: #EEDC82;">"xz"</span> <span style="color: #EEDC82;">"tar"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">dired-rainbow-define</span> packaged <span style="color: #EEDC82;">"#faad63"</span> <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"deb"</span> <span style="color: #EEDC82;">"rpm"</span> <span style="color: #EEDC82;">"apk"</span> <span style="color: #EEDC82;">"jad"</span> <span style="color: #EEDC82;">"jar"</span> <span style="color: #EEDC82;">"cab"</span> <span style="color: #EEDC82;">"pak"</span> <span style="color: #EEDC82;">"pk3"</span> <span style="color: #EEDC82;">"vdf"</span> <span style="color: #EEDC82;">"vpk"</span> <span style="color: #EEDC82;">"bsp"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">dired-rainbow-define</span> encrypted <span style="color: #EEDC82;">"#ffed4a"</span> <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"gpg"</span> <span style="color: #EEDC82;">"pgp"</span> <span style="color: #EEDC82;">"asc"</span> <span style="color: #EEDC82;">"bfe"</span> <span style="color: #EEDC82;">"enc"</span> <span style="color: #EEDC82;">"signature"</span> <span style="color: #EEDC82;">"sig"</span> <span style="color: #EEDC82;">"p12"</span> <span style="color: #EEDC82;">"pem"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">dired-rainbow-define</span> fonts <span style="color: #EEDC82;">"#6cb2eb"</span> <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"afm"</span> <span style="color: #EEDC82;">"fon"</span> <span style="color: #EEDC82;">"fnt"</span> <span style="color: #EEDC82;">"pfb"</span> <span style="color: #EEDC82;">"pfm"</span> <span style="color: #EEDC82;">"ttf"</span> <span style="color: #EEDC82;">"otf"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">dired-rainbow-define</span> partition <span style="color: #EEDC82;">"#e3342f"</span> <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"dmg"</span> <span style="color: #EEDC82;">"iso"</span> <span style="color: #EEDC82;">"bin"</span> <span style="color: #EEDC82;">"nrg"</span> <span style="color: #EEDC82;">"qcow"</span> <span style="color: #EEDC82;">"toast"</span> <span style="color: #EEDC82;">"vcd"</span> <span style="color: #EEDC82;">"vmdk"</span> <span style="color: #EEDC82;">"bak"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">dired-rainbow-define</span> vc <span style="color: #EEDC82;">"#0074d9"</span> <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"git"</span> <span style="color: #EEDC82;">"gitignore"</span> <span style="color: #EEDC82;">"gitattributes"</span> <span style="color: #EEDC82;">"gitmodules"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">dired-rainbow-define-chmod</span> executable-unix <span style="color: #EEDC82;">"#38c172"</span> <span style="color: #EEDC82;">"-.*x.*"</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

</pre>
</div>
</div>
</div>
