content/downloads/emacs/emacs_setup.org
** dired-narrow
#+BEGIN_SRC emacs-lisp
  (use-package dired-narrow
    :ensure
    :config)
#+END_SRC

** dired-collapse

#+BEGIN_SRC emacs-lisp
  (use-package dired-collapse
    :ensure
    :config)
#+END_SRC

** dired-filter

#+BEGIN_SRC emacs-lisp
  (use-package dired-filter
    :ensure
    :config)
#+END_SRC

