content/downloads/emacs/emacs_setup.html

<div id="outline-container-org695c306" class="outline-3">
<h3 id="org695c306"><span class="section-number-3">12.3</span> dired-narrow</h3>
<div class="outline-text-3" id="text-12-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">dired-narrow</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaa42d68" class="outline-3">
<h3 id="orgaa42d68"><span class="section-number-3">12.4</span> dired-collapse</h3>
<div class="outline-text-3" id="text-12-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">dired-collapse</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org36b9330" class="outline-3">
<h3 id="org36b9330"><span class="section-number-3">12.5</span> dired-filter</h3>
<div class="outline-text-3" id="text-12-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">dired-filter</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
