content/downloads/emacs/emacs_setup.el

(use-package dired-narrow
  :ensure
  :config)

(use-package dired-collapse
  :ensure
  :config)

(use-package dired-filter
  :ensure
  :config)
