content/downloads/emacs/emacs_setup.html

<div id="outline-container-org9b7e564" class="outline-3">
<h3 id="treemacs"><span class="section-number-3">12.6</span> treemacs (default: off)</h3>
<div class="outline-text-3" id="text-treemacs">
<p>
Copied from <a href="https://github.com/Alexander-Miller/treemacs#installation">here</a>. I'm leaving this mode off by default. <code>C-c t t</code> to
enable it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">treemacs</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:defer</span> t
  <span style="color: #FF80F4;">:init</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">with-eval-after-load</span> 'winum
    <span style="color: #b0b1a3;">(</span>define-key winum-keymap <span style="color: #97b098;">(</span>kbd <span style="color: #EEDC82;">"M-0"</span><span style="color: #97b098;">)</span> #'treemacs-select-window<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">progn</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">setq</span> treemacs-collapse-dirs                 <span style="color: #97b098;">(</span><span style="color: #F92672;">if</span> treemacs-python-executable 3 0<span style="color: #97b098;">)</span>
          treemacs-deferred-git-apply-delay      0.5
          treemacs-directory-name-transformer    #'identity
          treemacs-display-in-side-window        t
          treemacs-eldoc-display                 t
          treemacs-file-event-delay              5000
          treemacs-file-extension-regex          treemacs-last-period-regex-value
          treemacs-file-follow-delay             0.2
          treemacs-file-name-transformer         #'identity
          treemacs-follow-after-init             t
          treemacs-git-command-pipe              <span style="color: #EEDC82;">""</span>
          treemacs-goto-tag-strategy             'refetch-index
          treemacs-indentation                   2
          treemacs-indentation-string            <span style="color: #EEDC82;">" "</span>
          treemacs-is-never-other-window         nil
          treemacs-max-git-entries               5000
          treemacs-missing-project-action        'ask
          treemacs-move-forward-on-expand        nil
          treemacs-no-png-images                 nil
          treemacs-no-delete-other-windows       t
          treemacs-project-follow-cleanup        nil
          treemacs-persist-file                  <span style="color: #97b098;">(</span>expand-file-name <span style="color: #EEDC82;">".cache/treemacs-persist"</span> user-emacs-directory<span style="color: #97b098;">)</span>
          treemacs-position                      'left
          treemacs-recenter-distance             0.1
          treemacs-recenter-after-file-follow    nil
          treemacs-recenter-after-tag-follow     nil
          treemacs-recenter-after-project-jump   'always
          treemacs-recenter-after-project-expand 'on-distance
          treemacs-show-cursor                   nil
          treemacs-show-hidden-files             t
          treemacs-silent-filewatch              nil
          treemacs-silent-refresh                nil
          treemacs-sorting                       'alphabetic-asc
          treemacs-space-between-root-nodes      t
          treemacs-tag-follow-cleanup            t
          treemacs-tag-follow-delay              1.5
          treemacs-user-mode-line-format         nil
          treemacs-user-header-line-format       nil
          treemacs-width                         35
          treemacs-workspace-switch-cleanup      nil<span style="color: #b0b1a3;">)</span>

    <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">The default width and height of the icons is 22 pixels. If you are</span>
    <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">using a Hi-DPI display, uncomment this to double the icon size.</span>
    <span style="color: #8C8C8C;">;;</span><span style="color: #696969; font-style: italic;">(treemacs-resize-icons 44)</span>

    <span style="color: #b0b1a3;">(</span>treemacs-follow-mode t<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span>treemacs-filewatch-mode t<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span>treemacs-fringe-indicator-mode t<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">pcase</span> <span style="color: #97b098;">(</span>cons <span style="color: #aebed8;">(</span>not <span style="color: #b0b0b3;">(</span>null <span style="color: #90a890;">(</span>executable-find <span style="color: #EEDC82;">"git"</span><span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
                 <span style="color: #aebed8;">(</span>not <span style="color: #b0b0b3;">(</span>null treemacs-python-executable<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
      <span style="color: #97b098;">(</span>`<span style="color: #aebed8;">(</span>t . t<span style="color: #aebed8;">)</span>
       <span style="color: #aebed8;">(</span>treemacs-git-mode 'deferred<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
      <span style="color: #97b098;">(</span>`<span style="color: #aebed8;">(</span>t . _<span style="color: #aebed8;">)</span>
       <span style="color: #aebed8;">(</span>treemacs-git-mode 'simple<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:bind</span>
  <span style="color: #93a8c6;">(</span><span style="color: #FF80F4;">:map</span> global-map
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"M-0"</span>       . treemacs-select-window<span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-x t 1"</span>   . treemacs-delete-other-windows<span style="color: #b0b1a3;">)</span>
          <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-x t t"</span>   . treemacs<span style="color: #b0b1a3;">)</span>
          <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-x t B"</span>   . treemacs-bookmark<span style="color: #b0b1a3;">)</span>
          <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-x t C-t"</span> . treemacs-find-file<span style="color: #b0b1a3;">)</span>
          <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-x t M-t"</span> . treemacs-find-tag<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>


  <span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">treemacs-icons-dired</span>
    <span style="color: #FF80F4;">:after</span> treemacs dired
    <span style="color: #FF80F4;">:ensure</span> t
      <span style="color: #FF80F4;">:config</span> <span style="color: #93a8c6;">(</span>treemacs-icons-dired-mode<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

  <span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">treemacs-projectile</span>
    <span style="color: #FF80F4;">:after</span> treemacs projectile
    <span style="color: #FF80F4;">:ensure</span> t<span style="color: #8c8c8c;">)</span>
  <span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">treemacs-magit</span>
    <span style="color: #FF80F4;">:after</span> treemacs magit
    <span style="color: #FF80F4;">:ensure</span> t<span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Add some files to ignore, eg. ~.pyc`:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">with-eval-after-load</span> 'treemacs
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">treemacs-ignore-gitignore</span> <span style="color: #b0b1a3;">(</span>file _<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span>string= file <span style="color: #EEDC82;">".pyc"</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">push</span> #'treemacs-ignore-gitignore treemacs-ignored-file-predicates<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
</div>
