content/downloads/emacs/emacs_setup.html

<div id="outline-container-orgd79cfd6" class="outline-2">
<h2 id="orgd79cfd6"><span class="section-number-2">13</span> Helm</h2>
<div class="outline-text-2" id="text-13">
<p>
Helm should really has its own section because it touches everything!
</p>

<p>
I just took over the config described in this <a href="https://tuhdo.github.io/helm-intro.html">helm intro</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">helm</span>
 <span style="color: #FF80F4;">:ensure</span> t
 <span style="color: #FF80F4;">:delight</span> helm-mode
 <span style="color: #FF80F4;">:config</span>
  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">(require 'helm-config)</span>
  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">The default "C-x c" is quite close to "C-x C-c", which quits Emacs.</span>
  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Changed to "C-c h". Note: We must set "C-c h" globally, because we</span>
  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">cannot change `</span><span style="color: #FF80F4; font-style: italic;">helm-command-prefix-key</span><span style="color: #696969; font-style: italic;">' once `</span><span style="color: #FF80F4; font-style: italic;">helm-config</span><span style="color: #696969; font-style: italic;">' is loaded.</span>
  <span style="color: #93a8c6;">(</span>global-set-key <span style="color: #b0b1a3;">(</span>kbd <span style="color: #EEDC82;">"C-c h"</span><span style="color: #b0b1a3;">)</span> 'helm-command-prefix<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>global-unset-key <span style="color: #b0b1a3;">(</span>kbd <span style="color: #EEDC82;">"C-x c"</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>

  <span style="color: #93a8c6;">(</span>define-key helm-map <span style="color: #b0b1a3;">(</span>kbd <span style="color: #EEDC82;">"&lt;tab&gt;"</span><span style="color: #b0b1a3;">)</span> 'helm-execute-persistent-action<span style="color: #93a8c6;">)</span> <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">rebind tab to run persistent action</span>
  <span style="color: #93a8c6;">(</span>define-key helm-map <span style="color: #b0b1a3;">(</span>kbd <span style="color: #EEDC82;">"C-M-x"</span><span style="color: #b0b1a3;">)</span> 'helm-execute-persistent-action<span style="color: #93a8c6;">)</span> <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">make TAB work in terminal</span>
  <span style="color: #93a8c6;">(</span>define-key helm-map <span style="color: #b0b1a3;">(</span>kbd <span style="color: #EEDC82;">"C-z"</span><span style="color: #b0b1a3;">)</span>  'helm-select-action<span style="color: #93a8c6;">)</span> <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">list actions using C-z</span>

  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">when</span> <span style="color: #b0b1a3;">(</span>executable-find <span style="color: #EEDC82;">"curl"</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">setq</span> helm-google-suggest-use-curl-p t<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>

  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> helm-split-window-inside-p            t <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">open helm buffer inside current window, not occupy whole other window</span>
        helm-move-to-line-cycle-in-source     t <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">move to end or beginning of source when reaching top or bottom of source.</span>
        helm-ff-search-library-in-sexp        t <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">search for library in `</span><span style="color: #FF80F4; font-style: italic;">require</span><span style="color: #696969; font-style: italic;">' and `</span><span style="color: #FF80F4; font-style: italic;">declare-function</span><span style="color: #696969; font-style: italic;">' sexp.</span>
        helm-scroll-amount                    8 <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">scroll 8 lines other window using M-&lt;next&gt;/M-&lt;prior&gt;</span>
        helm-ff-file-name-history-use-recentf t
        helm-echo-input-in-header-line t<span style="color: #93a8c6;">)</span>

  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> helm-autoresize-max-height 50<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> helm-autoresize-min-height 0<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>helm-autoresize-mode 1<span style="color: #93a8c6;">)</span>

  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> helm-M-x-fuzzy-match t<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> helm-buffers-fuzzy-matching t
        helm-recentf-fuzzy-match    t<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> helm-semantic-fuzzy-match t
        helm-imenu-fuzzy-match    t<span style="color: #93a8c6;">)</span>
<span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> helm-locate-fuzzy-match t<span style="color: #93a8c6;">)</span>
<span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> helm-apropos-fuzzy-match t<span style="color: #93a8c6;">)</span>
<span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> helm-lisp-fuzzy-completion t<span style="color: #93a8c6;">)</span>
<span style="color: #93a8c6;">(</span>helm-mode 1<span style="color: #93a8c6;">)</span>
<span style="color: #93a8c6;">(</span>global-set-key <span style="color: #b0b1a3;">(</span>kbd <span style="color: #EEDC82;">"C-x C-m"</span><span style="color: #b0b1a3;">)</span> 'helm-M-x<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Found <a href="https://www.reddit.com/r/emacs/comments/30yer0/helm_and_recentf_tips/">this reddit post</a> of using <code>helm-mini</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> helm-mini-default-sources '<span style="color: #93a8c6;">(</span>helm-source-buffers-list
                                  helm-source-recentf
                                  helm-source-bookmarks
                                  helm-source-buffer-not-found<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
