content/downloads/emacs/emacs_setup.org
* Write chinese
I have been using this one w/ reasonable success.

First, install pyim.

#+BEGIN_SRC emacs-lisp
  (use-package pyim
    :ensure
    :defer 10
    :config

    ;; 五笔用户使用 wbdict 词库
    ;; (use-package pyim-wbdict
    ;;   :ensure nil
    ;;   :config (pyim-wbdict-gbk-enable))

    (setq default-input-method "pyim")

    ;; 我使用全拼
    (setq pyim-default-scheme 'quanpin)

    ;; 设置 pyim 探针设置，这是 pyim 高级功能设置，可以实现 *无痛* 中英文切换 :-)
    ;; 我自己使用的中英文动态切换规则是：
    ;; 1. 光标只有在注释里面时，才可以输入中文。
    ;; 2. 光标前是汉字字符时，才能输入中文。
    ;; 3. 使用 M-j 快捷键，强制将光标前的拼音字符串转换为中文。
    ;; (setq-default pyim-english-input-switch-functions
    ;;               '(pyim-probe-dynamic-english
    ;;                 pyim-probe-isearch-mode
    ;;                 pyim-probe-program-mode
    ;;                 pyim-probe-org-structure-template))

    ;; (setq-default pyim-punctuation-half-width-functions
    ;;               '(pyim-probe-punctuation-line-beginning
    ;;                 pyim-probe-punctuation-after-punctuation))

    ;; 开启拼音搜索功能
    (pyim-isearch-mode 1)

    ;; 使用 pupup-el 来绘制选词框
    (setq pyim-page-tooltip 'popup)

    ;; 选词框显示5个候选词
    (setq pyim-page-length 7)

    ;; 让 Emacs 启动时自动加载 pyim 词库
    (add-hook 'emacs-startup-hook
              #'(lambda () (pyim-restart-1 t)))
    :bind
    (;与 pyim-probe-dynamic-english 配合
    ("M-j" . pyim-convert-code-at-point)

    ("C-;" . pyim-delete-word-from-personal-buffer)))
#+END_SRC


Add a basic dictionary.
#+BEGIN_SRC emacs-lisp
  ;; Basedict
  (use-package pyim-basedict
    :ensure t)
  (pyim-basedict-enable)
#+END_SRC


Last, a couple global settins.

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-\\") 'toggle-input-method)
(setq default-input-method "pyim")
#+END_SRC

* Office stuff
Using emacs in a corporate env can be daunting.

** mu4e email
mu4e only a emac client. The workhorse are davmail, isync and mu. You need to install these offline and hook them up using the config below.

*** install & minimal setup
First thing first, load the package. As you can see, I have used =apt-get= install mu4e.

#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path "/usr/local/share/emacs/site-lisp/mu4e/")
  (require 'mu4e)
  (require 'mu4e-contrib)
#+END_SRC


Then we load =maildirs-extension=:

#+BEGIN_SRC emacs-lisp
  (use-package mu4e-maildirs-extension
    :ensure
    :config)
  (mu4e-maildirs-extension)
#+END_SRC


Now, we tell emacs I want to use =mu4e= as email client:

#+BEGIN_SRC emacs-lisp
  (setq mail-user-agent 'mu4e-user-agent)
#+END_SRC


Link to a couple modes to help me writing good emails:

#+BEGIN_SRC emacs-lisp
  (add-hook 'mu4e-compose-mode-hook
  (lambda ()
  (visual-line-mode t)
  (writegood-mode t)
  (flyspell-mode t)))
  #+END_SRC

*** mu4e-column-faces

I like it! I installed via =list-package= as =C-x C-e= of the block below didn't
work for some reason!

#+begin_src emacs-lisp
  (use-package mu4e-column-faces
    :after mu4e
    :config (mu4e-column-faces-mode))
#+end_src

