content/downloads/emacs/emacs_setup.html

<div id="outline-container-org065f193" class="outline-2">
<h2 id="org065f193"><span class="section-number-2">14</span> Write chinese</h2>
<div class="outline-text-2" id="text-14">
<p>
I have been using this one w/ reasonable success.
</p>

<p>
First, install pyim.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">pyim</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:defer</span> 10
  <span style="color: #FF80F4;">:config</span>

  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">&#20116;&#31508;&#29992;&#25143;&#20351;&#29992; wbdict &#35789;&#24211;</span>
  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">(use-package pyim-wbdict</span>
  <span style="color: #8C8C8C;">;;   </span><span style="color: #696969; font-style: italic;">:ensure nil</span>
  <span style="color: #8C8C8C;">;;   </span><span style="color: #696969; font-style: italic;">:config (pyim-wbdict-gbk-enable))</span>

  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> default-input-method <span style="color: #EEDC82;">"pyim"</span><span style="color: #93a8c6;">)</span>

  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">&#25105;&#20351;&#29992;&#20840;&#25340;</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> pyim-default-scheme 'quanpin<span style="color: #93a8c6;">)</span>

  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">&#35774;&#32622; pyim &#25506;&#38024;&#35774;&#32622;&#65292;&#36825;&#26159; pyim &#39640;&#32423;&#21151;&#33021;&#35774;&#32622;&#65292;&#21487;&#20197;&#23454;&#29616; *&#26080;&#30171;* &#20013;&#33521;&#25991;&#20999;&#25442; :-)</span>
  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">&#25105;&#33258;&#24049;&#20351;&#29992;&#30340;&#20013;&#33521;&#25991;&#21160;&#24577;&#20999;&#25442;&#35268;&#21017;&#26159;&#65306;</span>
  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">1. &#20809;&#26631;&#21482;&#26377;&#22312;&#27880;&#37322;&#37324;&#38754;&#26102;&#65292;&#25165;&#21487;&#20197;&#36755;&#20837;&#20013;&#25991;&#12290;</span>
  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">2. &#20809;&#26631;&#21069;&#26159;&#27721;&#23383;&#23383;&#31526;&#26102;&#65292;&#25165;&#33021;&#36755;&#20837;&#20013;&#25991;&#12290;</span>
  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">3. &#20351;&#29992; M-j &#24555;&#25463;&#38190;&#65292;&#24378;&#21046;&#23558;&#20809;&#26631;&#21069;&#30340;&#25340;&#38899;&#23383;&#31526;&#20018;&#36716;&#25442;&#20026;&#20013;&#25991;&#12290;</span>
  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">(setq-default pyim-english-input-switch-functions</span>
  <span style="color: #8C8C8C;">;;               </span><span style="color: #696969; font-style: italic;">'(pyim-probe-dynamic-english</span>
  <span style="color: #8C8C8C;">;;                 </span><span style="color: #696969; font-style: italic;">pyim-probe-isearch-mode</span>
  <span style="color: #8C8C8C;">;;                 </span><span style="color: #696969; font-style: italic;">pyim-probe-program-mode</span>
  <span style="color: #8C8C8C;">;;                 </span><span style="color: #696969; font-style: italic;">pyim-probe-org-structure-template))</span>

  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">(setq-default pyim-punctuation-half-width-functions</span>
  <span style="color: #8C8C8C;">;;               </span><span style="color: #696969; font-style: italic;">'(pyim-probe-punctuation-line-beginning</span>
  <span style="color: #8C8C8C;">;;                 </span><span style="color: #696969; font-style: italic;">pyim-probe-punctuation-after-punctuation))</span>

  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">&#24320;&#21551;&#25340;&#38899;&#25628;&#32034;&#21151;&#33021;</span>
  <span style="color: #93a8c6;">(</span>pyim-isearch-mode 1<span style="color: #93a8c6;">)</span>

  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">&#20351;&#29992; pupup-el &#26469;&#32472;&#21046;&#36873;&#35789;&#26694;</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> pyim-page-tooltip 'popup<span style="color: #93a8c6;">)</span>

  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">&#36873;&#35789;&#26694;&#26174;&#31034;5&#20010;&#20505;&#36873;&#35789;</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> pyim-page-length 7<span style="color: #93a8c6;">)</span>

  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">&#35753; Emacs &#21551;&#21160;&#26102;&#33258;&#21160;&#21152;&#36733; pyim &#35789;&#24211;</span>
  <span style="color: #93a8c6;">(</span>add-hook 'emacs-startup-hook
            #'<span style="color: #b0b1a3;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #97b098;">()</span> <span style="color: #97b098;">(</span>pyim-restart-1 t<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:bind</span>
  <span style="color: #93a8c6;">(</span><span style="color: #8C8C8C;">;</span><span style="color: #696969; font-style: italic;">&#19982; pyim-probe-dynamic-english &#37197;&#21512;</span>
  <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"M-j"</span> . pyim-convert-code-at-point<span style="color: #b0b1a3;">)</span>

  <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-;"</span> . pyim-delete-word-from-personal-buffer<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Add a basic dictionary.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Basedict</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">pyim-basedict</span>
  <span style="color: #FF80F4;">:ensure</span> t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>pyim-basedict-enable<span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Last, a couple global settins.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #93a8c6;">(</span>kbd <span style="color: #EEDC82;">"C-\\"</span><span style="color: #93a8c6;">)</span> 'toggle-input-method<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> default-input-method <span style="color: #EEDC82;">"pyim"</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge07ad8d" class="outline-2">
<h2 id="orge07ad8d"><span class="section-number-2">15</span> Office stuff</h2>
<div class="outline-text-2" id="text-15">
<p>
Using emacs in a corporate env can be daunting.
</p>
</div>

<div id="outline-container-org7327279" class="outline-3">
<h3 id="org7327279"><span class="section-number-3">15.1</span> mu4e email</h3>
<div class="outline-text-3" id="text-15-1">
<p>
mu4e only a emac client. The workhorse are davmail, isync and mu. You need to install these offline and hook them up using the config below.
</p>
</div>

<div id="outline-container-org6b288d5" class="outline-4">
<h4 id="org6b288d5"><span class="section-number-4">15.1.1</span> install &amp; minimal setup</h4>
<div class="outline-text-4" id="text-15-1-1">
<p>
First thing first, load the package. As you can see, I have used <code>apt-get</code> install mu4e.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>add-to-list 'load-path <span style="color: #EEDC82;">"/usr/local/share/emacs/site-lisp/mu4e/"</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">require</span> '<span style="color: #FF80F4;">mu4e</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">require</span> '<span style="color: #FF80F4;">mu4e-contrib</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Then we load <code>maildirs-extension</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">mu4e-maildirs-extension</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>mu4e-maildirs-extension<span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Now, we tell emacs I want to use <code>mu4e</code> as email client:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> mail-user-agent 'mu4e-user-agent<span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Link to a couple modes to help me writing good emails:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>add-hook 'mu4e-compose-mode-hook
<span style="color: #93a8c6;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #b0b1a3;">()</span>
<span style="color: #b0b1a3;">(</span>visual-line-mode t<span style="color: #b0b1a3;">)</span>
<span style="color: #b0b1a3;">(</span>writegood-mode t<span style="color: #b0b1a3;">)</span>
<span style="color: #b0b1a3;">(</span>flyspell-mode t<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8067ce0" class="outline-4">
<h4 id="org8067ce0"><span class="section-number-4">15.1.2</span> mu4e-column-faces</h4>
<div class="outline-text-4" id="text-15-1-2">
<p>
I like it! I installed via <code>list-package</code> as <code>C-x C-e</code> of the block below didn't
work for some reason!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">mu4e-column-faces</span>
  <span style="color: #FF80F4;">:after</span> mu4e
  <span style="color: #FF80F4;">:config</span> <span style="color: #93a8c6;">(</span>mu4e-column-faces-mode<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
