content/downloads/emacs/emacs_setup.el

(use-package pyim
  :ensure
  :defer 10
  :config

  ;;  wbdict 
  ;; (use-package pyim-wbdict
  ;;   :ensure nil
  ;;   :config (pyim-wbdict-gbk-enable))

  (setq default-input-method "pyim")

  ;; 
  (setq pyim-default-scheme 'quanpin)

  ;;  pyim  pyim  **  :-)
  ;; 
  ;; 1. 
  ;; 2. 
  ;; 3.  M-j 
  ;; (setq-default pyim-english-input-switch-functions
  ;;               '(pyim-probe-dynamic-english
  ;;                 pyim-probe-isearch-mode
  ;;                 pyim-probe-program-mode
  ;;                 pyim-probe-org-structure-template))

  ;; (setq-default pyim-punctuation-half-width-functions
  ;;               '(pyim-probe-punctuation-line-beginning
  ;;                 pyim-probe-punctuation-after-punctuation))

  ;; 
  (pyim-isearch-mode 1)

  ;;  pupup-el 
  (setq pyim-page-tooltip 'popup)

  ;; 5
  (setq pyim-page-length 7)

  ;;  Emacs  pyim 
  (add-hook 'emacs-startup-hook
            #'(lambda () (pyim-restart-1 t)))
  :bind
  (; pyim-probe-dynamic-english 
  ("M-j" . pyim-convert-code-at-point)

  ("C-;" . pyim-delete-word-from-personal-buffer)))

;; Basedict
(use-package pyim-basedict
  :ensure t)
(pyim-basedict-enable)

(global-set-key (kbd "C-\\") 'toggle-input-method)
(setq default-input-method "pyim")

(add-to-list 'load-path "/usr/share/emacs/site-lisp/mu4e/")
(require 'mu4e)

(use-package mu4e-maildirs-extension
  :ensure
  :config)
(mu4e-maildirs-extension)

(setq mail-user-agent 'mu4e-user-agent)

(add-hook 'mu4e-compose-mode-hook
              (lambda ()
                (visual-line-mode t)
                (writegood-mode t)
                (flyspell-mode t)))
