content/downloads/emacs/emacs_setup.org
*** customize face

#+begin_src emacs-lisp
  (custom-set-faces
   '(mu4e-header-highlight-face ((t (:foreground "tomato" :weight bold :overline t :underline t))))
   )
#+end_src

