content/downloads/emacs/emacs_setup.html

<div id="outline-container-orgdab0091" class="outline-4">
<h4 id="orgdab0091"><span class="section-number-4">15.1.3</span> customize face</h4>
<div class="outline-text-4" id="text-15-1-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>custom-set-faces
 '<span style="color: #93a8c6;">(</span>mu4e-header-highlight-face <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"tomato"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 <span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
