content/downloads/emacs/emacs_setup.org
*** context

In 1.8.7 we can setup different [[https://www.djcbsoftware.nl/code/mu/mu4e/Contexts-example.html][context]] so we can use the same mu4e for both
private emails and work emails. Awesome!

#+begin_src emacs-lisp
  (setq mu4e-contexts
     `( ,(make-mu4e-context
           :name "Hotmail"
           :enter-func (lambda () (mu4e-message "Entering hotmail context"))
           :leave-func (lambda () (mu4e-message "Leaving hotmail context"))
           ;; we match based on the contact-fields of the message
           :match-func (lambda (msg)
                         (when msg
                           (mu4e-message-contact-field-matches msg
                             :to "feng_xia41103@hotmail.com")))
           :vars '( ( user-mail-address	    . "feng_xia41103@hotmail.com" )
                    ( user-full-name	    . "Feng Xia" )
                    ( smtpmail-smtp-user . "feng_xia41103@hotmail.com" )
                    ( smtpmail-default-smtp-server . "smtp-mail.outlook.com" )
                    ( smtpmail-smtp-server . "smtp-mail.outlook.com" )
                    ( smtpmail-smtp-service . 587 )
                    ( starttls-use-gnutls . t)
                    ( message-user-organization . "Hotmail" )
                    ( mu4e-compose-reply-to-address . "feng_xia41103@hotmail.com" )
                    ( mu4e-compose-signature .
                      (concat
                        "Best,\n"
                        "feng\n"))))

        ,(make-mu4e-context
           :name "Work"
           :enter-func (lambda () (mu4e-message "Switch to the Work context"))
           ;; no leave-func
           ;; we match based on the maildir of the message
           ;; this matches maildir /Arkham and its sub-directories
           :match-func (lambda (msg)
                         (when msg
                           (string-match-p "^/Mycompany" (mu4e-message-field msg :maildir))))
           :vars '( ( user-mail-address	     . "feng.xia@mycompany.io" )
                    ( user-full-name	     . "Feng Xia" )
                    ( message-user-organization . "Mycompany Inc." )
                    ( smtpmail-smtp-user . "feng.xia@mycompany.io" )
                    ( smtpmail-default-smtp-server . "localhost" )
                    ( smtpmail-smtp-server . "localhost" )
                    ( smtpmail-smtp-service . 1025 )
                    ( starttls-use-gnutls . nil)
                    ( mu4e-compose-reply-to-address . "feng.xia@mycompany.io" )
                    ( mu4e-compose-signature  .
                      (concat
                       "Best regards,\n\n"
                       "Feng Xia\n\n"
                       "W: http://www.mycompany.io\(not )"))))

        ,(make-mu4e-context
           :name "gmail"
           :enter-func (lambda () (mu4e-message "Entering gmail context"))
           :leave-func (lambda () (mu4e-message "Leaving gmail context"))
           ;; we match based on the contact-fields of the message
           :match-func (lambda (msg)
                         (when msg
                           (mu4e-message-contact-field-matches msg
                             :to "fengxia41103@gmail.com")))
           :vars '( ( user-mail-address	    . "fengxia41103@gmail.com" )
                    ( user-full-name	    . "Feng Xia" )
                      ( smtpmail-smtp-user . "fengxia41103@gmail.com" )
                      ( smtpmail-default-smtp-server . "smtp.gmail.com" )
                      ( smtpmail-smtp-server . "smtp.gmail.com" )
                      ( smtpmail-smtp-service . 587 )
                      ( starttls-use-gnutls . t)
                      ( mu4e-compose-reply-to-address . "fengxia41103@gmail.com" )
                      ( message-user-organization . "Gmail" )
                      ( mu4e-compose-signature .
                        (concat
                         "Best,\n"
                         "feng\n"))))
  ))

   ;; set `mu4e-context-policy` and `mu4e-compose-policy` to tweak when mu4e should
   ;; guess or ask the correct context, e.g.

   ;; start with the first (default) context;
   ;; default is to ask-if-none (ask when there's no context yet, and none match)
   ;; (setq mu4e-context-policy 'pick-first)

   ;; compose with the current context is no context matches;
   ;; default is to ask
   ;; (setq mu4e-compose-context-policy nil)
#+end_src

