content/downloads/emacs/emacs_setup.html

<div id="outline-container-org15cde9b" class="outline-4">
<h4 id="org15cde9b"><span class="section-number-4">15.1.4</span> context</h4>
<div class="outline-text-4" id="text-15-1-4">
<p>
In 1.8.7 we can setup different <a href="https://www.djcbsoftware.nl/code/mu/mu4e/Contexts-example.html">context</a> so we can use the same mu4e for both
private emails and work emails. Awesome!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> mu4e-contexts
   `<span style="color: #93a8c6;">(</span> ,<span style="color: #b0b1a3;">(</span>make-mu4e-context
         <span style="color: #FF80F4;">:name</span> <span style="color: #EEDC82;">"Hotmail"</span>
         <span style="color: #FF80F4;">:enter-func</span> <span style="color: #97b098;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #aebed8;">()</span> <span style="color: #aebed8;">(</span>mu4e-message <span style="color: #EEDC82;">"Entering hotmail context"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
         <span style="color: #FF80F4;">:leave-func</span> <span style="color: #97b098;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #aebed8;">()</span> <span style="color: #aebed8;">(</span>mu4e-message <span style="color: #EEDC82;">"Leaving hotmail context"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
         <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">we match based on the contact-fields of the message</span>
         <span style="color: #FF80F4;">:match-func</span> <span style="color: #97b098;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #aebed8;">(</span>msg<span style="color: #aebed8;">)</span>
                       <span style="color: #aebed8;">(</span><span style="color: #F92672;">when</span> msg
                         <span style="color: #b0b0b3;">(</span>mu4e-message-contact-field-matches msg
                           <span style="color: #FF80F4;">:to</span> <span style="color: #EEDC82;">"feng_xia41103@hotmail.com"</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
         <span style="color: #FF80F4;">:vars</span> '<span style="color: #97b098;">(</span> <span style="color: #aebed8;">(</span> user-mail-address     . <span style="color: #EEDC82;">"feng_xia41103@hotmail.com"</span> <span style="color: #aebed8;">)</span>
                  <span style="color: #aebed8;">(</span> user-full-name      . <span style="color: #EEDC82;">"Feng Xia"</span> <span style="color: #aebed8;">)</span>
                  <span style="color: #aebed8;">(</span> smtpmail-smtp-user . <span style="color: #EEDC82;">"feng_xia41103@hotmail.com"</span> <span style="color: #aebed8;">)</span>
                  <span style="color: #aebed8;">(</span> smtpmail-default-smtp-server . <span style="color: #EEDC82;">"smtp-mail.outlook.com"</span> <span style="color: #aebed8;">)</span>
                  <span style="color: #aebed8;">(</span> smtpmail-smtp-server . <span style="color: #EEDC82;">"smtp-mail.outlook.com"</span> <span style="color: #aebed8;">)</span>
                  <span style="color: #aebed8;">(</span> smtpmail-smtp-service . 587 <span style="color: #aebed8;">)</span>
                  <span style="color: #aebed8;">(</span> starttls-use-gnutls . t<span style="color: #aebed8;">)</span>
                  <span style="color: #aebed8;">(</span> message-user-organization . <span style="color: #EEDC82;">"Hotmail"</span> <span style="color: #aebed8;">)</span>
                  <span style="color: #aebed8;">(</span> mu4e-compose-reply-to-address . <span style="color: #EEDC82;">"feng_xia41103@hotmail.com"</span> <span style="color: #aebed8;">)</span>
                  <span style="color: #aebed8;">(</span> mu4e-compose-signature .
                    <span style="color: #b0b0b3;">(</span>concat
                      <span style="color: #EEDC82;">"Best,\n"</span>
                      <span style="color: #EEDC82;">"feng\n"</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>

      ,<span style="color: #b0b1a3;">(</span>make-mu4e-context
         <span style="color: #FF80F4;">:name</span> <span style="color: #EEDC82;">"Work"</span>
         <span style="color: #FF80F4;">:enter-func</span> <span style="color: #97b098;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #aebed8;">()</span> <span style="color: #aebed8;">(</span>mu4e-message <span style="color: #EEDC82;">"Switch to the Work context"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
         <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">no leave-func</span>
         <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">we match based on the maildir of the message</span>
         <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">this matches maildir /Arkham and its sub-directories</span>
         <span style="color: #FF80F4;">:match-func</span> <span style="color: #97b098;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #aebed8;">(</span>msg<span style="color: #aebed8;">)</span>
                       <span style="color: #aebed8;">(</span><span style="color: #F92672;">when</span> msg
                         <span style="color: #b0b0b3;">(</span>string-match-p <span style="color: #EEDC82;">"^/Mycompany"</span> <span style="color: #90a890;">(</span>mu4e-message-field msg <span style="color: #FF80F4;">:maildir</span><span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
         <span style="color: #FF80F4;">:vars</span> '<span style="color: #97b098;">(</span> <span style="color: #aebed8;">(</span> user-mail-address      . <span style="color: #EEDC82;">"feng.xia@mycompany.io"</span> <span style="color: #aebed8;">)</span>
                  <span style="color: #aebed8;">(</span> user-full-name       . <span style="color: #EEDC82;">"Feng Xia"</span> <span style="color: #aebed8;">)</span>
                  <span style="color: #aebed8;">(</span> message-user-organization . <span style="color: #EEDC82;">"Mycompany Inc."</span> <span style="color: #aebed8;">)</span>
                  <span style="color: #aebed8;">(</span> smtpmail-smtp-user . <span style="color: #EEDC82;">"feng.xia@mycompany.io"</span> <span style="color: #aebed8;">)</span>
                  <span style="color: #aebed8;">(</span> smtpmail-default-smtp-server . <span style="color: #EEDC82;">"localhost"</span> <span style="color: #aebed8;">)</span>
                  <span style="color: #aebed8;">(</span> smtpmail-smtp-server . <span style="color: #EEDC82;">"localhost"</span> <span style="color: #aebed8;">)</span>
                  <span style="color: #aebed8;">(</span> smtpmail-smtp-service . 1025 <span style="color: #aebed8;">)</span>
                  <span style="color: #aebed8;">(</span> starttls-use-gnutls . nil<span style="color: #aebed8;">)</span>
                  <span style="color: #aebed8;">(</span> mu4e-compose-reply-to-address . <span style="color: #EEDC82;">"feng.xia@mycompany.io"</span> <span style="color: #aebed8;">)</span>
                  <span style="color: #aebed8;">(</span> mu4e-compose-signature  .
                    <span style="color: #b0b0b3;">(</span>concat
                     <span style="color: #EEDC82;">"Best regards,\n\n"</span>
                     <span style="color: #EEDC82;">"Feng Xia\n\n"</span>
                     <span style="color: #EEDC82;">"W: http://www.mycompany.io</span><span style="color: #FF6C60;">\</span><span style="color: #EEDC82;">(not )"</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>

      ,<span style="color: #b0b1a3;">(</span>make-mu4e-context
         <span style="color: #FF80F4;">:name</span> <span style="color: #EEDC82;">"gmail"</span>
         <span style="color: #FF80F4;">:enter-func</span> <span style="color: #97b098;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #aebed8;">()</span> <span style="color: #aebed8;">(</span>mu4e-message <span style="color: #EEDC82;">"Entering gmail context"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
         <span style="color: #FF80F4;">:leave-func</span> <span style="color: #97b098;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #aebed8;">()</span> <span style="color: #aebed8;">(</span>mu4e-message <span style="color: #EEDC82;">"Leaving gmail context"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
         <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">we match based on the contact-fields of the message</span>
         <span style="color: #FF80F4;">:match-func</span> <span style="color: #97b098;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #aebed8;">(</span>msg<span style="color: #aebed8;">)</span>
                       <span style="color: #aebed8;">(</span><span style="color: #F92672;">when</span> msg
                         <span style="color: #b0b0b3;">(</span>mu4e-message-contact-field-matches msg
                           <span style="color: #FF80F4;">:to</span> <span style="color: #EEDC82;">"fengxia41103@gmail.com"</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
         <span style="color: #FF80F4;">:vars</span> '<span style="color: #97b098;">(</span> <span style="color: #aebed8;">(</span> user-mail-address     . <span style="color: #EEDC82;">"fengxia41103@gmail.com"</span> <span style="color: #aebed8;">)</span>
                  <span style="color: #aebed8;">(</span> user-full-name      . <span style="color: #EEDC82;">"Feng Xia"</span> <span style="color: #aebed8;">)</span>
                    <span style="color: #aebed8;">(</span> smtpmail-smtp-user . <span style="color: #EEDC82;">"fengxia41103@gmail.com"</span> <span style="color: #aebed8;">)</span>
                    <span style="color: #aebed8;">(</span> smtpmail-default-smtp-server . <span style="color: #EEDC82;">"smtp.gmail.com"</span> <span style="color: #aebed8;">)</span>
                    <span style="color: #aebed8;">(</span> smtpmail-smtp-server . <span style="color: #EEDC82;">"smtp.gmail.com"</span> <span style="color: #aebed8;">)</span>
                    <span style="color: #aebed8;">(</span> smtpmail-smtp-service . 587 <span style="color: #aebed8;">)</span>
                    <span style="color: #aebed8;">(</span> starttls-use-gnutls . t<span style="color: #aebed8;">)</span>
                    <span style="color: #aebed8;">(</span> mu4e-compose-reply-to-address . <span style="color: #EEDC82;">"fengxia41103@gmail.com"</span> <span style="color: #aebed8;">)</span>
                    <span style="color: #aebed8;">(</span> message-user-organization . <span style="color: #EEDC82;">"Gmail"</span> <span style="color: #aebed8;">)</span>
                    <span style="color: #aebed8;">(</span> mu4e-compose-signature .
                      <span style="color: #b0b0b3;">(</span>concat
                       <span style="color: #EEDC82;">"Best,\n"</span>
                       <span style="color: #EEDC82;">"feng\n"</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

 <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">set `mu4e-context-policy` and `mu4e-compose-policy` to tweak when mu4e should</span>
 <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">guess or ask the correct context, e.g.</span>

 <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">start with the first (default) context;</span>
 <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">default is to ask-if-none (ask when there's no context yet, and none match)</span>
 <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">(setq mu4e-context-policy 'pick-first)</span>

 <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">compose with the current context is no context matches;</span>
 <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">default is to ask</span>
 <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">(setq mu4e-compose-context-policy nil)</span>
</pre>
</div>
</div>
</div>
