content/downloads/emacs/emacs_setup.org
*** how to get mails
Setup location of my maildir.
#+BEGIN_SRC emacs-lisp
  (setq mu4e-maildir (expand-file-name "~/Maildir"))
#+END_SRC


Sync email by calling =mbsync=:
#+BEGIN_SRC emacs-lisp
  (setq mu4e-get-mail-command "mbsync -a")
#+END_SRC


How often should I check? Value in seconds:
#+BEGIN_SRC emacs-lisp
  (setq mu4e-update-interval 300)
#+END_SRC


Setup some common folders:
#+BEGIN_SRC emacs-lisp
  (setq mu4e-drafts-folder "/drafts"
        mu4e-sent-folder   "/sent"
        mu4e-trash-folder  "/trash")
#+END_SRC


Setup some shortcuts as bookmarks:
#+BEGIN_SRC emacs-lisp
  (add-to-list
   'mu4e-bookmarks
   '("flag:attach"
     "Messages with attachment"
     ?a) t)

  (add-to-list
   'mu4e-bookmarks
   '("size:5M..500M"
     "Big messages"
     ?b) t)

  (add-to-list
   'mu4e-bookmarks
   '("flag:flagged"
     "Flagged messages"
     ?f) t)
#+END_SRC

*** list view
Customize the list view header:
#+BEGIN_SRC emacs-lisp
  (setq mu4e-headers-date-format "%b-%d %a"
        mu4e-headers-fields '((:date . 10)
                              (:flags . 5)
                              (:recipnum . 3)
                              (:from-or-to . 10)
                              (:thread-subject . nil)))
#+END_SRC


Skip duplicates:

#+BEGIN_SRC emacs-lisp
  (setq mu4e-headers-skip-duplicates t)
#+END_SRC


Showing related in a tree fashion so I know the context:

#+BEGIN_SRC emacs-lisp
 (setq mu4e-headers-include-related t)
#+END_SRC


Here is a fun one. I noticed that the email thread grows like that greedy snake
game, a pretty good sign that the team is malfunctioning :) So we add a
displayed number on the number of recipients, and just watch it grow:

#+BEGIN_SRC emacs-lisp
  (add-to-list 'mu4e-header-info-custom
               '(:recipnum .
                           ( :name "Number of recipients"  ;; long name, as seen in the message-view
                                   :shortname "R#"           ;; short name, as seen in the headers view
                                   :help "Number of recipients for this message" ;; tooltip
                                   :function (lambda (msg)
                                               (format "%d"
                                                       (+ (length (mu4e-message-field msg :to))
                                                          (length (mu4e-message-field msg :cc))))))))

#+END_SRC

*** read & attachment
Save attachment to:

#+BEGIN_SRC emacs-lisp
  (setq mu4e-attachment-dir "~/Downloads")
#+END_SRC


To open HTML in browser:

#+BEGIN_SRC emacs-lisp
  (setq mu4e-view-use-gnus t)
  (add-to-list 'mu4e-view-actions
  '("ViewInBrowser" . mu4e-action-view-in-browser) t)
  ;(setq mu4e-html2text-command "html2text -b 72 --mark-code")
#+END_SRC


To open a link in email, press ~g~.

Attempt to show images when viewing messages:

#+BEGIN_SRC emacs-lisp
  (setq mu4e-view-show-images t)
#+END_SRC


Use imagemagick, if available:

#+BEGIN_SRC emacs-lisp
  (when (fboundp 'imagemagick-register-types)
    (imagemagick-register-types))
#+END_SRC

*** write new

My signature line:

#+BEGIN_SRC emacs-lisp :tangle no
  (setq mu4e-compose-signature
        (concat
         "Best regards,\n\n"
         "Feng Xia\n\n"
         "W: http://www.mycompany.io\n"))
#+END_SRC

