content/downloads/emacs/emacs_setup.html

<div id="outline-container-org2853098" class="outline-4">
<h4 id="org2853098"><span class="section-number-4">15.1.5</span> how to get mails</h4>
<div class="outline-text-4" id="text-15-1-5">
<p>
Setup location of my maildir.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> mu4e-maildir <span style="color: #93a8c6;">(</span>expand-file-name <span style="color: #EEDC82;">"~/Maildir"</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Sync email by calling <code>mbsync</code>:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> mu4e-get-mail-command <span style="color: #EEDC82;">"mbsync -a"</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
How often should I check? Value in seconds:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> mu4e-update-interval 300<span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Setup some common folders:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> mu4e-drafts-folder <span style="color: #EEDC82;">"/drafts"</span>
      mu4e-sent-folder   <span style="color: #EEDC82;">"/sent"</span>
      mu4e-trash-folder  <span style="color: #EEDC82;">"/trash"</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Setup some shortcuts as bookmarks:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>add-to-list
 'mu4e-bookmarks
 '<span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"flag:attach"</span>
   <span style="color: #EEDC82;">"Messages with attachment"</span>
   ?a<span style="color: #93a8c6;">)</span> <span style="color: #FF6C60;">t</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span>add-to-list
 'mu4e-bookmarks
 '<span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"size:5M..500M"</span>
   <span style="color: #EEDC82;">"Big messages"</span>
   ?b<span style="color: #93a8c6;">)</span> <span style="color: #FF6C60;">t</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span>add-to-list
 'mu4e-bookmarks
 '<span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"flag:flagged"</span>
   <span style="color: #EEDC82;">"Flagged messages"</span>
   ?f<span style="color: #93a8c6;">)</span> <span style="color: #FF6C60;">t</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org90ac64f" class="outline-4">
<h4 id="org90ac64f"><span class="section-number-4">15.1.6</span> list view</h4>
<div class="outline-text-4" id="text-15-1-6">
<p>
Customize the list view header:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> mu4e-headers-date-format <span style="color: #EEDC82;">"%b-%d %a"</span>
      mu4e-headers-fields '<span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span><span style="color: #FF80F4;">:date</span> . 10<span style="color: #b0b1a3;">)</span>
                            <span style="color: #b0b1a3;">(</span><span style="color: #FF80F4;">:flags</span> . 5<span style="color: #b0b1a3;">)</span>
                            <span style="color: #b0b1a3;">(</span><span style="color: #FF80F4;">:recipnum</span> . 3<span style="color: #b0b1a3;">)</span>
                            <span style="color: #b0b1a3;">(</span><span style="color: #FF80F4;">:from-or-to</span> . 10<span style="color: #b0b1a3;">)</span>
                            <span style="color: #b0b1a3;">(</span><span style="color: #FF80F4;">:thread-subject</span> . nil<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Skip duplicates:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> mu4e-headers-skip-duplicates t<span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Showing related in a tree fashion so I know the context:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> mu4e-headers-include-related t<span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Here is a fun one. I noticed that the email thread grows like that greedy snake
game, a pretty good sign that the team is malfunctioning :) So we add a
displayed number on the number of recipients, and just watch it grow:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>add-to-list 'mu4e-header-info-custom
             '<span style="color: #93a8c6;">(</span><span style="color: #FF80F4;">:recipnum</span> .
                         <span style="color: #b0b1a3;">(</span> <span style="color: #FF80F4;">:name</span> <span style="color: #EEDC82;">"Number of recipients"</span>  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">long name, as seen in the message-view</span>
                                 <span style="color: #FF80F4;">:shortname</span> <span style="color: #EEDC82;">"R#"</span>           <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">short name, as seen in the headers view</span>
                                 <span style="color: #FF80F4;">:help</span> <span style="color: #EEDC82;">"Number of recipients for this message"</span> <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">tooltip</span>
                                 <span style="color: #FF80F4;">:function</span> <span style="color: #97b098;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #aebed8;">(</span>msg<span style="color: #aebed8;">)</span>
                                             <span style="color: #aebed8;">(</span>format <span style="color: #EEDC82;">"%d"</span>
                                                     <span style="color: #b0b0b3;">(</span>+ <span style="color: #90a890;">(</span>length <span style="color: #a2b6da;">(</span>mu4e-message-field msg <span style="color: #FF80F4;">:to</span><span style="color: #a2b6da;">)</span><span style="color: #90a890;">)</span>
                                                        <span style="color: #90a890;">(</span>length <span style="color: #a2b6da;">(</span>mu4e-message-field msg <span style="color: #FF80F4;">:cc</span><span style="color: #a2b6da;">)</span><span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org242988b" class="outline-4">
<h4 id="org242988b"><span class="section-number-4">15.1.7</span> read &amp; attachment</h4>
<div class="outline-text-4" id="text-15-1-7">
<p>
Save attachment to:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> mu4e-attachment-dir <span style="color: #EEDC82;">"~/Downloads"</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
To open HTML in browser:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> mu4e-view-use-gnus t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-to-list 'mu4e-view-actions
'<span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"ViewInBrowser"</span> . mu4e-action-view-in-browser<span style="color: #93a8c6;">)</span> t<span style="color: #8c8c8c;">)</span>
<span style="color: #8C8C8C;">;</span><span style="color: #696969; font-style: italic;">(setq mu4e-html2text-command "html2text -b 72 --mark-code")</span>
</pre>
</div>


<p>
To open a link in email, press <code>g</code>.
</p>

<p>
Attempt to show images when viewing messages:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> mu4e-view-show-images t<span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Use imagemagick, if available:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">when</span> <span style="color: #93a8c6;">(</span>fboundp 'imagemagick-register-types<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>imagemagick-register-types<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org282ec0f" class="outline-4">
<h4 id="org282ec0f"><span class="section-number-4">15.1.8</span> write new</h4>
<div class="outline-text-4" id="text-15-1-8">
<p>
My signature line:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> mu4e-compose-signature
      <span style="color: #93a8c6;">(</span>concat
       <span style="color: #EEDC82;">"Best regards,\n\n"</span>
       <span style="color: #EEDC82;">"Feng Xia\n\n"</span>
       <span style="color: #EEDC82;">"W: http://www.mycompany.io\n"</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
