content/downloads/emacs/emacs_setup.el

(setq mu4e-maildir (expand-file-name "~/Maildir"))

(setq mu4e-get-mail-command "mbsync -a")

(setq mu4e-update-interval 300)

(setq mu4e-drafts-folder "/drafts"
      mu4e-sent-folder   "/sent"
      mu4e-trash-folder  "/trash")

(add-to-list
 'mu4e-bookmarks
 '("flag:attach"
   "Messages with attachment"
   ?a) t)

(add-to-list
 'mu4e-bookmarks
 '("size:5M..500M"
   "Big messages"
   ?b) t)

(add-to-list
 'mu4e-bookmarks
 '("flag:flagged"
   "Flagged messages"
   ?f) t)

(setq mu4e-headers-date-format "%b-%d %a"
      mu4e-headers-fields '((:date . 10)
                            (:flags . 5)
                            (:recipnum . 3)
                            (:from-or-to . 10)
                            (:thread-subject . nil)))

(setq mu4e-headers-skip-duplicates t)

(setq mu4e-headers-include-related t)

(add-to-list 'mu4e-header-info-custom
             '(:recipnum .
                         ( :name "Number of recipients"  ;; long name, as seen in the message-view
                                 :shortname "R#"           ;; short name, as seen in the headers view
                                 :help "Number of recipients for this message" ;; tooltip
                                 :function (lambda (msg)
                                             (format "%d"
                                                     (+ (length (mu4e-message-field msg :to))
                                                        (length (mu4e-message-field msg :cc))))))))

(setq mu4e-attachment-dir "~/Downloads")

(setq mu4e-view-use-gnus t)
(add-to-list 'mu4e-view-actions
'("ViewInBrowser" . mu4e-action-view-in-browser) t)
;(setq mu4e-html2text-command "html2text -b 72 --mark-code")

(setq mu4e-view-show-images t)

(when (fboundp 'imagemagick-register-types)
  (imagemagick-register-types))

(setq mu4e-compose-signature
      (concat
       "Best regards,\n\n"
       "Feng Xia\n\n"
       "W: http://www.mycompany.io\n"))
