content/downloads/emacs/emacs_setup.org
*** send
Sending email is to use SMTP. Here I'm showing to use the company one
through =davmail= which runs smtp listen on port =1025=. You can also
use Gmail/hotmail:

#+BEGIN_SRC emacs-lisp
  ;;(use-package smtpmail
  ;;  :ensure t
  ;;  :config
  ;;)
  ;; user-mail-address "feng.xia@mycompany.io"
  ;; smtpmail-smtp-user "feng.xia@mycompany.io"
  ;; smtpmail-default-smtp-server "localhost"
  ;; smtpmail-smtp-service 1025
  ;; starttls-use-gnutls nil
    (setq send-mail-function 'smtpmail-send-it
          smtpmail-debug-info t
          smtpmail-auth-credentials (expand-file-name "~/.authinfo")
          smtpmail-stream-type nil
          starttls-extra-arguments nil)
#+END_SRC


There is a toggle where you can queue the sending email first instead
of sending to server immediately. This is useful for travel when you
just write, then queue, then when reconnected to the internect, send.

#+BEGIN_SRC emacs-lisp
  (setq smtpmail-queue-mail nil
        smtpmail-queue-dir "~/Maildir/queue/cur")
#+END_SRC

*** reply
When replying an email, auto fill in my info:

#+BEGIN_SRC emacs-lisp
  ;; mu4e-compose-reply-to-address "feng.xia@mycompany.io"
  ;; user-mail-address "feng.xia@mycompany.io"
  ;; user-full-name "Feng Xia"
  ;; message-signature  (concat
  ;;                     "Feng Xia\n\n"
  ;;                     "W: http://www.mycompany.io\n")
  (setq
          message-citation-line-format "On %Y-%m-%d %H:%M:%S, %f wrote:"
          message-citation-line-function 'message-insert-formatted-citation-line
          mu4e-headers-results-limit 500)
#+END_SRC

*** kill all buffer upon exit
mu4e can open a lot of writing buffers. Just kill them all when we exit mu4e:

#+BEGIN_SRC emacs-lisp
  (setq message-kill-buffer-on-exit t)
#+END_SRC

*** write html
Emacs doesn't like html email body. Nor do I. But one thing I found
out is that markdown mode table will look terrible as plain text on
receiving end. There are a couple ways to work around.

**** write in org

So we now write email in org mode, then call =M-x org-mime-htmlize= to
convert either the whole buffer or a region to html before sending:

#+BEGIN_SRC emacs-lisp
  (use-package org-mime
    :ensure
    :config
    (setq org-mime-export-ascii 'utf-8))
#+END_SRC

