content/downloads/emacs/emacs_setup.html

<div id="outline-container-org2618fc3" class="outline-4">
<h4 id="org2618fc3"><span class="section-number-4">15.1.9</span> send</h4>
<div class="outline-text-4" id="text-15-1-9">
<p>
Sending email is to use SMTP. Here I'm showing to use the company one
through <code>davmail</code> which runs smtp listen on port <code>1025</code>. You can also
use Gmail/hotmail:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8C8C8C;">;;</span><span style="color: #696969; font-style: italic;">(use-package smtpmail</span>
<span style="color: #8C8C8C;">;;  </span><span style="color: #696969; font-style: italic;">:ensure t</span>
<span style="color: #8C8C8C;">;;  </span><span style="color: #696969; font-style: italic;">:config</span>
<span style="color: #8C8C8C;">;;</span><span style="color: #696969; font-style: italic;">)</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">user-mail-address "feng.xia@mycompany.io"</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">smtpmail-smtp-user "feng.xia@mycompany.io"</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">smtpmail-default-smtp-server "localhost"</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">smtpmail-smtp-service 1025</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">starttls-use-gnutls nil</span>
  <span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> send-mail-function 'smtpmail-send-it
        smtpmail-debug-info t
        smtpmail-auth-credentials <span style="color: #93a8c6;">(</span>expand-file-name <span style="color: #EEDC82;">"~/.authinfo"</span><span style="color: #93a8c6;">)</span>
        smtpmail-stream-type nil
        starttls-extra-arguments nil<span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
There is a toggle where you can queue the sending email first instead
of sending to server immediately. This is useful for travel when you
just write, then queue, then when reconnected to the internect, send.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> smtpmail-queue-mail nil
      smtpmail-queue-dir <span style="color: #EEDC82;">"~/Maildir/queue/cur"</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org02168b0" class="outline-4">
<h4 id="org02168b0"><span class="section-number-4">15.1.10</span> reply</h4>
<div class="outline-text-4" id="text-15-1-10">
<p>
When replying an email, auto fill in my info:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">mu4e-compose-reply-to-address "feng.xia@mycompany.io"</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">user-mail-address "feng.xia@mycompany.io"</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">user-full-name "Feng Xia"</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">message-signature  (concat</span>
<span style="color: #8C8C8C;">;;                     </span><span style="color: #696969; font-style: italic;">"Feng Xia\n\n"</span>
<span style="color: #8C8C8C;">;;                     </span><span style="color: #696969; font-style: italic;">"W: http://www.mycompany.io\n")</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span>
        message-citation-line-format <span style="color: #EEDC82;">"On %Y-%m-%d %H:%M:%S, %f wrote:"</span>
        message-citation-line-function 'message-insert-formatted-citation-line
        mu4e-headers-results-limit 500<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7388a56" class="outline-4">
<h4 id="org7388a56"><span class="section-number-4">15.1.11</span> kill all buffer upon exit</h4>
<div class="outline-text-4" id="text-15-1-11">
<p>
mu4e can open a lot of writing buffers. Just kill them all when we exit mu4e:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> message-kill-buffer-on-exit t<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org322d6a4" class="outline-4">
<h4 id="org322d6a4"><span class="section-number-4">15.1.12</span> write html</h4>
<div class="outline-text-4" id="text-15-1-12">
<p>
Emacs doesn't like html email body. Nor do I. But one thing I found
out is that markdown mode table will look terrible as plain text on
receiving end. There are a couple ways to work around.
</p>
</div>

<ol class="org-ol">
<li><a id="org6315b60"></a>write in org<br />
<div class="outline-text-5" id="text-15-1-12-1">
<p>
So we now write email in org mode, then call <code>M-x org-mime-htmlize</code> to
convert either the whole buffer or a region to html before sending:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">org-mime</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> org-mime-export-ascii 'utf-8<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>
