content/downloads/emacs/emacs_setup.el

;;(use-package smtpmail
;;  :ensure t
;;  :config
  (setq send-mail-function 'smtpmail-send-it
        user-mail-address "feng.xia@mycompany.io"
        smtpmail-debug-info t
        smtpmail-smtp-user "feng.xia@mycompany.io"
        smtpmail-default-smtp-server "localhost"
        smtpmail-auth-credentials (expand-file-name "~/.authinfo")
        smtpmail-smtp-service 1025
        smtpmail-stream-type nil
        starttls-use-gnutls nil
        starttls-extra-arguments nil)
;;)

(setq smtpmail-queue-mail nil
      smtpmail-queue-dir "~/Maildir/queue/cur")

(setq mu4e-compose-reply-to-address "feng.xia@mycompany.io"
      user-mail-address "feng.xia@mycompany.io"
      user-full-name "Feng Xia"
      message-signature  (concat
                          "Feng Xia\n"

                          "W: http://www.mycompany.io\n")
      message-citation-line-format "On %Y-%m-%d %H:%M:%S, %f wrote:"
      message-citation-line-function 'message-insert-formatted-citation-line
      mu4e-headers-results-limit 500)

(setq message-kill-buffer-on-exit t)

(use-package org-mime
  :ensure
  :config
  (setq org-mime-export-ascii 'utf-8))
