content/downloads/emacs/emacs_setup.html

<li><a id="org22a253a"></a>write in markdown<br />
<div class="outline-text-5" id="text-15-1-12-2">
<p>
How about writing it in markdown? You don't need to do much. Switch to
<code>markdown-mode</code> to write, then switch back to <code>mu4e-compose-mode</code> and
then <code>C-c C-c</code> to send:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">multipart-html-message</span> <span style="color: #93a8c6;">(</span>plain html<span style="color: #93a8c6;">)</span>
  <span style="color: #EEDC82;">"Creates a multipart HTML email with a text part and an html part."</span>
  <span style="color: #93a8c6;">(</span>concat <span style="color: #EEDC82;">"&lt;#multipart type=alternative&gt;\n"</span>
          <span style="color: #EEDC82;">"&lt;#part type=text/plain&gt;"</span>
          plain
          <span style="color: #EEDC82;">"&lt;#part type=text/html&gt;\n"</span>
          html
          <span style="color: #EEDC82;">"&lt;#/multipart&gt;\n"</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">convert-message-to-markdown</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #EEDC82;">"Convert the message in the current buffer to a multipart HTML email.</span>

<span style="color: #EEDC82;">The HTML is rendered by treating the message content as Markdown."</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">interactive</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">unless</span> <span style="color: #b0b1a3;">(</span>executable-find <span style="color: #EEDC82;">"pandoc"</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #FF6C60;">error</span> <span style="color: #EEDC82;">"Pandoc not found, unable to convert message"</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">let*</span> <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>begin
          <span style="color: #aebed8;">(</span><span style="color: #F92672;">save-excursion</span>
            <span style="color: #b0b0b3;">(</span>goto-char <span style="color: #90a890;">(</span>point-min<span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span>
            <span style="color: #b0b0b3;">(</span>search-forward mail-header-separator<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
         <span style="color: #97b098;">(</span>end <span style="color: #aebed8;">(</span>point-max<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
         <span style="color: #97b098;">(</span>html-buf <span style="color: #aebed8;">(</span>generate-new-buffer <span style="color: #EEDC82;">"*mail-md-output*"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
         <span style="color: #97b098;">(</span>exit-code
          <span style="color: #aebed8;">(</span>call-process-region begin end <span style="color: #EEDC82;">"pandoc"</span> nil html-buf nil
                               <span style="color: #EEDC82;">"--quiet"</span> <span style="color: #EEDC82;">"-f"</span> <span style="color: #EEDC82;">"gfm"</span> <span style="color: #EEDC82;">"-t"</span> <span style="color: #EEDC82;">"html"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
         <span style="color: #97b098;">(</span>html <span style="color: #aebed8;">(</span>format <span style="color: #EEDC82;">"&lt;html&gt;\n&lt;head&gt;&lt;/head&gt;\n&lt;body&gt;\n%s\n&lt;/body&gt;&lt;/html&gt;\n"</span>
                <span style="color: #b0b0b3;">(</span><span style="color: #F92672;">with-current-buffer</span> html-buf
                  <span style="color: #90a890;">(</span>buffer-substring <span style="color: #a2b6da;">(</span>point-min<span style="color: #a2b6da;">)</span> <span style="color: #a2b6da;">(</span>point-max<span style="color: #a2b6da;">)</span><span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
         <span style="color: #97b098;">(</span>raw-body <span style="color: #aebed8;">(</span>buffer-substring begin end<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">when</span> <span style="color: #97b098;">(</span>not <span style="color: #aebed8;">(</span>= exit-code 0<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
      <span style="color: #97b098;">(</span><span style="color: #FF6C60;">error</span> <span style="color: #EEDC82;">"Markdown conversion failed, see %s"</span> <span style="color: #aebed8;">(</span>buffer-name html-buf<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">with-current-buffer</span> html-buf
      <span style="color: #97b098;">(</span>set-buffer-modified-p nil<span style="color: #97b098;">)</span>
      <span style="color: #97b098;">(</span>kill-buffer<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span>undo-boundary<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span>delete-region begin end<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">save-excursion</span>
      <span style="color: #97b098;">(</span>goto-char begin<span style="color: #97b098;">)</span>
      <span style="color: #97b098;">(</span>newline<span style="color: #97b098;">)</span>
      <span style="color: #97b098;">(</span>insert <span style="color: #aebed8;">(</span>multipart-html-message raw-body html<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">message-md-send</span> <span style="color: #93a8c6;">(</span><span style="color: #66D9EF;">&amp;optional</span> arg<span style="color: #93a8c6;">)</span>
  <span style="color: #EEDC82;">"Convert the current buffer and send it.</span>
<span style="color: #EEDC82;">If given prefix arg ARG, skips markdown conversion."</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">interactive</span> <span style="color: #EEDC82;">"P"</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">unless</span> arg
    <span style="color: #b0b1a3;">(</span>convert-message-to-markdown<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>message-send<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">message-md-send-and-exit</span> <span style="color: #93a8c6;">(</span><span style="color: #66D9EF;">&amp;optional</span> arg<span style="color: #93a8c6;">)</span>
  <span style="color: #EEDC82;">"Convert the current buffer and send it, then exit from mail buffer.</span>
<span style="color: #EEDC82;">If given prefix arg ARG, skips markdown conversion."</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">interactive</span> <span style="color: #EEDC82;">"P"</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">unless</span> arg
    <span style="color: #b0b1a3;">(</span>convert-message-to-markdown<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>message-send-and-exit<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">with-eval-after-load</span> 'message
 <span style="color: #93a8c6;">(</span>define-key message-mode-map <span style="color: #b0b1a3;">(</span>kbd <span style="color: #EEDC82;">"C-c C-s"</span><span style="color: #b0b1a3;">)</span> #'message-md-send<span style="color: #93a8c6;">)</span>
 <span style="color: #93a8c6;">(</span>define-key message-mode-map <span style="color: #b0b1a3;">(</span>kbd <span style="color: #EEDC82;">"C-c C-c"</span><span style="color: #b0b1a3;">)</span> #'message-md-send-and-exit<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org501f18c" class="outline-4">
<h4 id="org501f18c"><span class="section-number-4">15.1.13</span> capture to org</h4>
<div class="outline-text-4" id="text-15-1-13">
<p>
It is possible to capture an email to org as todo shown <a href="https://www.djcbsoftware.nl/code/mu/mu4e/Org_002dmode-links.html">here</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>define-key mu4e-headers-mode-map <span style="color: #93a8c6;">(</span>kbd <span style="color: #EEDC82;">"C-c c"</span><span style="color: #93a8c6;">)</span> 'mu4e-org-store-and-capture<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>define-key mu4e-view-mode-map    <span style="color: #93a8c6;">(</span>kbd <span style="color: #EEDC82;">"C-c c"</span><span style="color: #93a8c6;">)</span> 'mu4e-org-store-and-capture<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
</div>
