content/downloads/emacs/emacs_setup.el

(defun multipart-html-message (plain html)
  "Creates a multipart HTML email with a text part and an html part."
  (concat "<#multipart type=alternative>\n"
          "<#part type=text/plain>"
          plain
          "<#part type=text/html>\n"
          html
          "<#/multipart>\n"))

(defun convert-message-to-markdown ()
  "Convert the message in the current buffer to a multipart HTML email.

The HTML is rendered by treating the message content as Markdown."
  (interactive)
  (unless (executable-find "pandoc")
    (error "Pandoc not found, unable to convert message"))
  (let* ((begin
          (save-excursion
            (goto-char (point-min))
            (search-forward mail-header-separator)))
         (end (point-max))
         (html-buf (generate-new-buffer "*mail-md-output*"))
         (exit-code
          (call-process-region begin end "pandoc" nil html-buf nil
                               "--quiet" "-f" "gfm" "-t" "html"))
         (html (format "<html>\n<head></head>\n<body>\n%s\n</body></html>\n"
                (with-current-buffer html-buf
                  (buffer-substring (point-min) (point-max)))))
         (raw-body (buffer-substring begin end)))
    (when (not (= exit-code 0))
      (error "Markdown conversion failed, see %s" (buffer-name html-buf)))
    (with-current-buffer html-buf
      (set-buffer-modified-p nil)
      (kill-buffer))
    (undo-boundary)
    (delete-region begin end)
    (save-excursion
      (goto-char begin)
      (newline)
      (insert (multipart-html-message raw-body html)))))

(defun message-md-send (&optional arg)
  "Convert the current buffer and send it.
If given prefix arg ARG, skips markdown conversion."
  (interactive "P")
  (unless arg
    (convert-message-to-markdown))
  (message-send))

(defun message-md-send-and-exit (&optional arg)
  "Convert the current buffer and send it, then exit from mail buffer.
If given prefix arg ARG, skips markdown conversion."
  (interactive "P")
  (unless arg
    (convert-message-to-markdown))
  (message-send-and-exit))

(with-eval-after-load 'message
 (define-key message-mode-map (kbd "C-c C-s") #'message-md-send)
 (define-key message-mode-map (kbd "C-c C-c") #'message-md-send-and-exit))
