content/downloads/emacs/emacs_setup.org
** slack

Install slack client. It's a bit involved to get token and cookie, and *you need
both*!

#+BEGIN_SRC emacs-lisp :tangle no
(use-package slack
  :ensure t
  :defer 4
  :init (make-directory "/tmp/emacs-slack-images/" t)
  :bind (:map slack-mode-map
              (("@" . slack-message-embed-mention)
               ("#" . slack-message-embed-channel)))
  :custom
  (slack-buffer-emojify t)
  (slack-prefer-current-team t)
  (slack-image-file-directory "/tmp/emacs-slack-images/")
  (slack-buffer-create-on-notify t)
  (slack-thread-also-send-to-room t)
  :config
    (slack-register-team
     :name "mycompanyio"
     :default t
     :token (auth-source-pick-first-password
             :host "mycompanyio.slack.com"
             :user "feng.xia@mycompany.io^token")
     :cookie (auth-source-pick-first-password
             :host "mycompanyio.slack.com"
             :user "feng.xia@mycompany.io^cookie")
     :subscribed-channels '((eng-chat software_dev))
     :full-and-display-names t)
    (add-to-list 'org-agenda-files "~/workspace/me/org/slack.org"))

;; global start slack
 (slack-start)

;; display a nice timestamp in slack
(setq lui-time-stamp-format "[%Y-%m-%d %H:%M]")
(setq lui-time-stamp-only-when-changed-p t)
(setq lui-time-stamp-position 'right)
(setq lui-time-stamp-face '((t (:foreground "light gray" :weight normal))))
#+END_SRC

Add a hydra:

#+BEGIN_SRC emacs-lisp :tangle no
(global-set-key (kbd "C-c <f3>")
  (defhydra slack-hydra (:hint nil)
    "
      Channel: _c_:channel _l_:update
      Message: _i_:im _u_:update _r_:reaction _e_:edit msg _M-p_:prev _M-n_:next
        Slack: _S_:start _C_: leave
        _q_:cancel
    "


    ("c" slack-channel-select "channel")
    ("l" slack-channel-list-update "channel update")

    ("i" slack-im-select "im")
    ("u" slack-im-list-update "im update")
    ("r" slack-message-add-reaction "reaction")
    ("e" slack-message-edit "edit msg")
    ("M-p" slack-buffer-goto-prev-message)
    ("M-n" slack-buffer-goto-next-message)

    ("S" slack-start "Start")
    ("C" slack-ws-close "Leave")

    ("q"  nil "cancel" :color yellow)))
#+END_SRC

Add alert:

#+BEGIN_SRC emacs-lisp :tangle no
(use-package alert
  :commands (alert)
  :init
  (setq alert-default-style 'libnotify)
)
#+END_SRC


Add slack new msg alert, and add it to an org file.

#+BEGIN_SRC emacs-lisp :tangle no
(use-package alert
  :ensure t
  :init
  (alert-define-style
   'my/alert-style :title
   "Make Org headings for messages I receive - Style"
   :notifier
   (lambda (info)
     (when (get-buffer "slack.org") (with-current-buffer "slack.org" (save-buffer)))
     (write-region
      (s-concat
       "* TODO "
       (plist-get info :title)
       " : "
       (format
        "%s %s :slack:"
        (plist-get info :title)
        (s-truncate 127 (plist-get info :message)))
       "\n"
       (format "\n <%s>" (format-time-string "%Y-%m-%d %H:%M"))
       "\n"
       (plist-get info :message)
       "\n")
      nil
      "~/workspace/me/org/slack.org"
      t)))
  (setq alert-default-style 'message)
  (add-to-list 'alert-user-configuration
               '(((:category . "slack")) my/alert-style nil)))

#+END_SRC

