content/downloads/emacs/emacs_setup.html



<div id="outline-container-org8081f53" class="outline-3">
<h3 id="org8081f53"><span class="section-number-3">15.2</span> slack</h3>
<div class="outline-text-3" id="text-15-2">
<p>
Install slack client. It's a bit involved to get token and cookie, and <b>you need
both</b>!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">slack</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:defer</span> 4
  <span style="color: #FF80F4;">:init</span> <span style="color: #93a8c6;">(</span>make-directory <span style="color: #EEDC82;">"/tmp/emacs-slack-images/"</span> t<span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:bind</span> <span style="color: #93a8c6;">(</span><span style="color: #FF80F4;">:map</span> slack-mode-map
              <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span><span style="color: #EEDC82;">"@"</span> . slack-message-embed-mention<span style="color: #97b098;">)</span>
               <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"#"</span> . slack-message-embed-channel<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:custom</span>
  <span style="color: #93a8c6;">(</span>slack-buffer-emojify t<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>slack-prefer-current-team t<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>slack-image-file-directory <span style="color: #EEDC82;">"/tmp/emacs-slack-images/"</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>slack-buffer-create-on-notify t<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>slack-thread-also-send-to-room t<span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:config</span>
    <span style="color: #93a8c6;">(</span>slack-register-team
     <span style="color: #FF80F4;">:name</span> <span style="color: #EEDC82;">"mycompanyio"</span>
     <span style="color: #FF80F4;">:default</span> t
     <span style="color: #FF80F4;">:token</span> <span style="color: #b0b1a3;">(</span>auth-source-pick-first-password
             <span style="color: #FF80F4;">:host</span> <span style="color: #EEDC82;">"mycompanyio.slack.com"</span>
             <span style="color: #FF80F4;">:user</span> <span style="color: #EEDC82;">"feng.xia@mycompany.io^token"</span><span style="color: #b0b1a3;">)</span>
     <span style="color: #FF80F4;">:cookie</span> <span style="color: #b0b1a3;">(</span>auth-source-pick-first-password
             <span style="color: #FF80F4;">:host</span> <span style="color: #EEDC82;">"mycompanyio.slack.com"</span>
             <span style="color: #FF80F4;">:user</span> <span style="color: #EEDC82;">"feng.xia@mycompany.io^cookie"</span><span style="color: #b0b1a3;">)</span>
     <span style="color: #FF80F4;">:subscribed-channels</span> '<span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>eng-chat software_dev<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
     <span style="color: #FF80F4;">:full-and-display-names</span> t<span style="color: #93a8c6;">)</span>
    <span style="color: #93a8c6;">(</span>add-to-list 'org-agenda-files <span style="color: #EEDC82;">"~/workspace/me/org/slack.org"</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">global start slack</span>
 <span style="color: #8c8c8c;">(</span>slack-start<span style="color: #8c8c8c;">)</span>

<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">display a nice timestamp in slack</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> lui-time-stamp-format <span style="color: #EEDC82;">"[%Y-%m-%d %H:%M]"</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> lui-time-stamp-only-when-changed-p t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> lui-time-stamp-position 'right<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> lui-time-stamp-face '<span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span>t <span style="color: #97b098;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"light gray"</span> <span style="color: #FF80F4;">:weight</span> normal<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
Add a hydra:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #93a8c6;">(</span>kbd <span style="color: #EEDC82;">"C-c &lt;f3&gt;"</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">defhydra</span> slack-hydra <span style="color: #b0b1a3;">(</span><span style="color: #FF80F4;">:hint</span> nil<span style="color: #b0b1a3;">)</span>
    <span style="color: #EEDC82;">"</span>
<span style="color: #EEDC82;">      Channel: _c_:channel _l_:update</span>
<span style="color: #EEDC82;">      Message: _i_:im _u_:update _r_:reaction _e_:edit msg _M-p_:prev _M-n_:next</span>
<span style="color: #EEDC82;">        Slack: _S_:start _C_: leave</span>
<span style="color: #EEDC82;">        _q_:cancel</span>
<span style="color: #EEDC82;">    "</span>


    <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"c"</span> slack-channel-select <span style="color: #EEDC82;">"channel"</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"l"</span> slack-channel-list-update <span style="color: #EEDC82;">"channel update"</span><span style="color: #b0b1a3;">)</span>

    <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"i"</span> slack-im-select <span style="color: #EEDC82;">"im"</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"u"</span> slack-im-list-update <span style="color: #EEDC82;">"im update"</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"r"</span> slack-message-add-reaction <span style="color: #EEDC82;">"reaction"</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"e"</span> slack-message-edit <span style="color: #EEDC82;">"edit msg"</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"M-p"</span> slack-buffer-goto-prev-message<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"M-n"</span> slack-buffer-goto-next-message<span style="color: #b0b1a3;">)</span>

    <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"S"</span> slack-start <span style="color: #EEDC82;">"Start"</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C"</span> slack-ws-close <span style="color: #EEDC82;">"Leave"</span><span style="color: #b0b1a3;">)</span>

    <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"q"</span>  nil <span style="color: #EEDC82;">"cancel"</span> <span style="color: #FF80F4;">:color</span> yellow<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
Add alert:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">alert</span>
  <span style="color: #FF80F4;">:commands</span> <span style="color: #93a8c6;">(</span>alert<span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:init</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> alert-default-style 'libnotify<span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Add slack new msg alert, and add it to an org file.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">alert</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:init</span>
  <span style="color: #93a8c6;">(</span>alert-define-style
   'my/alert-style <span style="color: #FF80F4;">:title</span>
   <span style="color: #EEDC82;">"Make Org headings for messages I receive - Style"</span>
   <span style="color: #FF80F4;">:notifier</span>
   <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #97b098;">(</span>info<span style="color: #97b098;">)</span>
     <span style="color: #97b098;">(</span><span style="color: #F92672;">when</span> <span style="color: #aebed8;">(</span>get-buffer <span style="color: #EEDC82;">"slack.org"</span><span style="color: #aebed8;">)</span> <span style="color: #aebed8;">(</span><span style="color: #F92672;">with-current-buffer</span> <span style="color: #EEDC82;">"slack.org"</span> <span style="color: #b0b0b3;">(</span>save-buffer<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
     <span style="color: #97b098;">(</span>write-region
      <span style="color: #aebed8;">(</span>s-concat
       <span style="color: #EEDC82;">"* TODO "</span>
       <span style="color: #b0b0b3;">(</span>plist-get info <span style="color: #FF80F4;">:title</span><span style="color: #b0b0b3;">)</span>
       <span style="color: #EEDC82;">" : "</span>
       <span style="color: #b0b0b3;">(</span>format
        <span style="color: #EEDC82;">"%s %s :slack:"</span>
        <span style="color: #90a890;">(</span>plist-get info <span style="color: #FF80F4;">:title</span><span style="color: #90a890;">)</span>
        <span style="color: #90a890;">(</span>s-truncate 127 <span style="color: #a2b6da;">(</span>plist-get info <span style="color: #FF80F4;">:message</span><span style="color: #a2b6da;">)</span><span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span>
       <span style="color: #EEDC82;">"\n"</span>
       <span style="color: #b0b0b3;">(</span>format <span style="color: #EEDC82;">"\n &lt;%s&gt;"</span> <span style="color: #90a890;">(</span>format-time-string <span style="color: #EEDC82;">"%Y-%m-%d %H:%M"</span><span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span>
       <span style="color: #EEDC82;">"\n"</span>
       <span style="color: #b0b0b3;">(</span>plist-get info <span style="color: #FF80F4;">:message</span><span style="color: #b0b0b3;">)</span>
       <span style="color: #EEDC82;">"\n"</span><span style="color: #aebed8;">)</span>
      nil
      <span style="color: #EEDC82;">"~/workspace/me/org/slack.org"</span>
      t<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> alert-default-style 'message<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>add-to-list 'alert-user-configuration
               '<span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:category</span> . <span style="color: #EEDC82;">"slack"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span> my/alert-style nil<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

</pre>
</div>
</div>
</div>
</div>
