content/downloads/emacs/emacs_setup.org
* Hobbies
** elfeed

Read news:
#+BEGIN_SRC emacs-lisp
  (use-package elfeed
    :ensure
    :config)
  (setq elfeed-feeds
        '(("http://rss.slashdot.org/Slashdot/slashdotMain" dev)
          ("https://fengxia41103.github.io/myblog/feeds/all.atom.xml" me)))
#+END_SRC

** taskjuggler
#+BEGIN_SRC emacs-lisp
  (use-package tj3-mode
    :ensure t
    :after org-plus-contrib
    :config
    (require 'ox-taskjuggler)
    (custom-set-variables
     '(org-taskjuggler-process-command "/usr/local/bin/tj3 --silent --no-color --output-dir %o %f")
     '(org-taskjuggler-project-tag "PRJ")))
#+END_SRC

* My doc writing

Writing doc is painful, not because I don't like writing, but because
I hate WORD. So I have been trying all kinds of things to generate PDF
and have people accept my PDF. I used to write simply in LaTex,
plain. Then of course there is the big-org which can be converted. But
since I have been writing a lot of Markdown for my blogs, I don't feel
like converting all my writings into `.org` just fo the sake of org
mode. So instead, I have had success in writing the Pandoc version of
Markdown for my two Lenovo reference architecture papers, and I think
it gives me more control of the LaTex template, the CSS file I can
customize, and so on. So I'll stick to it for now.

** pandoc

#+BEGIN_SRC emacs-lisp
  (use-package pandoc-mode
    :ensure)
  (add-hook 'pandoc-mode-hook 'pandoc-load-default-settings)
#+END_SRC

* The big Org

Org-mode is, overwhelming! It can do a lot, and it takes a long time
for me to understand what it does (and what it doesn't). Part of this
config in org mode is just the way to force myself to learn org mdoe
and write things in org mode. I haven't yet taken full advantage of
its TODO capability. Well, one day.

** init

If variable =org-directory= is not set yet, map it to my home's
files. You may set this in the =~/.emacs= to another value,
e.g. =(setq org-directory "/ssh:fleury@machine.site.com:OrgFiles")=

*** NEXT This does not seem to work, check out doc about [[https://stackoverflow.com/questions/3806423/how-can-i-get-a-variables-initial-value-in-elisp][defcustom]]
:LOGBOOK:
- State "NEXT"       from              [2019-06-24 Mon 10:10]
:END:

#+BEGIN_SRC emacs-lisp
  (use-package org
    :ensure nil
    :delight org-mode
    :config
    :hook ((org-mode . visual-line-mode)
           (org-mode . variable-pitch-mode)
           (org-mode . org-indent-mode)))

#+END_SRC

** others

Don't know what they belong to. Just stuck them here. There are some functions
used by the following code. So unfortunately this section must comes in early.

*** by packages
**** org-protocol

Let other tools use emacs client to interact

#+BEGIN_SRC emacs-lisp
  (require 'org-protocol)
#+END_SRC

**** org-board
Archive entire sites locally with `wget`.

#+BEGIN_SRC emacs-lisp
  (use-package org-board
    :ensure t
    :config
    (global-set-key (kbd "C-c o") org-board-keymap))
#+END_SRC

**** image (M-I)

Make the display of images a simple key-stroke away.

#+BEGIN_SRC emacs-lisp
  (defun paf/org-toggle-iimage-in-org ()
    "display images in your org file"
    (interactive)
    (if (face-underline-p 'org-link)
        (set-face-underline 'org-link nil)
      (set-face-underline 'org-link t))
    (iimage-mode 'toggle))

  (use-package iimage
    :config
    (add-to-list 'iimage-mode-image-regex-alist
                 (cons (concat "\\[\\[file:\\(~?" iimage-mode-image-filename-regex
                               "\\)\\]")  1))
    (add-hook 'org-mode-hook (lambda ()
                               ;; display images
                               (local-set-key "\M-I" 'paf/org-toggle-iimage-in-org)
                              )))
#+END_SRC

*** snippets found online

Some helper snippets found online.

