content/downloads/emacs/emacs_setup.html

<div id="outline-container-org6b2c87f" class="outline-2">
<h2 id="org6b2c87f"><span class="section-number-2">16</span> Hobbies</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-org9e8806c" class="outline-3">
<h3 id="org9e8806c"><span class="section-number-3">16.1</span> elfeed</h3>
<div class="outline-text-3" id="text-16-1">
<p>
Read news:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">elfeed</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:config</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> elfeed-feeds
      '<span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"http://rss.slashdot.org/Slashdot/slashdotMain"</span> dev<span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"https://fengxia41103.github.io/myblog/feeds/all.atom.xml"</span> me<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd95ce28" class="outline-3">
<h3 id="orgd95ce28"><span class="section-number-3">16.2</span> taskjuggler</h3>
<div class="outline-text-3" id="text-16-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">tj3-mode</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:after</span> org-plus-contrib
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">require</span> '<span style="color: #FF80F4;">ox-taskjuggler</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>custom-set-variables
   '<span style="color: #b0b1a3;">(</span>org-taskjuggler-process-command <span style="color: #EEDC82;">"/usr/local/bin/tj3 --silent --no-color --output-dir %o %f"</span><span style="color: #b0b1a3;">)</span>
   '<span style="color: #b0b1a3;">(</span>org-taskjuggler-project-tag <span style="color: #EEDC82;">"PRJ"</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org804ba92" class="outline-2">
<h2 id="org804ba92"><span class="section-number-2">17</span> My doc writing</h2>
<div class="outline-text-2" id="text-17">
<p>
Writing doc is painful, not because I don't like writing, but because
I hate WORD. So I have been trying all kinds of things to generate PDF
and have people accept my PDF. I used to write simply in LaTex,
plain. Then of course there is the big-org which can be converted. But
since I have been writing a lot of Markdown for my blogs, I don't feel
like converting all my writings into `.org` just fo the sake of org
mode. So instead, I have had success in writing the Pandoc version of
Markdown for my two Lenovo reference architecture papers, and I think
it gives me more control of the LaTex template, the CSS file I can
customize, and so on. So I'll stick to it for now.
</p>
</div>

<div id="outline-container-org89ddb04" class="outline-3">
<h3 id="org89ddb04"><span class="section-number-3">17.1</span> pandoc</h3>
<div class="outline-text-3" id="text-17-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">pandoc-mode</span>
  <span style="color: #FF80F4;">:ensure</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'pandoc-mode-hook 'pandoc-load-default-settings<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge9eee46" class="outline-2">
<h2 id="orge9eee46"><span class="section-number-2">18</span> The big Org</h2>
<div class="outline-text-2" id="text-18">
<p>
Org-mode is, overwhelming! It can do a lot, and it takes a long time
for me to understand what it does (and what it doesn't). Part of this
config in org mode is just the way to force myself to learn org mdoe
and write things in org mode. I haven't yet taken full advantage of
its TODO capability. Well, one day.
</p>
</div>

<div id="outline-container-org2402b51" class="outline-3">
<h3 id="org2402b51"><span class="section-number-3">18.1</span> init</h3>
<div class="outline-text-3" id="text-18-1">
<p>
If variable <code>org-directory</code> is not set yet, map it to my home's
files. You may set this in the <code>~/.emacs</code> to another value,
e.g. <code>(setq org-directory "/ssh:fleury@machine.site.com:OrgFiles")</code>
</p>
</div>

<div id="outline-container-org7ca50e1" class="outline-4">
<h4 id="org7ca50e1"><span class="section-number-4">18.1.1</span> NEXT This does not seem to work, check out doc about <a href="https://stackoverflow.com/questions/3806423/how-can-i-get-a-variables-initial-value-in-elisp">defcustom</a></h4>
<div class="outline-text-4" id="text-18-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">org</span>
  <span style="color: #FF80F4;">:ensure</span> nil
  <span style="color: #FF80F4;">:delight</span> org-mode
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #FF80F4;">:hook</span> <span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span>org-mode . visual-line-mode<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span>org-mode . variable-pitch-mode<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span>org-mode . org-indent-mode<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfdd192f" class="outline-3">
<h3 id="orgfdd192f"><span class="section-number-3">18.2</span> others</h3>
<div class="outline-text-3" id="text-18-2">
<p>
Don't know what they belong to. Just stuck them here. There are some functions
used by the following code. So unfortunately this section must comes in early.
</p>
</div>

<div id="outline-container-org4aa53fa" class="outline-4">
<h4 id="org4aa53fa"><span class="section-number-4">18.2.1</span> by packages</h4>
<div class="outline-text-4" id="text-18-2-1">
</div>
<ol class="org-ol">
<li><a id="orge2cd681"></a>org-protocol<br />
<div class="outline-text-5" id="text-18-2-1-1">
<p>
Let other tools use emacs client to interact
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">require</span> '<span style="color: #FF80F4;">org-protocol</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orga8f76ff"></a>org-board<br />
<div class="outline-text-5" id="text-18-2-1-2">
<p>
Archive entire sites locally with `wget`.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">org-board</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span>global-set-key <span style="color: #b0b1a3;">(</span>kbd <span style="color: #EEDC82;">"C-c o"</span><span style="color: #b0b1a3;">)</span> org-board-keymap<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org848500d"></a>image (M-I)<br />
<div class="outline-text-5" id="text-18-2-1-3">
<p>
Make the display of images a simple key-stroke away.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">paf/org-toggle-iimage-in-org</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #EEDC82;">"display images in your org file"</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">interactive</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">if</span> <span style="color: #b0b1a3;">(</span>face-underline-p 'org-link<span style="color: #b0b1a3;">)</span>
      <span style="color: #b0b1a3;">(</span>set-face-underline 'org-link nil<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span>set-face-underline 'org-link t<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>iimage-mode 'toggle<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">iimage</span>
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span>add-to-list 'iimage-mode-image-regex-alist
               <span style="color: #b0b1a3;">(</span>cons <span style="color: #97b098;">(</span>concat <span style="color: #EEDC82;">"\\[\\[file:</span><span style="color: #A63A62;">\\</span><span style="color: #A63A62;">(</span><span style="color: #EEDC82;">~?"</span> iimage-mode-image-filename-regex
                             <span style="color: #EEDC82;">"</span><span style="color: #A63A62;">\\</span><span style="color: #A63A62;">)</span><span style="color: #EEDC82;">\\]"</span><span style="color: #97b098;">)</span>  <span style="color: #FF6C60;">1</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>add-hook 'org-mode-hook <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #97b098;">()</span>
                             <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">display images</span>
                             <span style="color: #97b098;">(</span>local-set-key <span style="color: #EEDC82;">"\M-I"</span> 'paf/org-toggle-iimage-in-org<span style="color: #97b098;">)</span>
                            <span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org27305a3" class="outline-4">
<h4 id="org27305a3"><span class="section-number-4">18.2.2</span> snippets found online</h4>
<div class="outline-text-4" id="text-18-2-2">
<p>
Some helper snippets found online.
</p>
</div>

<ol class="org-ol">
