content/downloads/emacs/emacs_setup.el

(use-package elfeed
  :ensure
  :config)
(setq elfeed-feeds
      '(("http://rss.slashdot.org/Slashdot/slashdotMain" dev)
        ("https://fengxia41103.github.io/myblog/feeds/all.atom.xml" me)))

(use-package tj3-mode
  :ensure t
  :after org-plus-contrib
  :config
  (require 'ox-taskjuggler)
  (custom-set-variables
   '(org-taskjuggler-process-command "/usr/local/bin/tj3 --silent --no-color --output-dir %o %f")
   '(org-taskjuggler-project-tag "PRJ")))

(use-package pandoc-mode
  :ensure)
(add-hook 'pandoc-mode-hook 'pandoc-load-default-settings)
