content/downloads/emacs/emacs_setup.html
<li><a id="org6bdd7ab"></a>Open remote org dir<br />
<div class="outline-text-5" id="text-18-2-2-1">
<p>
In your <code>.emacs</code> just add this to configure the location:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> remote-org-directory <span style="color: #EEDC82;">"/ssh:fleury@my.hostname.com:OrgFiles"</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
Then you can use the keyboard shortcut to open that dir.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defcustom</span> <span style="color: #FD971F;">remote-org-directory</span> <span style="color: #EEDC82;">"~/OrgFiles"</span>
  <span style="color: #EEDC82;">"Location of remove OrgFile directory, should you have one."</span>
  <span style="color: #FF80F4;">:type</span> 'string
  <span style="color: #FF80F4;">:group</span> 'paf<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">paf/open-remote-org-directory</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">interactive</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>find-file remote-org-directory<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #93a8c6;">(</span>kbd <span style="color: #EEDC82;">"C-M-x r o"</span><span style="color: #93a8c6;">)</span> 'paf/open-remote-org-directory<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org8bc81a8"></a>Org-relative file function<br />
<div class="outline-text-5" id="text-18-2-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">org-relative-file</span> <span style="color: #93a8c6;">(</span>filename<span style="color: #93a8c6;">)</span>
  <span style="color: #EEDC82;">"Compute an expanded absolute file path for org files"</span>
  <span style="color: #93a8c6;">(</span>expand-file-name filename org-directory<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orga3c2e76"></a>Adjust tags on the right<br />
<div class="outline-text-5" id="text-18-2-2-3">
<p>
Dynamically adjust tag position <a href="https://orgmode.org/worg/org-hacks.html#org0560357">source on worg</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">ba/org-adjust-tags-column-reset-tags</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #EEDC82;">"In org-mode buffers it will reset tag position according to</span>
<span style="color: #EEDC82;">`</span><span style="color: #FF80F4;">org-tags-column</span><span style="color: #EEDC82;">'."</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">when</span> <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">and</span>
         <span style="color: #97b098;">(</span>not <span style="color: #aebed8;">(</span>string= <span style="color: #b0b0b3;">(</span>buffer-name<span style="color: #b0b0b3;">)</span> <span style="color: #EEDC82;">"*Remember*"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
         <span style="color: #97b098;">(</span>eql major-mode 'org-mode<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">let</span> <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>b-m-p <span style="color: #b0b0b3;">(</span>buffer-modified-p<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
      <span style="color: #97b098;">(</span><span style="color: #F92672;">condition-case</span> nil
          <span style="color: #aebed8;">(</span><span style="color: #F92672;">save-excursion</span>
            <span style="color: #b0b0b3;">(</span>goto-char <span style="color: #90a890;">(</span>point-min<span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span>
            <span style="color: #b0b0b3;">(</span>command-execute 'outline-next-visible-heading<span style="color: #b0b0b3;">)</span>
            <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">disable (message) that org-set-tags generates</span>
            <span style="color: #b0b0b3;">(</span><span style="color: #F92672;">cl-letf</span> <span style="color: #90a890;">(</span><span style="color: #a2b6da;">(</span><span style="color: #9cb6ad;">(</span>symbol-function 'message<span style="color: #9cb6ad;">)</span> #'format<span style="color: #a2b6da;">)</span><span style="color: #90a890;">)</span>
              <span style="color: #90a890;">(</span>org-set-tags 1 t<span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span>
            <span style="color: #b0b0b3;">(</span>set-buffer-modified-p b-m-p<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
        <span style="color: #aebed8;">(</span><span style="color: #FF6C60;">error</span> nil<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">ba/org-adjust-tags-column-now</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #EEDC82;">"Right-adjust `</span><span style="color: #FF80F4;">org-tags-column</span><span style="color: #EEDC82;">' value, then reset tag position."</span>
  <span style="color: #93a8c6;">(</span>set <span style="color: #b0b1a3;">(</span>make-local-variable 'org-tags-column<span style="color: #b0b1a3;">)</span>
       <span style="color: #b0b1a3;">(</span>- <span style="color: #97b098;">(</span>- <span style="color: #aebed8;">(</span>window-width<span style="color: #aebed8;">)</span> <span style="color: #aebed8;">(</span>length org-ellipsis<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>ba/org-adjust-tags-column-reset-tags<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">ba/org-adjust-tags-column-maybe</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #EEDC82;">"If `</span><span style="color: #FF80F4;">ba/org-adjust-tags-column</span><span style="color: #EEDC82;">' is set to non-nil, adjust tags."</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">when</span> ba/org-adjust-tags-column
    <span style="color: #b0b1a3;">(</span>ba/org-adjust-tags-column-now<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">ba/org-adjust-tags-column-before-save</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #EEDC82;">"Tags need to be left-adjusted when saving."</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">when</span> ba/org-adjust-tags-column
     <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">setq</span> org-tags-column 1<span style="color: #b0b1a3;">)</span>
     <span style="color: #b0b1a3;">(</span>ba/org-adjust-tags-column-reset-tags<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">ba/org-adjust-tags-column-after-save</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #EEDC82;">"Revert left-adjusted tag position done by before-save hook."</span>
  <span style="color: #93a8c6;">(</span>ba/org-adjust-tags-column-maybe<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>set-buffer-modified-p nil<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">between invoking org-refile and displaying the prompt (which</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">triggers window-configuration-change-hook) tags might adjust,</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">which invalidates the org-refile cache</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defadvice</span> <span style="color: #A6E22E;">org-refile</span> <span style="color: #93a8c6;">(</span>around org-refile-disable-adjust-tags<span style="color: #93a8c6;">)</span>
  <span style="color: #EEDC82;">"Disable dynamically adjusting tags"</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">let</span> <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>ba/org-adjust-tags-column nil<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    ad-do-it<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>ad-activate 'org-refile<span style="color: #8c8c8c;">)</span>

<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Now set it up</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> ba/org-adjust-tags-column t<span style="color: #8c8c8c;">)</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">automatically align tags on right-hand side</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">TODO(fleury): Does not seem to work as of 2017/12/18</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Seems to work again 2018/11/01</span>
<span style="color: #8c8c8c;">(</span>add-hook 'window-configuration-change-hook
          'ba/org-adjust-tags-column-maybe<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'before-save-hook 'ba/org-adjust-tags-column-before-save<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'after-save-hook 'ba/org-adjust-tags-column-after-save<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'org-agenda-mode-hook <span style="color: #93a8c6;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #b0b1a3;">()</span>
                                  <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">setq</span> org-agenda-tags-column <span style="color: #97b098;">(</span>- <span style="color: #aebed8;">(</span>window-width<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="orga89cdaf"></a><span class="todo TODO">TODO</span> Update <code>org-set-tags-to</code><br />
<div class="outline-text-6" id="text-18-2-2-3-1">
<p>
<a href="https://orgmode.org/worg/doc.html#org-set-tags-to"><code>org-set-tags-to</code></a> is gone, and <code>org-set-tags</code> with &gt; 1 args is not working.
Not sure what to replace it with though&#x2026;
</p>
</div>
</li>
</ol>
</li>
