content/downloads/emacs/emacs_setup.org
**** Preserve structure in archives

Make sure archiving preserves the same tree structure, including when
archiving subtrees.  [[https://orgmode.org/worg/org-hacks.html#org4265b4c][source on org]]

#+BEGIN_SRC emacs-lisp
(defun my-org-inherited-no-file-tags ()
  (let ((tags (org-entry-get nil "ALLTAGS" 'selective))
        (ltags (org-entry-get nil "TAGS")))
    (mapc (lambda (tag)
            (setq tags
                  (replace-regexp-in-string (concat tag ":") "" tags)))
          (append org-file-tags (when ltags (split-string ltags ":" t))))
    (if (string= ":" tags) nil tags)))
#+END_SRC

This used to work, but =org-extract-archive-file= is no longer defined.

#+BEGIN_SRC emacs-lisp :tangle no
(defadvice org-archive-subtree
    (around my-org-archive-subtree-low-level activate)
  (let ((tags (my-org-inherited-no-file-tags))
        (org-archive-location
         (if (save-excursion (org-back-to-heading)
                             (> (org-outline-level) 1))
             (concat (car (split-string org-archive-location "::"))
                     "::* "
                     (car (org-get-outline-path)))
           org-archive-location)))
    ad-do-it
    (with-current-buffer (find-file-noselect (org-extract-archive-file))
      (save-excursion
        (while (org-up-heading-safe))
        (org-set-tags tags)))))
#+END_SRC
**** Properties collector (default: off)

Collect properties into tables. See documentation in the file.

#+BEGIN_SRC emacs-lisp :tangle no
  (load-file "~/Emacs/org-collector.el")
#+END_SRC

**** access org file remotely via SSH

Let's bind this to a key, so I can open remote dirs. I suually put
this in my =.emacs= as it is host- and user-specific.

#+BEGIN_SRC emacs-lisp :tangle no
(defun paf/open-remote-org-dir ()
  (interactive)
  (dired "/ssh:remote.host.com:org"))

(global-set-key (kbd "C-M-x r o") 'paf/open-remote-org-dir)
#+END_SRC

**** bash command
#+BEGIN_SRC emacs-lisp
  (setq org-babel-sh-command "bash")
#+END_SRC

**** OrgRoam templates

#+BEGIN_SRC emacs-lisp
  (setq org-roam-capture-templates
        `(("m" "Meeting" entry (function org-roam--capture-get-point)
               "* %?\n%U\n%^{with}\n"
               :file-name "meeting/%<%Y%m%d%H%M%S>-${slug}"
               :head "#+title: ${title}\n#+roam_tags: %^{with}\n\n"
               )))

#+END_SRC

** key mappings

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-c l") 'org-store-link)
  (global-set-key (kbd "C-c c") 'org-capture)
  (global-set-key (kbd "C-c a") 'org-agenda)
  (global-set-key (kbd "C-c b") 'org-iswitchb)

  (add-hook 'org-mode-hook
            (lambda ()
              (local-set-key (kbd "C-<up>") 'org-move-subtree-up)
              (local-set-key (kbd "C-<down>") 'org-move-subtree-down)
              (local-set-key (kbd "C-c C-l") 'org-insert-link)))

#+END_SRC

** display settings
Some config for display. Some of these are borrowed from [[https://zzamboni.org/post/beautifying-org-mode-in-emacs/][here]]:

#+BEGIN_SRC emacs-lisp
  (setq org-hide-leading-stars t)

  ;; auto log a clock when task is closed
  (setq org-log-done t)

  (setq org-startup-indented t)
  (setq org-startup-folded t)
  (setq org-ellipsis "...")
  (setq org-hide-emphasis-markers t)
#+END_SRC

