content/downloads/emacs/emacs_setup.html

<li><a id="orgddfaf0c"></a>Preserve structure in archives<br />
<div class="outline-text-5" id="text-18-2-2-4">
<p>
Make sure archiving preserves the same tree structure, including when
archiving subtrees.  <a href="https://orgmode.org/worg/org-hacks.html#org4265b4c">source on org</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">my-org-inherited-no-file-tags</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">let</span> <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>tags <span style="color: #aebed8;">(</span>org-entry-get nil <span style="color: #EEDC82;">"ALLTAGS"</span> 'selective<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
        <span style="color: #97b098;">(</span>ltags <span style="color: #aebed8;">(</span>org-entry-get nil <span style="color: #EEDC82;">"TAGS"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span>mapc <span style="color: #97b098;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #aebed8;">(</span>tag<span style="color: #aebed8;">)</span>
            <span style="color: #aebed8;">(</span><span style="color: #F92672;">setq</span> tags
                  <span style="color: #b0b0b3;">(</span>replace-regexp-in-string <span style="color: #90a890;">(</span>concat tag <span style="color: #EEDC82;">":"</span><span style="color: #90a890;">)</span> <span style="color: #EEDC82;">""</span> tags<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
          <span style="color: #97b098;">(</span>append org-file-tags <span style="color: #aebed8;">(</span><span style="color: #F92672;">when</span> ltags <span style="color: #b0b0b3;">(</span>split-string ltags <span style="color: #EEDC82;">":"</span> t<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">if</span> <span style="color: #97b098;">(</span>string= <span style="color: #EEDC82;">":"</span> tags<span style="color: #97b098;">)</span> nil tags<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
This used to work, but <code>org-extract-archive-file</code> is no longer defined.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defadvice</span> <span style="color: #A6E22E;">org-archive-subtree</span>
    <span style="color: #93a8c6;">(</span>around my-org-archive-subtree-low-level activate<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">let</span> <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>tags <span style="color: #aebed8;">(</span>my-org-inherited-no-file-tags<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
        <span style="color: #97b098;">(</span>org-archive-location
         <span style="color: #aebed8;">(</span><span style="color: #F92672;">if</span> <span style="color: #b0b0b3;">(</span><span style="color: #F92672;">save-excursion</span> <span style="color: #90a890;">(</span>org-back-to-heading<span style="color: #90a890;">)</span>
                             <span style="color: #90a890;">(</span>&gt; <span style="color: #a2b6da;">(</span>org-outline-level<span style="color: #a2b6da;">)</span> 1<span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span>
             <span style="color: #b0b0b3;">(</span>concat <span style="color: #90a890;">(</span>car <span style="color: #a2b6da;">(</span>split-string org-archive-location <span style="color: #EEDC82;">"::"</span><span style="color: #a2b6da;">)</span><span style="color: #90a890;">)</span>
                     <span style="color: #EEDC82;">"::* "</span>
                     <span style="color: #90a890;">(</span>car <span style="color: #a2b6da;">(</span>org-get-outline-path<span style="color: #a2b6da;">)</span><span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span>
           org-archive-location<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    ad-do-it
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">with-current-buffer</span> <span style="color: #97b098;">(</span>find-file-noselect <span style="color: #aebed8;">(</span>org-extract-archive-file<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
      <span style="color: #97b098;">(</span><span style="color: #F92672;">save-excursion</span>
        <span style="color: #aebed8;">(</span><span style="color: #F92672;">while</span> <span style="color: #b0b0b3;">(</span>org-up-heading-safe<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
        <span style="color: #aebed8;">(</span>org-set-tags tags<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="orgddbe299"></a>Properties collector (default: off)<br />
<div class="outline-text-5" id="text-18-2-2-5">
<p>
Collect properties into tables. See documentation in the file.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>load-file <span style="color: #EEDC82;">"~/Emacs/org-collector.el"</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org6596203"></a>access org file remotely via SSH<br />
<div class="outline-text-5" id="text-18-2-2-6">
<p>
Let's bind this to a key, so I can open remote dirs. I suually put
this in my <code>.emacs</code> as it is host- and user-specific.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">paf/open-remote-org-dir</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">interactive</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>dired <span style="color: #EEDC82;">"/ssh:remote.host.com:org"</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #93a8c6;">(</span>kbd <span style="color: #EEDC82;">"C-M-x r o"</span><span style="color: #93a8c6;">)</span> 'paf/open-remote-org-dir<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org58f92b8"></a>bash command<br />
<div class="outline-text-5" id="text-18-2-2-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-babel-sh-command <span style="color: #EEDC82;">"bash"</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org48779ac"></a>OrgRoam templates<br />
<div class="outline-text-5" id="text-18-2-2-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-roam-capture-templates
      `<span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"m"</span> <span style="color: #EEDC82;">"Meeting"</span> entry <span style="color: #97b098;">(</span><span style="color: #F92672;">function</span> org-roam--capture-get-point<span style="color: #97b098;">)</span>
             <span style="color: #EEDC82;">"* %?\n%U\n%^{with}\n"</span>
             <span style="color: #FF80F4;">:file-name</span> <span style="color: #EEDC82;">"meeting/%&lt;%Y%m%d%H%M%S&gt;-${slug}"</span>
             <span style="color: #FF80F4;">:head</span> <span style="color: #EEDC82;">"#+title: ${title}\n#+roam_tags: %^{with}\n\n"</span>
             <span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

</pre>
</div>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-orgff6c1af" class="outline-3">
<h3 id="orgff6c1af"><span class="section-number-3">18.3</span> key mappings</h3>
<div class="outline-text-3" id="text-18-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #93a8c6;">(</span>kbd <span style="color: #EEDC82;">"C-c l"</span><span style="color: #93a8c6;">)</span> 'org-store-link<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #93a8c6;">(</span>kbd <span style="color: #EEDC82;">"C-c c"</span><span style="color: #93a8c6;">)</span> 'org-capture<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #93a8c6;">(</span>kbd <span style="color: #EEDC82;">"C-c a"</span><span style="color: #93a8c6;">)</span> 'org-agenda<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #93a8c6;">(</span>kbd <span style="color: #EEDC82;">"C-c b"</span><span style="color: #93a8c6;">)</span> 'org-iswitchb<span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span>add-hook 'org-mode-hook
          <span style="color: #93a8c6;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #b0b1a3;">()</span>
            <span style="color: #b0b1a3;">(</span>local-set-key <span style="color: #97b098;">(</span>kbd <span style="color: #EEDC82;">"C-&lt;up&gt;"</span><span style="color: #97b098;">)</span> 'org-move-subtree-up<span style="color: #b0b1a3;">)</span>
            <span style="color: #b0b1a3;">(</span>local-set-key <span style="color: #97b098;">(</span>kbd <span style="color: #EEDC82;">"C-&lt;down&gt;"</span><span style="color: #97b098;">)</span> 'org-move-subtree-down<span style="color: #b0b1a3;">)</span>
            <span style="color: #b0b1a3;">(</span>local-set-key <span style="color: #97b098;">(</span>kbd <span style="color: #EEDC82;">"C-c C-l"</span><span style="color: #97b098;">)</span> 'org-insert-link<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org9dd3d9c" class="outline-3">
<h3 id="org9dd3d9c"><span class="section-number-3">18.4</span> display settings</h3>
<div class="outline-text-3" id="text-18-4">
<p>
Some config for display. Some of these are borrowed from <a href="https://zzamboni.org/post/beautifying-org-mode-in-emacs/">here</a>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-hide-leading-stars t<span style="color: #8c8c8c;">)</span>

<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">auto log a clock when task is closed</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-log-done t<span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-startup-indented t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-startup-folded t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-ellipsis <span style="color: #EEDC82;">"..."</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-hide-emphasis-markers t<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
