content/downloads/emacs/emacs_setup.html

<div id="outline-container-org3b42cf4" class="outline-4">
<h4 id="org3b42cf4"><span class="section-number-4">18.4.1</span> org-bullets</h4>
<div class="outline-text-4" id="text-18-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">org-bullets</span>
  <span style="color: #FF80F4;">:ensure</span>
  <span style="color: #FF80F4;">:hook</span> <span style="color: #93a8c6;">(</span>org-mode . org-bullets-mode<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org414bdee" class="outline-4">
<h4 id="org414bdee"><span class="section-number-4">18.4.2</span> headline font</h4>
<div class="outline-text-4" id="text-18-4-2">
<p>
This will make headline and text body different font size.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">let*</span> <span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span>variable-tuple
          <span style="color: #97b098;">(</span><span style="color: #F92672;">cond</span> <span style="color: #aebed8;">(</span><span style="color: #b0b0b3;">(</span>x-list-fonts <span style="color: #EEDC82;">"ETBembo"</span><span style="color: #b0b0b3;">)</span>         '<span style="color: #b0b0b3;">(</span><span style="color: #FF80F4;">:font</span> <span style="color: #EEDC82;">"ETBembo"</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
                <span style="color: #aebed8;">(</span><span style="color: #b0b0b3;">(</span>x-list-fonts <span style="color: #EEDC82;">"Source Sans Pro"</span><span style="color: #b0b0b3;">)</span> '<span style="color: #b0b0b3;">(</span><span style="color: #FF80F4;">:font</span> <span style="color: #EEDC82;">"Source Sans Pro"</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
                <span style="color: #aebed8;">(</span><span style="color: #b0b0b3;">(</span>x-list-fonts <span style="color: #EEDC82;">"Lucida Grande"</span><span style="color: #b0b0b3;">)</span>   '<span style="color: #b0b0b3;">(</span><span style="color: #FF80F4;">:font</span> <span style="color: #EEDC82;">"Lucida Grande"</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
                <span style="color: #aebed8;">(</span><span style="color: #b0b0b3;">(</span>x-list-fonts <span style="color: #EEDC82;">"Verdana"</span><span style="color: #b0b0b3;">)</span>         '<span style="color: #b0b0b3;">(</span><span style="color: #FF80F4;">:font</span> <span style="color: #EEDC82;">"Verdana"</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
                <span style="color: #aebed8;">(</span><span style="color: #b0b0b3;">(</span>x-family-fonts <span style="color: #EEDC82;">"Sans Serif"</span><span style="color: #b0b0b3;">)</span>    '<span style="color: #b0b0b3;">(</span><span style="color: #FF80F4;">:family</span> <span style="color: #EEDC82;">"Sans Serif"</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
                <span style="color: #aebed8;">(</span>nil <span style="color: #b0b0b3;">(</span><span style="color: #FF6C60;">warn</span> <span style="color: #EEDC82;">"Cannot find a Sans Serif Font.  Install Source Sans Pro."</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span>headline           `<span style="color: #97b098;">(</span><span style="color: #FF80F4;">:inherit</span> default <span style="color: #FF80F4;">:weight</span> bold <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"#F5F5F5"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>

    <span style="color: #93a8c6;">(</span>custom-theme-set-faces
     'user
     `<span style="color: #b0b1a3;">(</span>org-level-8 <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>t <span style="color: #b0b0b3;">(</span>,@headline ,@variable-tuple<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
     `<span style="color: #b0b1a3;">(</span>org-level-7 <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>t <span style="color: #b0b0b3;">(</span>,@headline ,@variable-tuple<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
     `<span style="color: #b0b1a3;">(</span>org-level-6 <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>t <span style="color: #b0b0b3;">(</span>,@headline ,@variable-tuple<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
     `<span style="color: #b0b1a3;">(</span>org-level-5 <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>t <span style="color: #b0b0b3;">(</span>,@headline ,@variable-tuple<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
     `<span style="color: #b0b1a3;">(</span>org-level-4 <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>t <span style="color: #b0b0b3;">(</span>,@headline ,@variable-tuple <span style="color: #FF80F4;">:height</span> 1.0<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
     `<span style="color: #b0b1a3;">(</span>org-level-3 <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>t <span style="color: #b0b0b3;">(</span>,@headline ,@variable-tuple <span style="color: #FF80F4;">:height</span> 1.1 <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"#FEB236"</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
     `<span style="color: #b0b1a3;">(</span>org-level-2 <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>t <span style="color: #b0b0b3;">(</span>,@headline ,@variable-tuple <span style="color: #FF80F4;">:height</span> 1.2 <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"burleywood"</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
     `<span style="color: #b0b1a3;">(</span>org-level-1 <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>t <span style="color: #b0b0b3;">(</span>,@headline ,@variable-tuple <span style="color: #FF80F4;">:height</span> 1.3<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
     `<span style="color: #b0b1a3;">(</span>org-document-title <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>t <span style="color: #b0b0b3;">(</span>,@headline ,@variable-tuple <span style="color: #FF80F4;">:height</span> 1.5 <span style="color: #FF80F4;">:underline</span> nil<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
