content/downloads/emacs/emacs_setup.org
*** custom font
Tweaks to customize font faces in org found [[https://zzamboni.org/post/beautifying-org-mode-in-emacs/][here]]:

#+BEGIN_SRC emacs-lisp
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(default ((t (:background nil))))
 '(aw-leading-char-face ((t (:inherit ace-jump-face-foreground :foreground "#D52349" :height 1000 :overline t :box nil))))
 '(fixed-pitch ((t (:family "Fira Code" :height 140))))
 '(font-lock-comment-face ((t (:foreground "dim gray" :slant oblique))))
 '(highlight ((t (:background "forest green"))))
 '(magit-branch-current ((t (:foreground "red" :box 1 :weight bold :height 2.0))))
 '(magit-branch-local ((t (:foreground "tomato" :weight bold))))
 '(magit-branch-remote ((t (:foreground "yellow"))))
 '(magit-diff-context-highlight ((t (:background "#ffffff" :foreground "dim gray"))))
 '(magit-diff-file-heading-highlight ((t (:background "#ffffff" :foreground "black" :weight bold))))
 '(magit-diff-hunk-heading ((t (:background "gainsboro" :foreground "tomato"))))
 '(magit-diff-hunk-heading-highlight ((t (:background "DarkGoldenrod3" :foreground "black"))))
 '(magit-diff-revision-summary ((t (:inherit magit-diff-hunk-heading :foreground "black"))))
 '(magit-diff-revision-summary-highlight ((t (:foreground "gold"))))
 '(magit-section-heading-selection ((t (:foreground "dark red" :weight bold))))
 '(magit-section-highlight ((t (:background "tan4"))))
 '(markdown-code-face ((t (:background "gray10"))))
 '(org-agenda-current-time ((t (:inherit org-time-grid :foreground "yellow" :weight bold))))
 '(org-agenda-date ((t (:inherit org-agenda-structure :background "pale green" :foreground "black" :weight bold))))
 '(org-agenda-date-weekend ((t (:inherit org-agenda-date :background "light blue" :weight bold))))
 '(org-block ((t (:inherit fixed-pitch :foreground "light gray"))))
 '(org-block-background ((t (:background "gray10"))))
 '(org-block-begin-line ((t (:underline "#A7A6AA" :foreground "GreenYellow" :background "gray30" :extend t))))
 '(org-block-end-line ((t (:underline "#A7A6AA" :foreground "GreenYellow" :background "gray30" :extend t))))
 '(org-bold ((t (:foreground "#d52349"))))
 '(org-code ((t (:inherit (shadow fixed-pitch) :foreground "tomato"))))
 '(org-document-info ((t (:foreground "dark orange"))))
 '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
 '(org-document-title ((t (:inherit default :weight bold :foreground "#F5F5F5" :family "Sans Serif" :height 1.5 :underline nil))))
 '(org-indent ((t (:inherit (org-hide fixed-pitch)))))
 '(org-level-1 ((t (:inherit default :weight bold :foreground "#F5F5F5" :height 1.3))))
 '(org-level-2 ((t (:inherit default :weight bold :foreground "seashell" :height 1.2))))
 '(org-level-3 ((t (:inherit default :weight bold :height 1.1 :foreground "#FEB236"))))
 '(org-level-4 ((t (:inherit default :weight bold :foreground "#F5F5F5"))))
 '(org-level-5 ((t (:inherit default :weight bold :foreground "#F5F5F5"))))
 '(org-level-6 ((t (:inherit default :weight bold :foreground "#F5F5F5"))))
 '(org-level-7 ((t (:inherit default :weight bold :foreground "#F5F5F5"))))
 '(org-level-8 ((t (:inherit default :weight bold :foreground "#F5F5F5"))))
 '(org-link ((t (:inherit fixed-pitch :foreground "royal blue" :underline t))))
 '(org-meta-line ((t (:inherit (font-lock-comment-face fixed-pitch)))))
 '(org-property-value ((t (:inherit fixed-pitch))) t)
 '(org-special-keyword ((t (:inherit (font-lock-comment-face fixed-pitch)))))
 '(org-table ((t (:inherit fixed-pitch :foreground "#83a598"))))
 '(org-tag ((t (:inherit (shadow fixed-pitch) :weight bold))))
 '(org-verbatim ((t (:inherit (shadow fixed-pitch) :foreground "tomato"))))
 '(org-column ((t (:inherit fixed-pitch))))
 '(region ((t (:background "forest green")))))
#+END_SRC

