content/downloads/emacs/emacs_setup.html

<div id="outline-container-orgdc34b5d" class="outline-4">
<h4 id="orgdc34b5d"><span class="section-number-4">18.4.3</span> custom font</h4>
<div class="outline-text-4" id="text-18-4-3">
<p>
Tweaks to customize font faces in org found <a href="https://zzamboni.org/post/beautifying-org-mode-in-emacs/">here</a>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>custom-set-faces
 <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">custom-set-faces was added by Custom.</span>
 <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">If you edit it by hand, you could mess it up, so be careful.</span>
 <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Your init file should contain only one such instance.</span>
 <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">If there is more than one, they won't work right.</span>
 '<span style="color: #93a8c6;">(</span>default <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:background</span> nil<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>aw-leading-char-face <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> ace-jump-face-foreground <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"#D52349"</span> <span style="color: #FF80F4;">:height</span> 1000 <span style="color: #FF80F4;">:overline</span> t <span style="color: #FF80F4;">:box</span> nil<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>fixed-pitch <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:family</span> <span style="color: #EEDC82;">"Fira Code"</span> <span style="color: #FF80F4;">:height</span> 140<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>font-lock-comment-face <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"dim gray"</span> <span style="color: #FF80F4;">:slant</span> oblique<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>highlight <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:background</span> <span style="color: #EEDC82;">"forest green"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>magit-branch-current <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"red"</span> <span style="color: #FF80F4;">:box</span> 1 <span style="color: #FF80F4;">:weight</span> bold <span style="color: #FF80F4;">:height</span> 2.0<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>magit-branch-local <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"tomato"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>magit-branch-remote <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"yellow"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>magit-diff-context-highlight <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:background</span> <span style="color: #EEDC82;">"#ffffff"</span> <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"dim gray"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>magit-diff-file-heading-highlight <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:background</span> <span style="color: #EEDC82;">"#ffffff"</span> <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"black"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>magit-diff-hunk-heading <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:background</span> <span style="color: #EEDC82;">"gainsboro"</span> <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"tomato"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>magit-diff-hunk-heading-highlight <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:background</span> <span style="color: #EEDC82;">"DarkGoldenrod3"</span> <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"black"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>magit-diff-revision-summary <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> magit-diff-hunk-heading <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"black"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>magit-diff-revision-summary-highlight <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"gold"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>magit-section-heading-selection <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"dark red"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>magit-section-highlight <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:background</span> <span style="color: #EEDC82;">"tan4"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>markdown-code-face <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:background</span> <span style="color: #EEDC82;">"gray10"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-agenda-current-time <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> org-time-grid <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"yellow"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-agenda-date <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> org-agenda-structure <span style="color: #FF80F4;">:background</span> <span style="color: #EEDC82;">"pale green"</span> <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"black"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-agenda-date-weekend <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> org-agenda-date <span style="color: #FF80F4;">:background</span> <span style="color: #EEDC82;">"light blue"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-block <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> fixed-pitch <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"light gray"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-block-background <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:background</span> <span style="color: #EEDC82;">"gray10"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-block-begin-line <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:underline</span> <span style="color: #EEDC82;">"#A7A6AA"</span> <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"GreenYellow"</span> <span style="color: #FF80F4;">:background</span> <span style="color: #EEDC82;">"gray30"</span> <span style="color: #FF80F4;">:extend</span> t<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-block-end-line <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:underline</span> <span style="color: #EEDC82;">"#A7A6AA"</span> <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"GreenYellow"</span> <span style="color: #FF80F4;">:background</span> <span style="color: #EEDC82;">"gray30"</span> <span style="color: #FF80F4;">:extend</span> t<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-bold <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"#d52349"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-code <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> <span style="color: #b0b0b3;">(</span>shadow fixed-pitch<span style="color: #b0b0b3;">)</span> <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"tomato"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-document-info <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"dark orange"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-document-info-keyword <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> <span style="color: #b0b0b3;">(</span>shadow fixed-pitch<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-document-title <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> default <span style="color: #FF80F4;">:weight</span> bold <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"#F5F5F5"</span> <span style="color: #FF80F4;">:family</span> <span style="color: #EEDC82;">"Sans Serif"</span> <span style="color: #FF80F4;">:height</span> 1.5 <span style="color: #FF80F4;">:underline</span> nil<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-indent <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> <span style="color: #b0b0b3;">(</span>org-hide fixed-pitch<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-level-1 <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> default <span style="color: #FF80F4;">:weight</span> bold <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"#F5F5F5"</span> <span style="color: #FF80F4;">:height</span> 1.3<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-level-2 <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> default <span style="color: #FF80F4;">:weight</span> bold <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"seashell"</span> <span style="color: #FF80F4;">:height</span> 1.2<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-level-3 <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> default <span style="color: #FF80F4;">:weight</span> bold <span style="color: #FF80F4;">:height</span> 1.1 <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"#FEB236"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-level-4 <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> default <span style="color: #FF80F4;">:weight</span> bold <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"#F5F5F5"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-level-5 <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> default <span style="color: #FF80F4;">:weight</span> bold <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"#F5F5F5"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-level-6 <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> default <span style="color: #FF80F4;">:weight</span> bold <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"#F5F5F5"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-level-7 <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> default <span style="color: #FF80F4;">:weight</span> bold <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"#F5F5F5"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-level-8 <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> default <span style="color: #FF80F4;">:weight</span> bold <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"#F5F5F5"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-link <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> fixed-pitch <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"royal blue"</span> <span style="color: #FF80F4;">:underline</span> t<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-meta-line <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> <span style="color: #b0b0b3;">(</span>font-lock-comment-face fixed-pitch<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-property-value <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> fixed-pitch<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span> t<span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-special-keyword <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> <span style="color: #b0b0b3;">(</span>font-lock-comment-face fixed-pitch<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-table <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> fixed-pitch <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"#83a598"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-tag <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> <span style="color: #b0b0b3;">(</span>shadow fixed-pitch<span style="color: #b0b0b3;">)</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-verbatim <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> <span style="color: #b0b0b3;">(</span>shadow fixed-pitch<span style="color: #b0b0b3;">)</span> <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"tomato"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-column <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> fixed-pitch<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>region <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:background</span> <span style="color: #EEDC82;">"forest green"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
</div>
