content/downloads/emacs/emacs_setup.org
** writing stuff

Part 1, writing stuff such as taking notes.

*** by packages
**** Zetteldeft

This is a note-taking packages inspired by the principles of the
[[https://zettelkasten.de/][Zettelkasteno.]]

#+BEGIN_SRC emacs-lisp
  (use-package deft
    :ensure t)
  (use-package avy
    :ensure t)

  (use-package zetteldeft
    :ensure t
    :after (org deft avy)

    :config
    (setq deft-extensions '("org" "md" "txt"))
    (setq deft-directory (org-relative-file "Zettelkasten"))
    (setq deft-recursive t)

    :bind (("C-c z d" . deft)
           ("C-c z D" . zetteldeft-deft-new-search)
           ("C-c z R" . deft-refresh)
           ("C-c z s" . zetteldeft-search-at-point)
           ("C-c z c" . zetteldeft-search-current-id)
           ("C-c z f" . zetteldeft-follow-link)
           ("C-c z F" . zetteldeft-avy-file-search-ace-window)
           ("C-c z l" . zetteldeft-avy-link-search)
           ("C-c z t" . zetteldeft-avy-tag-search)
           ("C-c z T" . zetteldeft-tag-buffer)
           ("C-c z i" . zetteldeft-find-file-id-insert)
           ("C-c z I" . zetteldeft-find-file-full-title-insert)
           ("C-c z o" . zetteldeft-find-file)
           ("C-c z n" . zetteldeft-new-file)
           ("C-c z N" . zetteldeft-new-file-and-link)
           ("C-c z r" . zetteldeft-file-rename))
  )
#+END_SRC

**** plant-uml

Tell where PlantUML is to be found. This needs to be downloaded and
installed separately, see the [[http://plantuml.com/][PlantUML website]].

#+BEGIN_SRC emacs-lisp
(use-package plantuml-mode
 :ensure t
 :config
  (setq plantuml-jar-path "~/workspace/me/myblog/content/downloads/plantuml.jar")
  (setq org-plantuml-jar-path "~/workspace/me/myblog/content/downloads/plantuml.jar")
  ;; Let us edit PlantUML snippets in plantuml-mode within orgmode
  (add-to-list 'org-src-lang-modes '("plantuml" . plantuml))
  ;; make it load this language (for export ?)
  (org-babel-do-load-languages 'org-babel-load-languages '((plantuml . t)))
  ;; Enable plantuml-mode for PlantUML files
  (add-to-list 'auto-mode-alist '("\\.plantuml\\'" . plantuml-mode)))
#+END_SRC

*** org-link-abbrev

This lets one write links as e.g. [ [b:123457] ]

#+BEGIN_SRC emacs-lisp
(setq org-link-abbrev-alist
      '(("b" . "http://b/")
        ("go" . "http://go/")
        ("cl" . "http://cr/")))
#+END_SRC

*** auto line wrap

Wrap around after 80 columns. The key is auto-fill mode.

#+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook '(lambda () (setq fill-column 80)))
(add-hook 'org-mode-hook 'turn-on-auto-fill)
#+END_SRC

** export

Part 2, exporting.

This is big deal. It took me a while to learn org, and even right now
I still don't know how to use it for schedule management. This feels
like latex, it's wonderful, but not common among non-org-mode folks.

Add a few formats to the export functionality of org-mode.

*** org-babel

What kind of code block languages do I need

#+BEGIN_SRC emacs-lisp
  (setq org-confirm-babel-evaluate 'nil) ; Don't ask before executing

  (org-babel-do-load-languages
   'org-babel-load-languages
   '(
     (R . t)
     (dot . t)
     (emacs-lisp . t)
     (gnuplot . t)
     (python . t)
     ;;(sh . t)
     (latex . t)
     (shell . t)
    ))
#+END_SRC

*** markdown

#+BEGIN_SRC emacs-lisp
  (use-package ox-md
    :defer)
#+END_SRC

*** beamer

#+BEGIN_SRC emacs-lisp
  (use-package ox-beamer
    :defer)
#+END_SRC

