content/downloads/emacs/emacs_setup.html

<div id="outline-container-orga65c399" class="outline-3">
<h3 id="orga65c399"><span class="section-number-3">18.5</span> writing stuff</h3>
<div class="outline-text-3" id="text-18-5">
<p>
Part 1, writing stuff such as taking notes.
</p>
</div>

<div id="outline-container-orga994828" class="outline-4">
<h4 id="orga994828"><span class="section-number-4">18.5.1</span> by packages</h4>
<div class="outline-text-4" id="text-18-5-1">
</div>
<ol class="org-ol">
<li><a id="orga817ffb"></a>Zetteldeft<br />
<div class="outline-text-5" id="text-18-5-1-1">
<p>
This is a note-taking packages inspired by the principles of the
<a href="https://zettelkasten.de/">Zettelkasteno.</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">deft</span>
  <span style="color: #FF80F4;">:ensure</span> t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">avy</span>
  <span style="color: #FF80F4;">:ensure</span> t<span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">zetteldeft</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:after</span> <span style="color: #93a8c6;">(</span>org deft avy<span style="color: #93a8c6;">)</span>

  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> deft-extensions '<span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"org"</span> <span style="color: #EEDC82;">"md"</span> <span style="color: #EEDC82;">"txt"</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> deft-directory <span style="color: #b0b1a3;">(</span>org-relative-file <span style="color: #EEDC82;">"Zettelkasten"</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> deft-recursive t<span style="color: #93a8c6;">)</span>

  <span style="color: #FF80F4;">:bind</span> <span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-c z d"</span> . deft<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-c z D"</span> . zetteldeft-deft-new-search<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-c z R"</span> . deft-refresh<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-c z s"</span> . zetteldeft-search-at-point<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-c z c"</span> . zetteldeft-search-current-id<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-c z f"</span> . zetteldeft-follow-link<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-c z F"</span> . zetteldeft-avy-file-search-ace-window<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-c z l"</span> . zetteldeft-avy-link-search<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-c z t"</span> . zetteldeft-avy-tag-search<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-c z T"</span> . zetteldeft-tag-buffer<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-c z i"</span> . zetteldeft-find-file-id-insert<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-c z I"</span> . zetteldeft-find-file-full-title-insert<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-c z o"</span> . zetteldeft-find-file<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-c z n"</span> . zetteldeft-new-file<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-c z N"</span> . zetteldeft-new-file-and-link<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"C-c z r"</span> . zetteldeft-file-rename<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org3d701f0"></a>plant-uml<br />
<div class="outline-text-5" id="text-18-5-1-2">
<p>
Tell where PlantUML is to be found. This needs to be downloaded and
installed separately, see the <a href="http://plantuml.com/">PlantUML website</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">plantuml-mode</span>
 <span style="color: #FF80F4;">:ensure</span> t
 <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> plantuml-jar-path <span style="color: #EEDC82;">"~/workspace/me/myblog/content/downloads/plantuml.jar"</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> org-plantuml-jar-path <span style="color: #EEDC82;">"~/workspace/me/myblog/content/downloads/plantuml.jar"</span><span style="color: #93a8c6;">)</span>
  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Let us edit PlantUML snippets in plantuml-mode within orgmode</span>
  <span style="color: #93a8c6;">(</span>add-to-list 'org-src-lang-modes '<span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"plantuml"</span> . plantuml<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">make it load this language (for export ?)</span>
  <span style="color: #93a8c6;">(</span>org-babel-do-load-languages 'org-babel-load-languages '<span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>plantuml . t<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Enable plantuml-mode for PlantUML files</span>
  <span style="color: #93a8c6;">(</span>add-to-list 'auto-mode-alist '<span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"\\.plantuml\\'"</span> . plantuml-mode<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org2eeff9f" class="outline-4">
<h4 id="org2eeff9f"><span class="section-number-4">18.5.2</span> org-link-abbrev</h4>
<div class="outline-text-4" id="text-18-5-2">
<p>
This lets one write links as e.g. [ [b:123457] ]
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-link-abbrev-alist
      '<span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"b"</span> . <span style="color: #EEDC82;">"http://b/"</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"go"</span> . <span style="color: #EEDC82;">"http://go/"</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"cl"</span> . <span style="color: #EEDC82;">"http://cr/"</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2f0dd9f" class="outline-4">
<h4 id="org2f0dd9f"><span class="section-number-4">18.5.3</span> auto line wrap</h4>
<div class="outline-text-4" id="text-18-5-3">
<p>
Wrap around after 80 columns. The key is auto-fill mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>add-hook 'org-mode-hook '<span style="color: #93a8c6;">(</span>lambda <span style="color: #b0b1a3;">()</span> <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">setq</span> fill-column 80<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>add-hook 'org-mode-hook 'turn-on-auto-fill<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org659f048" class="outline-3">
<h3 id="org659f048"><span class="section-number-3">18.6</span> export</h3>
<div class="outline-text-3" id="text-18-6">
<p>
Part 2, exporting.
</p>

<p>
This is big deal. It took me a while to learn org, and even right now
I still don't know how to use it for schedule management. This feels
like latex, it's wonderful, but not common among non-org-mode folks.
</p>

<p>
Add a few formats to the export functionality of org-mode.
</p>
</div>

<div id="outline-container-org72964ea" class="outline-4">
<h4 id="org72964ea"><span class="section-number-4">18.6.1</span> org-babel</h4>
<div class="outline-text-4" id="text-18-6-1">
<p>
What kind of code block languages do I need
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-confirm-babel-evaluate 'nil<span style="color: #8c8c8c;">)</span> <span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">Don't ask before executing</span>

<span style="color: #8c8c8c;">(</span>org-babel-do-load-languages
 'org-babel-load-languages
 '<span style="color: #93a8c6;">(</span>
   <span style="color: #b0b1a3;">(</span>R . t<span style="color: #b0b1a3;">)</span>
   <span style="color: #b0b1a3;">(</span>dot . t<span style="color: #b0b1a3;">)</span>
   <span style="color: #b0b1a3;">(</span>emacs-lisp . t<span style="color: #b0b1a3;">)</span>
   <span style="color: #b0b1a3;">(</span>gnuplot . t<span style="color: #b0b1a3;">)</span>
   <span style="color: #b0b1a3;">(</span>python . t<span style="color: #b0b1a3;">)</span>
   <span style="color: #8C8C8C;">;;</span><span style="color: #696969; font-style: italic;">(sh . t)</span>
   <span style="color: #b0b1a3;">(</span>latex . t<span style="color: #b0b1a3;">)</span>
   <span style="color: #b0b1a3;">(</span>shell . t<span style="color: #b0b1a3;">)</span>
  <span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4da5f14" class="outline-4">
<h4 id="org4da5f14"><span class="section-number-4">18.6.2</span> markdown</h4>
<div class="outline-text-4" id="text-18-6-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">ox-md</span>
  <span style="color: #FF80F4;">:defer</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3fcd8c5" class="outline-4">
<h4 id="org3fcd8c5"><span class="section-number-4">18.6.3</span> beamer</h4>
<div class="outline-text-4" id="text-18-6-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">ox-beamer</span>
  <span style="color: #FF80F4;">:defer</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
