content/downloads/emacs/emacs_setup.org
*** org-reveal

You need to install =reveal.js= offline, then specify its path here.
#+BEGIN_SRC emacs-lisp
  (use-package ox-reveal
    :ensure t
    :after (htmlize)
    :config
    (setq org-reveal-root (expand-file-name "~/reveal.js")))

  (use-package htmlize
    :ensure t)
#+END_SRC

*** odt

#+BEGIN_SRC emacs-lisp
  (use-package ox-odt
    :defer)
#+END_SRC

*** taskjuggler

#+BEGIN_SRC emacs-lisp
  (use-package ox-taskjuggler
    :defer)
#+END_SRC

*** confluence
#+BEGIN_SRC emacs-lisp
  (use-package ox-confluence
    :defer)
#+END_SRC

** managing life (aka. agenda/todo)

Part 3 of org, managing TODOs.


*** where are my agenda files

#+begin_src emacs-lisp
  (setq org-agenda-files   (list "~/workspace/me/org/")
        org-log-done 'time
        )
#+end_src

*** by packages
**** org-super-agenda

This enables a more fine-grained filtering of the agenda items.

#+BEGIN_SRC emacs-lisp
  (use-package org-super-agenda
    :ensure t
    :config
    (org-super-agenda-mode t))
#+END_SRC

**** org-clock-convenience

#+BEGIN_SRC emacs-lisp
  (use-package org-clock-convenience
    :ensure t
    :bind (:map org-agenda-mode-map
             ("<S-right>" . org-clock-convenience-timestamp-up)
             ("<S-left>" . org-clock-convenience-timestamp-down)
             ("[" . org-clock-convenience-fill-gap)
             ("]" . org-clock-convenience-fill-gap-both)))
#+END_SRC

**** org-habit

#+BEGIN_SRC emacs-lisp
(use-package org-habit
  :delight
  :config
  (setq org-habit-graph-column 38)
  (setq org-habit-preceding-days 35)
  (setq org-habit-following-days 10)
  (setq org-habit-show-habits-only-for-today nil))
#+END_SRC

**** org-secretary

This package is good, but it does not do it simply. I re-modeled it
somewhat below.

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package org-secretary
    :ensure org-plus-contrib
    :config
    (setq org-sec-me "feng")
    (setq org-tag-alist '(("PRJ" . ?p)
                          ("DESIGNDOC" . ?D)
                          ("Milestone" . ?m)
                          ("DESK" . ?d)
                          ("HOME" . ?h)
                          ("VC" . ?v))))
#+END_SRC

This is my version of the org-secretary
#+BEGIN_SRC emacs-lisp
    (use-package paf-secretary
      :load-path "~/Emacs"
      :bind (("\C-cw" . paf-sec-set-with)
             ("\C-cW" . paf-sec-set-where)
             ("\C-cj" . paf-sec-tag-entry))
      :config
      (setq paf-sec-me "paf")
      (setq org-tag-alist '(("PRJ" . ?p)
                            ("DESIGNDOC" . ?D)
                            ("Milestone" . ?m)
                            ("DESK" . ?d)
                            ("HOME" . ?h)
                            ("VC" . ?v))))
#+END_SRC
**** org-duration

#+BEGIN_SRC emacs-lisp
  (use-package org-duration
    :config
    (setq org-duration-units
          `(("min" . 1)
            ("h" . 60)
            ("d" . ,(* 60 8))
            ("w" . ,(* 60 8 5))
            ("m" . ,(* 60 8 5 4))
            ("y" . ,(* 60 8 5 4 10)))
          )
    (org-duration-set-regexps))
#+END_SRC

