content/downloads/emacs/emacs_setup.html

<div id="outline-container-org7a4ce17" class="outline-4">
<h4 id="org7a4ce17"><span class="section-number-4">18.6.4</span> org-reveal</h4>
<div class="outline-text-4" id="text-18-6-4">
<p>
You need to install <code>reveal.js</code> offline, then specify its path here.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">ox-reveal</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:after</span> <span style="color: #93a8c6;">(</span>htmlize<span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> org-reveal-root <span style="color: #b0b1a3;">(</span>expand-file-name <span style="color: #EEDC82;">"~/reveal.js"</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">htmlize</span>
  <span style="color: #FF80F4;">:ensure</span> t<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org67e6b3f" class="outline-4">
<h4 id="org67e6b3f"><span class="section-number-4">18.6.5</span> odt</h4>
<div class="outline-text-4" id="text-18-6-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">ox-odt</span>
  <span style="color: #FF80F4;">:defer</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc75c8a5" class="outline-4">
<h4 id="orgc75c8a5"><span class="section-number-4">18.6.6</span> taskjuggler</h4>
<div class="outline-text-4" id="text-18-6-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">ox-taskjuggler</span>
  <span style="color: #FF80F4;">:defer</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org947d522" class="outline-4">
<h4 id="org947d522"><span class="section-number-4">18.6.7</span> confluence</h4>
<div class="outline-text-4" id="text-18-6-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">ox-confluence</span>
  <span style="color: #FF80F4;">:defer</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9ad2aa0" class="outline-3">
<h3 id="org9ad2aa0"><span class="section-number-3">18.7</span> managing life (aka. agenda/todo)</h3>
<div class="outline-text-3" id="text-18-7">
<p>
Part 3 of org, managing TODOs.
</p>
</div>


<div id="outline-container-org1f53801" class="outline-4">
<h4 id="org1f53801"><span class="section-number-4">18.7.1</span> where are my agenda files</h4>
<div class="outline-text-4" id="text-18-7-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-agenda-files   <span style="color: #93a8c6;">(</span>list <span style="color: #EEDC82;">"~/workspace/me/org/"</span><span style="color: #93a8c6;">)</span>
      org-log-done 'time
      <span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org352bb6a" class="outline-4">
<h4 id="org352bb6a"><span class="section-number-4">18.7.2</span> by packages</h4>
<div class="outline-text-4" id="text-18-7-2">
</div>
<ol class="org-ol">
<li><a id="orgf3c52de"></a>org-super-agenda<br />
<div class="outline-text-5" id="text-18-7-2-1">
<p>
This enables a more fine-grained filtering of the agenda items.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">org-super-agenda</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span>org-super-agenda-mode t<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org838ccca"></a>org-clock-convenience<br />
<div class="outline-text-5" id="text-18-7-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">org-clock-convenience</span>
  <span style="color: #FF80F4;">:ensure</span> t
  <span style="color: #FF80F4;">:bind</span> <span style="color: #93a8c6;">(</span><span style="color: #FF80F4;">:map</span> org-agenda-mode-map
           <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"&lt;S-right&gt;"</span> . org-clock-convenience-timestamp-up<span style="color: #b0b1a3;">)</span>
           <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"&lt;S-left&gt;"</span> . org-clock-convenience-timestamp-down<span style="color: #b0b1a3;">)</span>
           <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"["</span> . org-clock-convenience-fill-gap<span style="color: #b0b1a3;">)</span>
           <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"]"</span> . org-clock-convenience-fill-gap-both<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgfc3b15f"></a>org-habit<br />
<div class="outline-text-5" id="text-18-7-2-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">org-habit</span>
  <span style="color: #FF80F4;">:delight</span>
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> org-habit-graph-column 38<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> org-habit-preceding-days 35<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> org-habit-following-days 10<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> org-habit-show-habits-only-for-today nil<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgdf85a64"></a>org-secretary<br />
<div class="outline-text-5" id="text-18-7-2-4">
<p>
This package is good, but it does not do it simply. I re-modeled it
somewhat below.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">org-secretary</span>
  <span style="color: #FF80F4;">:ensure</span> org-plus-contrib
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> org-sec-me <span style="color: #EEDC82;">"feng"</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> org-tag-alist '<span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span><span style="color: #EEDC82;">"PRJ"</span> . ?p<span style="color: #97b098;">)</span>
                        <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"DESIGNDOC"</span> . ?D<span style="color: #97b098;">)</span>
                        <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"Milestone"</span> . ?m<span style="color: #97b098;">)</span>
                        <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"DESK"</span> . ?d<span style="color: #97b098;">)</span>
                        <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"HOME"</span> . ?h<span style="color: #97b098;">)</span>
                        <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"VC"</span> . ?v<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
This is my version of the org-secretary
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">paf-secretary</span>
  <span style="color: #FF80F4;">:load-path</span> <span style="color: #EEDC82;">"~/Emacs"</span>
  <span style="color: #FF80F4;">:bind</span> <span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"\C-cw"</span> . paf-sec-set-with<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"\C-cW"</span> . paf-sec-set-where<span style="color: #b0b1a3;">)</span>
         <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"\C-cj"</span> . paf-sec-tag-entry<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> paf-sec-me <span style="color: #EEDC82;">"paf"</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> org-tag-alist '<span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span><span style="color: #EEDC82;">"PRJ"</span> . ?p<span style="color: #97b098;">)</span>
                        <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"DESIGNDOC"</span> . ?D<span style="color: #97b098;">)</span>
                        <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"Milestone"</span> . ?m<span style="color: #97b098;">)</span>
                        <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"DESK"</span> . ?d<span style="color: #97b098;">)</span>
                        <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"HOME"</span> . ?h<span style="color: #97b098;">)</span>
                        <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"VC"</span> . ?v<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="orgf38ca20"></a>org-duration<br />
<div class="outline-text-5" id="text-18-7-2-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">use-package</span> <span style="color: #FF80F4;">org-duration</span>
  <span style="color: #FF80F4;">:config</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">setq</span> org-duration-units
        `<span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span><span style="color: #EEDC82;">"min"</span> . 1<span style="color: #97b098;">)</span>
          <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"h"</span> . 60<span style="color: #97b098;">)</span>
          <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"d"</span> . ,<span style="color: #aebed8;">(</span>* 60 8<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
          <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"w"</span> . ,<span style="color: #aebed8;">(</span>* 60 8 5<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
          <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"m"</span> . ,<span style="color: #aebed8;">(</span>* 60 8 5 4<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
          <span style="color: #97b098;">(</span><span style="color: #EEDC82;">"y"</span> . ,<span style="color: #aebed8;">(</span>* 60 8 5 4 10<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>org-duration-set-regexps<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
