content/downloads/emacs/emacs_setup.org
*** keywords & status state machine

TODO doesn't have to have a special keyword. However, once you have a
list, you can enjoy things like color coded font, status transition
timestamp, and kinda of query report such as "give me the list of my
<meetings>". Just convenient.

The state machine is essentially your workflow, how you want to take a
task through its stages, eg. from ready to in-progress to in-review to
done. So really, develop a workflow of your own that fits your way of
thinking, and it should feel natural how you handle a todo in daily
life.

I think this is the single most challenging point to adopt Org because
people, myself included, are hardly capable to analyze your own task
handling habit to abstract such workflow. Company hires consulting
firms to do that for them; an individual, unlikely. We coast along
life everyday, but who can write down "here is how I get a TODO off my
list, each time!?".

Anyway, I think adopting Org is essentially to force yourself into a
*routine* that is codified. It sounds rigid, IT-ish. But for efficiency,
it's a necessary evil.

#+BEGIN_SRC emacs-lisp
  (setq org-todo-keywords
        '((sequence "TODO(t!)" "WORKING(w!)" "|" "DONE(d!)" "CANCELLED(C@)" "DEFERRED(D@)" "SOMEDAY(S!)" "FAILED(F!)" "REFILED(R!)")
          (sequence "TASK(m!)" "ACTIVE" "|" "DONE(d!)" "CANCELLED(C@)" )))

  (setq org-tags-exclude-from-inheritance '("PRJ" "REGULAR")
        org-use-property-inheritance '("PRIORITY")
        org-stuck-projects '("+PRJ/-DONE-CANCELLED"
                             ;; it is considered stuck if there is no next action
                             (;"TODO"
                              "WORKING" "ACTIVE" "TASK") ()))

  (setq org-todo-keyword-faces
        '(
          ("TODO" . (:foreground "GhostWhite" :weight bold))
          ("TASK" . (:foreground "steelblue" :weight bold))
          ("NEXT" . (:foreground "red" :weight bold))
          ("STARTED" . (:foreground "green" :weight bold))
          ("WAITING" . (:foreground "orange" :weight bold))
          ("FLAG_GATED" . (:foreground "orange" :weight bold))
          ("SOMEDAY" . (:foreground "steelblue" :weight bold))
          ("MAYBE" . (:foreground "steelblue" :weight bold))
          ("AI" . (:foreground "red" :weight bold))
          ("NEW" . (:foreground "orange" :weight bold))
          ("RUNNING" . (:foreground "orange" :weight bold))
          ("WORKED" . (:foreground "green" :weight bold))
          ("FAILED" . (:foreground "red" :weight bold))
          ("REFILED" . (:foreground "gray"))
          ;; For publications
          ("APPLIED" . (:foreground "orange" :weight bold))
          ("ACCEPTED" . (:foreground "orange" :weight bold))
          ("REJECTED" . (:foreground "red" :weight bold))
          ("PUBLISHED" . (:foreground "green" :weight bold))
          ;; Other stuff
          ("ACTIVE" . (:foreground "darkgreen" :weight bold))
          ))
#+END_SRC

*** priorities

Set color for priorities based on [[http://pragmaticemacs.com/emacs/org-mode-basics-vi-a-simple-todo-list/][this]].
#+BEGIN_SRC emacs-lisp
(setq org-priority-faces '((?A . (:foreground "OrangeRed" :weight bold))
                           (?B . (:foreground "LightSteelBlue"))
                           (?C . (:foreground "OliveDrab"))))
#+END_SRC

