content/downloads/emacs/emacs_setup.html

<div id="outline-container-org5efcf54" class="outline-4">
<h4 id="org5efcf54"><span class="section-number-4">18.7.3</span> keywords &amp; status state machine</h4>
<div class="outline-text-4" id="text-18-7-3">
<p>
TODO doesn't have to have a special keyword. However, once you have a
list, you can enjoy things like color coded font, status transition
timestamp, and kinda of query report such as "give me the list of my
&lt;meetings&gt;". Just convenient.
</p>

<p>
The state machine is essentially your workflow, how you want to take a
task through its stages, eg. from ready to in-progress to in-review to
done. So really, develop a workflow of your own that fits your way of
thinking, and it should feel natural how you handle a todo in daily
life.
</p>

<p>
I think this is the single most challenging point to adopt Org because
people, myself included, are hardly capable to analyze your own task
handling habit to abstract such workflow. Company hires consulting
firms to do that for them; an individual, unlikely. We coast along
life everyday, but who can write down "here is how I get a TODO off my
list, each time!?".
</p>

<p>
Anyway, I think adopting Org is essentially to force yourself into a
<b>routine</b> that is codified. It sounds rigid, IT-ish. But for efficiency,
it's a necessary evil.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-todo-keywords
      '<span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span>sequence <span style="color: #EEDC82;">"TODO(t!)"</span> <span style="color: #EEDC82;">"WORKING(w!)"</span> <span style="color: #EEDC82;">"|"</span> <span style="color: #EEDC82;">"DONE(d!)"</span> <span style="color: #EEDC82;">"CANCELLED(C@)"</span> <span style="color: #EEDC82;">"DEFERRED(D@)"</span> <span style="color: #EEDC82;">"SOMEDAY(S!)"</span> <span style="color: #EEDC82;">"FAILED(F!)"</span> <span style="color: #EEDC82;">"REFILED(R!)"</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span>sequence <span style="color: #EEDC82;">"TASK(m!)"</span> <span style="color: #EEDC82;">"ACTIVE"</span> <span style="color: #EEDC82;">"|"</span> <span style="color: #EEDC82;">"DONE(d!)"</span> <span style="color: #EEDC82;">"CANCELLED(C@)"</span> <span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-tags-exclude-from-inheritance '<span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"PRJ"</span> <span style="color: #EEDC82;">"REGULAR"</span><span style="color: #93a8c6;">)</span>
      org-use-property-inheritance '<span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"PRIORITY"</span><span style="color: #93a8c6;">)</span>
      org-stuck-projects '<span style="color: #93a8c6;">(</span><span style="color: #EEDC82;">"+PRJ/-DONE-CANCELLED"</span>
                           <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">it is considered stuck if there is no next action</span>
                           <span style="color: #b0b1a3;">(</span><span style="color: #8C8C8C;">;</span><span style="color: #696969; font-style: italic;">"TODO"</span>
                            <span style="color: #EEDC82;">"WORKING"</span> <span style="color: #EEDC82;">"ACTIVE"</span> <span style="color: #EEDC82;">"TASK"</span><span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">()</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-todo-keyword-faces
      '<span style="color: #93a8c6;">(</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"TODO"</span> . <span style="color: #97b098;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"GhostWhite"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"TASK"</span> . <span style="color: #97b098;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"steelblue"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"NEXT"</span> . <span style="color: #97b098;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"red"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"STARTED"</span> . <span style="color: #97b098;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"green"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"WAITING"</span> . <span style="color: #97b098;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"orange"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"FLAG_GATED"</span> . <span style="color: #97b098;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"orange"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"SOMEDAY"</span> . <span style="color: #97b098;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"steelblue"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"MAYBE"</span> . <span style="color: #97b098;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"steelblue"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"AI"</span> . <span style="color: #97b098;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"red"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"NEW"</span> . <span style="color: #97b098;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"orange"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"RUNNING"</span> . <span style="color: #97b098;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"orange"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"WORKED"</span> . <span style="color: #97b098;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"green"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"FAILED"</span> . <span style="color: #97b098;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"red"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"REFILED"</span> . <span style="color: #97b098;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"gray"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">For publications</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"APPLIED"</span> . <span style="color: #97b098;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"orange"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"ACCEPTED"</span> . <span style="color: #97b098;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"orange"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"REJECTED"</span> . <span style="color: #97b098;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"red"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"PUBLISHED"</span> . <span style="color: #97b098;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"green"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Other stuff</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"ACTIVE"</span> . <span style="color: #97b098;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"darkgreen"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga909a1d" class="outline-4">
<h4 id="orga909a1d"><span class="section-number-4">18.7.4</span> priorities</h4>
<div class="outline-text-4" id="text-18-7-4">
<p>
Set color for priorities based on <a href="http://pragmaticemacs.com/emacs/org-mode-basics-vi-a-simple-todo-list/">this</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-priority-faces '<span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span>?A . <span style="color: #97b098;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"OrangeRed"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
                           <span style="color: #b0b1a3;">(</span>?B . <span style="color: #97b098;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"LightSteelBlue"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
                           <span style="color: #b0b1a3;">(</span>?C . <span style="color: #97b098;">(</span><span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"OliveDrab"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
