content/downloads/emacs/emacs_setup.org
*** capture & refile

Capture and refile stuff, with some templates that I think are useful.

Very nice post on how to get capture templats from a file: [[https://joshrollinswrites.com/help-desk-head-desk/org-capture-in-files/][Org-capture
in Files]].

#+BEGIN_SRC emacs-lisp
  (setq org-default-notes-file (org-relative-file "~/workspace/me/org/tasks.org"))

  (setq org-capture-templates
        `(("t" "Task"
           entry (file+headline ,(org-relative-file "~/workspace/me/org/tasks.org") "Tasks")
           "* TODO [#A] %?\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n"
           :clock-resume t)
          ;;
          ("i" "Idea"
           entry (file+headline ,(org-relative-file "~/workspace/me/org/tasks.org") "Ideas")
           "* SOMEDAY %?\n%U\n\n%x"
           :clock-resume t)
          ;;
          ("m" "Meeting"
           entry (file+headline ,(org-relative-file "~/workspace/me/org/meeting.org") "Meetings")
           "* %?  :MTG:\n%U\n%^{with}p")

          ;;
          ("s" "Stand-up"
           entry (file+headline ,(org-relative-file "~/workspace/me/org/tasks.org") "Meetings")
           "* Stand-up  :MTG:\n%U\n\n%?")

          ;;
          ("1" "1:1"
           entry (file+headline ,(org-relative-file "~/workspace/me/org/meeting.org") "Meetings")
           "* 1:1 %^{With}  :MTG:\n%U\n:PROPERTIES:\n:with: %\\1\n:END:\n\n%?")

          ;;
          ("e" "Emails" entry (file+headline "~/workspace/me/org/tasks.org" "Emails")
           "* TODO %:fromname: %a %?\nDEADLINE: %(org-insert-time-stamp (org-read-date nil t \"+2d\"))")
          ;;
          ("j" "Jobs" entry (file+headline "~/workspace/me/org/jobs.org" "Interviews")
           "* TODO %:fromname: %a %?\nDEADLINE: %(org-insert-time-stamp (org-read-date nil t \"+1d\"))")
          ;;
          ("j" "Journal"
           entry (file+olp+datetree ,(org-relative-file "~/workspace/me/org/journal.org"))
           "* %?\n%U"
           :clock-in t
           :clock-resume t
           :kill-buffer t)))

  ;; show up to 2 levels for refile targets, in all agenda files
  (setq org-refile-targets '((org-agenda-files . (:maxlevel . 2))))
  (setq org-log-refile t)  ;; will add timestamp when refiled.

  ;; from: http://doc.norang.ca/org-mode.html
  ;; Exclude DONE state tasks from refile targets
  (defun bh/verify-refile-target ()
    "Exclude todo keywords with a done state from refile targets"
    (not (member (nth 2 (org-heading-components)) org-done-keywords)))
  (setq org-refile-target-verify-function 'bh/verify-refile-target)
#+END_SRC

*** task tracking

Track task dependencies, and dim them in the agenda.

#+BEGIN_SRC emacs-lisp
  (setq org-enforce-todo-dependencies t)
  (setq org-agenda-dim-blocked-tasks 'invisible)
#+END_SRC

*** effort & columns mode

#+BEGIN_SRC emacs-lisp
  (setq org-global-properties
        '(("Effort_ALL". "0 0:10 0:30 1:00 2:00 4:00 8:00 16:00")))
  (setq org-columns-default-format
        "%TODO %30ITEM %3PRIORITY %6Effort{:} %10DEADLINE")
#+END_SRC

*** shortcut to open first agenda file

F12 open the first agenda file

#+BEGIN_SRC emacs-lisp
  (defun org-get-first-agenda-file ()
    (interactive)
    (find-file (elt org-agenda-files 0)))
  (global-set-key [f12] 'org-get-first-agenda-file)
  ; F12 on Mac OSX displays the dashboard....
  (global-set-key [C-f12] 'org-get-first-agenda-file)
#+END_SRC

*** org-agenda
