content/downloads/emacs/emacs_setup.html

<div id="outline-container-org09928f2" class="outline-4">
<h4 id="org09928f2"><span class="section-number-4">18.7.5</span> capture &amp; refile</h4>
<div class="outline-text-4" id="text-18-7-5">
<p>
Capture and refile stuff, with some templates that I think are useful.
</p>

<p>
Very nice post on how to get capture templats from a file: <a href="https://joshrollinswrites.com/help-desk-head-desk/org-capture-in-files/">Org-capture
in Files</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-default-notes-file <span style="color: #93a8c6;">(</span>org-relative-file <span style="color: #EEDC82;">"~/workspace/me/org/tasks.org"</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-capture-templates
      `<span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"t"</span> <span style="color: #EEDC82;">"Task"</span>
         entry <span style="color: #97b098;">(</span>file+headline ,<span style="color: #aebed8;">(</span>org-relative-file <span style="color: #EEDC82;">"~/workspace/me/org/tasks.org"</span><span style="color: #aebed8;">)</span> <span style="color: #EEDC82;">"Tasks"</span><span style="color: #97b098;">)</span>
         <span style="color: #EEDC82;">"* TODO [#A] %?\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n"</span>
         <span style="color: #FF80F4;">:clock-resume</span> t<span style="color: #b0b1a3;">)</span>
        <span style="color: #8C8C8C;">;;</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"i"</span> <span style="color: #EEDC82;">"Idea"</span>
         entry <span style="color: #97b098;">(</span>file+headline ,<span style="color: #aebed8;">(</span>org-relative-file <span style="color: #EEDC82;">"~/workspace/me/org/tasks.org"</span><span style="color: #aebed8;">)</span> <span style="color: #EEDC82;">"Ideas"</span><span style="color: #97b098;">)</span>
         <span style="color: #EEDC82;">"* SOMEDAY %?\n%U\n\n%x"</span>
         <span style="color: #FF80F4;">:clock-resume</span> t<span style="color: #b0b1a3;">)</span>
        <span style="color: #8C8C8C;">;;</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"m"</span> <span style="color: #EEDC82;">"Meeting"</span>
         entry <span style="color: #97b098;">(</span>file+headline ,<span style="color: #aebed8;">(</span>org-relative-file <span style="color: #EEDC82;">"~/workspace/me/org/meeting.org"</span><span style="color: #aebed8;">)</span> <span style="color: #EEDC82;">"Meetings"</span><span style="color: #97b098;">)</span>
         <span style="color: #EEDC82;">"* %?  :MTG:\n%U\n%^{with}p"</span><span style="color: #b0b1a3;">)</span>

        <span style="color: #8C8C8C;">;;</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"s"</span> <span style="color: #EEDC82;">"Stand-up"</span>
         entry <span style="color: #97b098;">(</span>file+headline ,<span style="color: #aebed8;">(</span>org-relative-file <span style="color: #EEDC82;">"~/workspace/me/org/tasks.org"</span><span style="color: #aebed8;">)</span> <span style="color: #EEDC82;">"Meetings"</span><span style="color: #97b098;">)</span>
         <span style="color: #EEDC82;">"* Stand-up  :MTG:\n%U\n\n%?"</span><span style="color: #b0b1a3;">)</span>

        <span style="color: #8C8C8C;">;;</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"1"</span> <span style="color: #EEDC82;">"1:1"</span>
         entry <span style="color: #97b098;">(</span>file+headline ,<span style="color: #aebed8;">(</span>org-relative-file <span style="color: #EEDC82;">"~/workspace/me/org/meeting.org"</span><span style="color: #aebed8;">)</span> <span style="color: #EEDC82;">"Meetings"</span><span style="color: #97b098;">)</span>
         <span style="color: #EEDC82;">"* 1:1 %^{With}  :MTG:\n%U\n:PROPERTIES:\n:with: %\\1\n:END:\n\n%?"</span><span style="color: #b0b1a3;">)</span>

        <span style="color: #8C8C8C;">;;</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"e"</span> <span style="color: #EEDC82;">"Emails"</span> entry <span style="color: #97b098;">(</span>file+headline <span style="color: #EEDC82;">"~/workspace/me/org/tasks.org"</span> <span style="color: #EEDC82;">"Emails"</span><span style="color: #97b098;">)</span>
         <span style="color: #EEDC82;">"* TODO %:fromname: %a %?\nDEADLINE: %(org-insert-time-stamp (org-read-date nil t \"+2d\"))"</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #8C8C8C;">;;</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"j"</span> <span style="color: #EEDC82;">"Jobs"</span> entry <span style="color: #97b098;">(</span>file+headline <span style="color: #EEDC82;">"~/workspace/me/org/jobs.org"</span> <span style="color: #EEDC82;">"Interviews"</span><span style="color: #97b098;">)</span>
         <span style="color: #EEDC82;">"* TODO %:fromname: %a %?\nDEADLINE: %(org-insert-time-stamp (org-read-date nil t \"+1d\"))"</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #8C8C8C;">;;</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"j"</span> <span style="color: #EEDC82;">"Journal"</span>
         entry <span style="color: #97b098;">(</span>file+olp+datetree ,<span style="color: #aebed8;">(</span>org-relative-file <span style="color: #EEDC82;">"~/workspace/me/org/journal.org"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
         <span style="color: #EEDC82;">"* %?\n%U"</span>
         <span style="color: #FF80F4;">:clock-in</span> t
         <span style="color: #FF80F4;">:clock-resume</span> t
         <span style="color: #FF80F4;">:kill-buffer</span> t<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">show up to 2 levels for refile targets, in all agenda files</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-refile-targets '<span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span>org-agenda-files . <span style="color: #97b098;">(</span><span style="color: #FF80F4;">:maxlevel</span> . 2<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-log-refile t<span style="color: #8c8c8c;">)</span>  <span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">will add timestamp when refiled.</span>

<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">from: http://doc.norang.ca/org-mode.html</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Exclude DONE state tasks from refile targets</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">bh/verify-refile-target</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #EEDC82;">"Exclude todo keywords with a done state from refile targets"</span>
  <span style="color: #93a8c6;">(</span>not <span style="color: #b0b1a3;">(</span>member <span style="color: #97b098;">(</span>nth 2 <span style="color: #aebed8;">(</span>org-heading-components<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span> org-done-keywords<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-refile-target-verify-function 'bh/verify-refile-target<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org68bb15f" class="outline-4">
<h4 id="org68bb15f"><span class="section-number-4">18.7.6</span> task tracking</h4>
<div class="outline-text-4" id="text-18-7-6">
<p>
Track task dependencies, and dim them in the agenda.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-enforce-todo-dependencies t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-agenda-dim-blocked-tasks 'invisible<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org47f9887" class="outline-4">
<h4 id="org47f9887"><span class="section-number-4">18.7.7</span> effort &amp; columns mode</h4>
<div class="outline-text-4" id="text-18-7-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-global-properties
      '<span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"Effort_ALL"</span>. <span style="color: #EEDC82;">"0 0:10 0:30 1:00 2:00 4:00 8:00 16:00"</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-columns-default-format
      <span style="color: #EEDC82;">"%TODO %30ITEM %3PRIORITY %6Effort{:} %10DEADLINE"</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga76b7b8" class="outline-4">
<h4 id="orga76b7b8"><span class="section-number-4">18.7.8</span> shortcut to open first agenda file</h4>
<div class="outline-text-4" id="text-18-7-8">
<p>
F12 open the first agenda file
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">org-get-first-agenda-file</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">interactive</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span>find-file <span style="color: #b0b1a3;">(</span>elt org-agenda-files 0<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #93a8c6;">[</span>f12<span style="color: #93a8c6;">]</span> 'org-get-first-agenda-file<span style="color: #8c8c8c;">)</span>
<span style="color: #8C8C8C;">; </span><span style="color: #696969; font-style: italic;">F12 on Mac OSX displays the dashboard....</span>
<span style="color: #8c8c8c;">(</span>global-set-key <span style="color: #93a8c6;">[</span>C-f12<span style="color: #93a8c6;">]</span> 'org-get-first-agenda-file<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
