content/downloads/emacs/emacs_setup.html

<div id="outline-container-org62b11f1" class="outline-4">
<h4 id="org62b11f1"><span class="section-number-4">18.7.9</span> org-agenda</h4>
<div class="outline-text-4" id="text-18-7-9">
</div>
<ol class="org-ol">
<li><a id="orgec83fb7"></a>views<br />
<div class="outline-text-5" id="text-18-7-9-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-agenda-custom-commands
      '<span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"t"</span> <span style="color: #EEDC82;">"Hot Today"</span> <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>agenda <span style="color: #EEDC82;">""</span> <span style="color: #b0b0b3;">(</span><span style="color: #90a890;">(</span>org-agenda-span 'day<span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
                          <span style="color: #aebed8;">(</span>tags-todo <span style="color: #EEDC82;">"-with={.+}/WAITING"</span><span style="color: #aebed8;">)</span>
                          <span style="color: #aebed8;">(</span>tags-todo <span style="color: #EEDC82;">"-with={.+}+TODO=\"STARTED\""</span><span style="color: #aebed8;">)</span>
                          <span style="color: #aebed8;">(</span>tags-todo <span style="color: #EEDC82;">"/NEXT"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"T"</span> <span style="color: #EEDC82;">"Team Today"</span> <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>agenda <span style="color: #EEDC82;">""</span> <span style="color: #b0b0b3;">(</span><span style="color: #90a890;">(</span>org-agenda-span 'day<span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
                           <span style="color: #aebed8;">(</span>tags-todo <span style="color: #EEDC82;">"with={.+}"</span>
                                    <span style="color: #b0b0b3;">(</span><span style="color: #90a890;">(</span>org-super-agenda-groups
                                      '<span style="color: #a2b6da;">(</span><span style="color: #9cb6ad;">(</span><span style="color: #FF80F4;">:auto-property</span> <span style="color: #EEDC82;">"with"</span><span style="color: #9cb6ad;">)</span><span style="color: #a2b6da;">)</span><span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span>
                                    <span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"r"</span> <span style="color: #EEDC82;">"Recurring"</span> <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>tags <span style="color: #EEDC82;">"REGULAR"</span><span style="color: #aebed8;">)</span>
                          <span style="color: #aebed8;">(</span>tags-todo <span style="color: #EEDC82;">"/WAITING"</span><span style="color: #aebed8;">)</span>
                          <span style="color: #aebed8;">(</span>tags-todo <span style="color: #EEDC82;">"TODO=\"STARTED\""</span><span style="color: #aebed8;">)</span>
                          <span style="color: #aebed8;">(</span>tags-todo <span style="color: #EEDC82;">"/NEXT"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"n"</span> <span style="color: #EEDC82;">"Agenda and all TODO's"</span> <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>agenda <span style="color: #EEDC82;">""</span><span style="color: #aebed8;">)</span>
                                      <span style="color: #aebed8;">(</span>alltodo <span style="color: #EEDC82;">""</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"N"</span> <span style="color: #EEDC82;">"Next actions"</span> tags-todo <span style="color: #EEDC82;">"-dowith={.+}/!-TASK-TODO"</span>
         <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>org-agenda-todo-ignore-scheduled t<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"h"</span> <span style="color: #EEDC82;">"Work todos"</span> tags-todo <span style="color: #EEDC82;">"-dowith={.+}/!-TASK"</span>
         <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>org-agenda-todo-ignore-scheduled t<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"H"</span> <span style="color: #EEDC82;">"All work todos"</span> tags-todo <span style="color: #EEDC82;">"-personal/!-TASK-CANCELLED"</span>
         <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>org-agenda-todo-ignore-scheduled nil<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"A"</span> <span style="color: #EEDC82;">"Work todos with doat or dowith"</span> tags-todo
         <span style="color: #EEDC82;">"dowith={.+}/!-TASK"</span>
         <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>org-agenda-todo-ignore-scheduled nil<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>

        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"p"</span> <span style="color: #EEDC82;">"Tasks with current WITH and WHERE"</span>
         <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>tags-todo <span style="color: #b0b0b3;">(</span>paf-sec-replace-with-where <span style="color: #EEDC82;">"with={$WITH}"</span> <span style="color: #EEDC82;">".+"</span><span style="color: #b0b0b3;">)</span>
                     <span style="color: #b0b0b3;">(</span><span style="color: #90a890;">(</span>org-agenda-overriding-header
                       <span style="color: #a2b6da;">(</span>paf-sec-replace-with-where <span style="color: #EEDC82;">"Tasks with $WITH in $WHERE"</span> <span style="color: #EEDC82;">"anyone"</span> <span style="color: #EEDC82;">"any place"</span><span style="color: #a2b6da;">)</span><span style="color: #90a890;">)</span>
                      <span style="color: #90a890;">(</span>org-super-agenda-groups
                       '<span style="color: #a2b6da;">(</span><span style="color: #9cb6ad;">(</span><span style="color: #FF80F4;">:name</span> <span style="color: #EEDC82;">""</span> <span style="color: #FF80F4;">:pred</span> paf-sec-limit-to-with-where<span style="color: #9cb6ad;">)</span>
                         <span style="color: #9cb6ad;">(</span><span style="color: #FF80F4;">:discard</span> <span style="color: #8c8c8c;">(</span><span style="color: #FF80F4;">:anything</span> t<span style="color: #8c8c8c;">)</span><span style="color: #9cb6ad;">)</span><span style="color: #a2b6da;">)</span><span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span>
                     <span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"j"</span> <span style="color: #EEDC82;">"TODO dowith and TASK with"</span>
         <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>org-sec-with-view <span style="color: #EEDC82;">"TODO dowith"</span><span style="color: #aebed8;">)</span>
          <span style="color: #aebed8;">(</span>org-sec-stuck-with-view <span style="color: #EEDC82;">"TALK with"</span><span style="color: #aebed8;">)</span>
          <span style="color: #aebed8;">(</span>org-sec-where-view <span style="color: #EEDC82;">"TODO doat"</span><span style="color: #aebed8;">)</span>
          <span style="color: #aebed8;">(</span>org-sec-assigned-with-view <span style="color: #EEDC82;">"TASK with"</span><span style="color: #aebed8;">)</span>
          <span style="color: #aebed8;">(</span>org-sec-stuck-with-view <span style="color: #EEDC82;">"STUCK with"</span><span style="color: #aebed8;">)</span>
          <span style="color: #aebed8;">(</span>todo <span style="color: #EEDC82;">"STARTED"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span><span style="color: #EEDC82;">"J"</span> <span style="color: #EEDC82;">"Interactive TODO dowith and TASK with"</span>
         <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>org-sec-who-view <span style="color: #EEDC82;">"TODO dowith"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-agenda-skip-deadline-prewarning-if-scheduled 2<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgb1b0ee0"></a>delight<br />
<div class="outline-text-5" id="text-18-7-9-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>delight 'org-agenda-mode<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org734d7de"></a>colors and faces<br />
<div class="outline-text-5" id="text-18-7-9-3">
<p>
Make the calendar day info a bit more visible and contrasted.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Faces to make the calendar more colorful.</span>
<span style="color: #8c8c8c;">(</span>custom-set-faces
 '<span style="color: #93a8c6;">(</span>org-agenda-current-time <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> org-time-grid <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"yellow"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-agenda-date <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> org-agenda-structure <span style="color: #FF80F4;">:background</span> <span style="color: #EEDC82;">"pale green"</span> <span style="color: #FF80F4;">:foreground</span> <span style="color: #EEDC82;">"black"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
 '<span style="color: #93a8c6;">(</span>org-agenda-date-weekend <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>t <span style="color: #aebed8;">(</span><span style="color: #FF80F4;">:inherit</span> org-agenda-date <span style="color: #FF80F4;">:background</span> <span style="color: #EEDC82;">"light blue"</span> <span style="color: #FF80F4;">:weight</span> bold<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orga48d805"></a>now marker<br />
<div class="outline-text-5" id="text-18-7-9-4">
<p>
A more visible current-time marker in the agenda
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-agenda-current-time-string <span style="color: #EEDC82;">"&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; NOW &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;"</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>
