content/downloads/emacs/emacs_setup.org
**** auto-refresh

#+BEGIN_SRC emacs-lisp
  ;; will refresh it only if already visible
  (run-at-time nil 180 'update-agenda-if-visible)
  ;;(add-hook 'org-mode-hook
  ;;          (lambda () (run-at-time nil 180 'kiwon/org-agenda-redo-in-other-window)))
#+END_SRC


This would open the agenda if any org file was opened. In the end, I
don't like this feature, so it is disabled by not tangling it.

#+BEGIN_SRC emacs-lisp :tangle no
  ;; Make this happen only if we open an org file.
  (add-hook 'org-mode-hook
            (lambda () (run-with-idle-timer 600 t 'jump-to-org-agenda)))
#+END_SRC

**** auto-save org files when idle

This will save them regularly when the idle for more than a minute.

#+BEGIN_SRC emacs-lisp :tangle no
  (add-hook 'org-mode-hook
            (lambda () (run-with-idle-timer 600 t 'org-save-all-org-buffers)))
#+END_SRC

**** export

That's the export function to update the agenda view.

#+BEGIN_SRC emacs-lisp :tangle no
(setq org-agenda-exporter-settings
      '((ps-number-of-columns 2)
        (ps-portrait-mode t)
        (org-agenda-add-entry-text-maxlines 5)
        (htmlize-output-type 'font)))

(defun dmg-org-update-agenda-file (&optional force)
  (interactive)
  (save-excursion
    (save-window-excursion
      (let ((file "~/www/agenda/agenda.html"))
        (org-agenda-list)
        (org-agenda-write file)))))
#+END_SRC

**** Auto-Refresh Agenda

Refresh org-mode agenda regularly.  [[https://orgmode.org/worg/org-hacks.html#orgab827a7][source on worg]] There are two
functions that supposedly do the same.

#+BEGIN_SRC emacs-lisp
(defun kiwon/org-agenda-redo-in-other-window ()
  "Call org-agenda-redo function even in the non-agenda buffer."
  (interactive)
  (let ((agenda-window (get-buffer-window org-agenda-buffer-name t)))
    (when agenda-window
      (with-selected-window agenda-window (org-agenda-redo)))))

(defun update-agenda-if-visible ()
  (interactive)
  (let ((buf (get-buffer "*Org Agenda*"))
        wind)
    (if buf
        (org-agenda-redo))))
#+END_SRC

**** Display Agenda when idle

Show the agenda when emacs left idle.  [[https://orgmode.org/worg/org-hacks.html#orgaea636d][source on worg]]

#+BEGIN_SRC emacs-lisp
(defun jump-to-org-agenda ()
  (interactive)
  (let ((buf (get-buffer "*Org Agenda*"))
        wind)
    (if buf
        (if (setq wind (get-buffer-window buf))
            (select-window wind)
          (if (called-interactively-p 'any)
              (progn
                (select-window (display-buffer buf t t))
                (org-fit-window-to-buffer)
                (org-agenda-redo)
                )
            (with-selected-window (display-buffer buf)
              (org-fit-window-to-buffer)
              ;;(org-agenda-redo)
              )))
      (call-interactively 'org-agenda-list)))
  ;;(let ((buf (get-buffer "*Calendar*")))
  ;;  (unless (get-buffer-window buf)
  ;;    (org-agenda-goto-calendar)))
  )
#+END_SRC

