content/downloads/emacs/emacs_setup.html

<li><a id="org526049e"></a>auto-refresh<br />
<div class="outline-text-5" id="text-18-7-9-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">will refresh it only if already visible</span>
<span style="color: #8c8c8c;">(</span>run-at-time nil 180 'update-agenda-if-visible<span style="color: #8c8c8c;">)</span>
<span style="color: #8C8C8C;">;;</span><span style="color: #696969; font-style: italic;">(add-hook 'org-mode-hook</span>
<span style="color: #8C8C8C;">;;          </span><span style="color: #696969; font-style: italic;">(lambda () (run-at-time nil 180 'kiwon/org-agenda-redo-in-other-window)))</span>
</pre>
</div>


<p>
This would open the agenda if any org file was opened. In the end, I
don't like this feature, so it is disabled by not tangling it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Make this happen only if we open an org file.</span>
<span style="color: #8c8c8c;">(</span>add-hook 'org-mode-hook
          <span style="color: #93a8c6;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #b0b1a3;">()</span> <span style="color: #b0b1a3;">(</span>run-with-idle-timer 600 t 'jump-to-org-agenda<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgd2e86ef"></a>auto-save org files when idle<br />
<div class="outline-text-5" id="text-18-7-9-6">
<p>
This will save them regularly when the idle for more than a minute.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>add-hook 'org-mode-hook
          <span style="color: #93a8c6;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #b0b1a3;">()</span> <span style="color: #b0b1a3;">(</span>run-with-idle-timer 600 t 'org-save-all-org-buffers<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgfeea8b9"></a>export<br />
<div class="outline-text-5" id="text-18-7-9-7">
<p>
That's the export function to update the agenda view.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-agenda-exporter-settings
      '<span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span>ps-number-of-columns 2<span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span>ps-portrait-mode t<span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span>org-agenda-add-entry-text-maxlines 5<span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span>htmlize-output-type 'font<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">dmg-org-update-agenda-file</span> <span style="color: #93a8c6;">(</span><span style="color: #66D9EF;">&amp;optional</span> force<span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">interactive</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">save-excursion</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">save-window-excursion</span>
      <span style="color: #97b098;">(</span><span style="color: #F92672;">let</span> <span style="color: #aebed8;">(</span><span style="color: #b0b0b3;">(</span>file <span style="color: #EEDC82;">"~/www/agenda/agenda.html"</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
        <span style="color: #aebed8;">(</span>org-agenda-list<span style="color: #aebed8;">)</span>
        <span style="color: #aebed8;">(</span>org-agenda-write file<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgaa4d3a0"></a>Auto-Refresh Agenda<br />
<div class="outline-text-5" id="text-18-7-9-8">
<p>
Refresh org-mode agenda regularly.  <a href="https://orgmode.org/worg/org-hacks.html#orgab827a7">source on worg</a> There are two
functions that supposedly do the same.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">kiwon/org-agenda-redo-in-other-window</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #EEDC82;">"Call org-agenda-redo function even in the non-agenda buffer."</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">interactive</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">let</span> <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>agenda-window <span style="color: #aebed8;">(</span>get-buffer-window org-agenda-buffer-name t<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">when</span> agenda-window
      <span style="color: #97b098;">(</span><span style="color: #F92672;">with-selected-window</span> agenda-window <span style="color: #aebed8;">(</span>org-agenda-redo<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">update-agenda-if-visible</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">interactive</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">let</span> <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>buf <span style="color: #aebed8;">(</span>get-buffer <span style="color: #EEDC82;">"*Org Agenda*"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
        wind<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">if</span> buf
        <span style="color: #97b098;">(</span>org-agenda-redo<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orge968441"></a>Display Agenda when idle<br />
<div class="outline-text-5" id="text-18-7-9-9">
<p>
Show the agenda when emacs left idle.  <a href="https://orgmode.org/worg/org-hacks.html#orgaea636d">source on worg</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">jump-to-org-agenda</span> <span style="color: #93a8c6;">()</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">interactive</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">let</span> <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>buf <span style="color: #aebed8;">(</span>get-buffer <span style="color: #EEDC82;">"*Org Agenda*"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
        wind<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">if</span> buf
        <span style="color: #97b098;">(</span><span style="color: #F92672;">if</span> <span style="color: #aebed8;">(</span><span style="color: #F92672;">setq</span> wind <span style="color: #b0b0b3;">(</span>get-buffer-window buf<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
            <span style="color: #aebed8;">(</span>select-window wind<span style="color: #aebed8;">)</span>
          <span style="color: #aebed8;">(</span><span style="color: #F92672;">if</span> <span style="color: #b0b0b3;">(</span>called-interactively-p 'any<span style="color: #b0b0b3;">)</span>
              <span style="color: #b0b0b3;">(</span><span style="color: #F92672;">progn</span>
                <span style="color: #90a890;">(</span>select-window <span style="color: #a2b6da;">(</span>display-buffer buf t t<span style="color: #a2b6da;">)</span><span style="color: #90a890;">)</span>
                <span style="color: #90a890;">(</span>org-fit-window-to-buffer<span style="color: #90a890;">)</span>
                <span style="color: #90a890;">(</span>org-agenda-redo<span style="color: #90a890;">)</span>
                <span style="color: #b0b0b3;">)</span>
            <span style="color: #b0b0b3;">(</span><span style="color: #F92672;">with-selected-window</span> <span style="color: #90a890;">(</span>display-buffer buf<span style="color: #90a890;">)</span>
              <span style="color: #90a890;">(</span>org-fit-window-to-buffer<span style="color: #90a890;">)</span>
              <span style="color: #8C8C8C;">;;</span><span style="color: #696969; font-style: italic;">(org-agenda-redo)</span>
              <span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
      <span style="color: #97b098;">(</span>call-interactively 'org-agenda-list<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
  <span style="color: #8C8C8C;">;;</span><span style="color: #696969; font-style: italic;">(let ((buf (get-buffer "*Calendar*")))</span>
  <span style="color: #8C8C8C;">;;  </span><span style="color: #696969; font-style: italic;">(unless (get-buffer-window buf)</span>
  <span style="color: #8C8C8C;">;;    </span><span style="color: #696969; font-style: italic;">(org-agenda-goto-calendar)))</span>
  <span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</li>
