content/downloads/emacs/emacs_setup.org
**** Display location in agenda

From some help on [[https://emacs.stackexchange.com/questions/26249/customize-text-after-task-in-custom-org-agenda-view][this page]] I think this could work:

#+BEGIN_SRC emacs-lisp
  (defun paf/org-agenda-get-location()
    "Gets the value of the LOCATION property"
    (let ((loc (org-entry-get (point) "LOCATION")))
      (if (> (length loc) 0)
          loc
        "")))
#+END_SRC


Also, to set this after org-mode has loaded ([[https://emacs.stackexchange.com/questions/19091/how-to-set-org-agenda-prefix-format-before-org-agenda-starts][see here]]):
#+BEGIN_SRC emacs-lisp :tangle no
  (with-eval-after-load 'org-agenda
    (add-to-list 'org-agenda-prefix-format
                 '(agenda . "  %-12:c%?-12t %(paf/org-agenda-get-location)% s"))
#+END_SRC

*** org-clock properties

Good [[https://writequit.org/denver-emacs/presentations/2017-04-11-time-clocking-with-org.html][note about using the clock.]]

Clock stuff into a drawer.

#+BEGIN_SRC emacs-lisp
  (setq org-clock-into-drawer t)
  (setq org-log-into-drawer t)
  (setq org-clock-int-drawer "CLOCK")
#+END_SRC

And according to [[https://orgmode.org/manual/Clocking-Work-Time.html][this]], set clock history:

#+begin_src emacs-lisp
(setq org-clock-persist 'history)
(org-clock-persistence-insinuate)
#+end_src

Set clock out upon task done and prettify:

#+begin_src emacs-lisp
;; Clock out when moving task to a done state
(setq org-clock-out-when-done t)
;; use pretty things for the clocktable
(setq org-pretty-entities t)
#+end_src

** LAST step: reload org

Ran into a [[https://github.com/seagle0128/.emacs.d/issues/129][strange error]], and reloading org at the end is the
solution:

#+BEGIN_SRC emacs-lisp
  (org-mode-restart)
#+END_SRC

* THE END
