content/downloads/emacs/emacs_setup.html

<li><a id="orgcf56e0d"></a>Display location in agenda<br />
<div class="outline-text-5" id="text-18-7-9-10">
<p>
From some help on <a href="https://emacs.stackexchange.com/questions/26249/customize-text-after-task-in-custom-org-agenda-view">this page</a> I think this could work:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">paf/org-agenda-get-location</span><span style="color: #93a8c6;">()</span>
  <span style="color: #EEDC82;">"Gets the value of the LOCATION property"</span>
  <span style="color: #93a8c6;">(</span><span style="color: #F92672;">let</span> <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>loc <span style="color: #aebed8;">(</span>org-entry-get <span style="color: #b0b0b3;">(</span>point<span style="color: #b0b0b3;">)</span> <span style="color: #EEDC82;">"LOCATION"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #F92672;">if</span> <span style="color: #97b098;">(</span>&gt; <span style="color: #aebed8;">(</span>length loc<span style="color: #aebed8;">)</span> 0<span style="color: #97b098;">)</span>
        loc
      <span style="color: #EEDC82;">""</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>


<p>
Also, to set this after org-mode has loaded (<a href="https://emacs.stackexchange.com/questions/19091/how-to-set-org-agenda-prefix-format-before-org-agenda-starts">see here</a>):
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">with-eval-after-load</span> 'org-agenda
  <span style="color: #93a8c6;">(</span>add-to-list 'org-agenda-prefix-format
               '<span style="color: #b0b1a3;">(</span>agenda . <span style="color: #EEDC82;">"  %-12:c%?-12t %(paf/org-agenda-get-location)% s"</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org76bd4ca" class="outline-4">
<h4 id="org76bd4ca"><span class="section-number-4">18.7.10</span> org-clock properties</h4>
<div class="outline-text-4" id="text-18-7-10">
<p>
Good <a href="https://writequit.org/denver-emacs/presentations/2017-04-11-time-clocking-with-org.html">note about using the clock.</a>
</p>

<p>
Clock stuff into a drawer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-clock-into-drawer t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-log-into-drawer t<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-clock-int-drawer <span style="color: #EEDC82;">"CLOCK"</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
And according to <a href="https://orgmode.org/manual/Clocking-Work-Time.html">this</a>, set clock history:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-clock-persist 'history<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>org-clock-persistence-insinuate<span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
Set clock out upon task done and prettify:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">Clock out when moving task to a done state</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-clock-out-when-done t<span style="color: #8c8c8c;">)</span>
<span style="color: #8C8C8C;">;; </span><span style="color: #696969; font-style: italic;">use pretty things for the clocktable</span>
<span style="color: #8c8c8c;">(</span><span style="color: #F92672;">setq</span> org-pretty-entities t<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org76581bc" class="outline-3">
<h3 id="org76581bc"><span class="section-number-3">18.8</span> LAST step: reload org</h3>
<div class="outline-text-3" id="text-18-8">
<p>
Ran into a <a href="https://github.com/seagle0128/.emacs.d/issues/129">strange error</a>, and reloading org at the end is the
solution:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>org-mode-restart<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3db076a" class="outline-2">
<h2 id="org3db076a"><span class="section-number-2">19</span> THE END</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Feng Xia</p>
<p class="date">Created: 2023-11-07 Tue 09:24</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
